{
  "id": "analects",
  "title": "論語",
  "titleEn": "Analects",
  "source": "Chinese Text Project (ctext.org) - James Legge translation",
  "chapter": {
    "number": "5",
    "title": "Gong Ye Chang",
    "slug": "gong-ye-chang",
    "passages": [
      {
        "ref": "5:1",
        "zh": "子謂公冶長，「可妻也。雖在縲絏之中，非其罪也」。",
        "en": "The Master said of Gong Ye Chang that he might be wived; although he was put in bonds, he had not been guilty of any crime."
      },
      {
        "ref": "5:2",
        "zh": "以其子妻之。",
        "en": "Accordingly, he gave him his own daughter to wife."
      },
      {
        "ref": "5:3",
        "zh": "子謂南容，「邦有道，不廢；邦無道，免於刑戮。」",
        "en": "The Master said of Nan Rong that if the country were well governed he would not be out of office, and if it were ill governed, he would escape punishment and disgrace."
      },
      {
        "ref": "5:4",
        "zh": "以其兄之子妻之。",
        "en": "He gave him the daughter of his own elder brother to wife."
      },
      {
        "ref": "5:5",
        "zh": "子謂子賤，「君子哉若人！",
        "en": "The Master said of Zi Jian, \"Of superior virtue indeed is such a man!"
      },
      {
        "ref": "5:6",
        "zh": "魯無君子者，斯焉取斯？」",
        "en": "If there were not virtuous men in Lu, how could this man have acquired this character?\""
      },
      {
        "ref": "5:7",
        "zh": "子貢問曰：「賜也何如？」",
        "en": "Zi Gong asked, \"What do you say of me, Ci!\""
      },
      {
        "ref": "5:8",
        "zh": "子曰：「女器也。」",
        "en": "The Master said, \"You are a utensil.\""
      },
      {
        "ref": "5:9",
        "zh": "曰：「何器也？」",
        "en": "\"What utensil?\""
      },
      {
        "ref": "5:10",
        "zh": "曰：「瑚璉也。」",
        "en": "\"A gemmed sacrificial utensil.\""
      },
      {
        "ref": "5:11",
        "zh": "或曰：「雍也，仁而不佞。」",
        "en": "Some one said, \"Yong is truly virtuous, but he is not ready with his tongue.\""
      },
      {
        "ref": "5:12",
        "zh": "子曰：「焉用佞？禦人以口給，屢憎於人。",
        "en": "The Master said, \"What is the good of being ready with the tongue? They who encounter men with smartness of speech for the most part procure themselves hatred."
      },
      {
        "ref": "5:13",
        "zh": "不知其仁，焉用佞？」",
        "en": "I know not whether he be truly virtuous, but why should he show readiness of the tongue?\""
      },
      {
        "ref": "5:14",
        "zh": "子使漆雕開仕。對曰：「吾斯之未能信。」子說。",
        "en": "The Master was wishing Qi Diao Kai to enter an official employment. He replied, \"I am not yet able to rest in the assurance of THIS.\" The Master was pleased."
      },
      {
        "ref": "5:15",
        "zh": "子曰：「道不行，乘桴浮于海。從我者其由與？」",
        "en": "The Master said, \"My doctrines make no way. I will get upon a raft, and float about on the sea. He that will accompany me will be You, I dare to say.\""
      },
      {
        "ref": "5:16",
        "zh": "子路聞之喜。",
        "en": "Zi Lu hearing this was glad,"
      },
      {
        "ref": "5:17",
        "zh": "子曰：「由也好勇過我，無所取材。」",
        "en": "upon which the Master said, \"You is fonder of daring than I am. He does not exercise his judgment upon matters.\""
      },
      {
        "ref": "5:18",
        "zh": "孟武伯問：「子路仁乎？」",
        "en": "Meng Wu asked about Zi Lu, whether he was perfectly virtuous."
      },
      {
        "ref": "5:19",
        "zh": "子曰：「不知也。」",
        "en": "The Master said, \"I do not know.\""
      },
      {
        "ref": "5:20",
        "zh": "又問。子曰：「由也，千乘之國，可使治其賦也，不知其仁也。」",
        "en": "He asked again, when the Master replied, \"You, in a kingdom of a thousand chariots, might be employed to manage the military levies, but I do not know whether he be perfectly virtuous.\""
      },
      {
        "ref": "5:21",
        "zh": "「求也何如？」子曰：「求也，千室之邑，百乘之家，可使為之宰也，不知其仁也。」",
        "en": "\"And what do you say of Qiu?\" The Master replied, \"Qiu, in a city of a thousand families, or a clan of a hundred chariots, might be employed as governor, but I do not know whether he is perfectly virtuous.\""
      },
      {
        "ref": "5:22",
        "zh": "「赤也何如？」子曰：「赤也，束帶立於朝，可使與賓客言也，不知其仁也。」",
        "en": "\"What do you say of Chi?\" The Master replied, \"Chi, with his sash girt and standing in a court, might be employed to converse with the visitors and guests, but I do not know whether he is perfectly virtuous.\""
      },
      {
        "ref": "5:23",
        "zh": "子謂子貢曰：「女與回也孰愈？」",
        "en": "The Master said to Zi Gong, \"Which do you consider superior, yourself or Hui?\""
      },
      {
        "ref": "5:24",
        "zh": "對曰：「賜也何敢望回。回也聞一以知十，賜也聞一以知二。」",
        "en": "Zi Gong replied, \"How dare I compare myself with Hui? Hui hears one point and knows all about a subject; I hear one point, and know a second.\""
      },
      {
        "ref": "5:25",
        "zh": "子曰：「弗如也！吾與女弗如也。」",
        "en": "The Master said, \"You are not equal to him. I grant you, you are not equal to him.\""
      },
      {
        "ref": "5:26",
        "zh": "宰予晝寢。",
        "en": "Zai Yu being asleep during the daytime,"
      },
      {
        "ref": "5:27",
        "zh": "子曰：「朽木不可雕也，糞土之牆不可杇也，於予與何誅。」",
        "en": "the Master said, \"Rotten wood cannot be carved; a wall of dirty earth will not receive the trowel. This Yu! - what is the use of my reproving him?\""
      },
      {
        "ref": "5:28",
        "zh": "子曰：「始吾於人也，聽其言而信其行；今吾於人也，聽其言而觀其行。於予與改是。」",
        "en": "The Master said, \"At first, my way with men was to hear their words, and give them credit for their conduct. Now my way is to hear their words, and look at their conduct. It is from Yu that I have learned to make this change.\""
      },
      {
        "ref": "5:29",
        "zh": "子曰：「吾未見剛者。」",
        "en": "The Master said, \"I have not seen a firm and unbending man.\""
      },
      {
        "ref": "5:30",
        "zh": "或對曰：「申棖。」",
        "en": "Some one replied, \"There is Shen Cheng.\""
      },
      {
        "ref": "5:31",
        "zh": "子曰：「棖也慾，焉得剛？」",
        "en": "\"Cheng,\" said the Master, \"is under the influence of his passions; how can he be pronounced firm and unbending?\""
      },
      {
        "ref": "5:32",
        "zh": "子貢曰：「我不欲人之加諸我也，吾亦欲無加諸人。」",
        "en": "Zi Gong said, \"What I do not wish men to do to me, I also wish not to do to men.\""
      },
      {
        "ref": "5:33",
        "zh": "子曰：「賜也，非爾所及也。」",
        "en": "The Master said, \"Ci, you have not attained to that.\""
      },
      {
        "ref": "5:34",
        "zh": "子貢曰：「夫子之文章，可得而聞也；",
        "en": "Zi Gong said, \"The Master's personal displays of his principles and ordinary descriptions of them may be heard."
      },
      {
        "ref": "5:35",
        "zh": "夫子之言性與天道，不可得而聞也。」",
        "en": "His discourses about man's nature, and the way of Heaven, cannot be heard.\""
      },
      {
        "ref": "5:36",
        "zh": "子路有聞，未之能行，唯恐有聞。",
        "en": "When Zi Lu heard anything, if he had not yet succeeded in carrying it into practice, he was only afraid lest he should hear something else."
      },
      {
        "ref": "5:37",
        "zh": "子貢問曰：「孔文子何以謂之文也？」",
        "en": "Zi Gong asked, saying, \"On what ground did Kong Wen get that title of Wen?\""
      },
      {
        "ref": "5:38",
        "zh": "子曰：「敏而好學，不恥下問，是以謂之文也。」",
        "en": "The Master said, \"He was of an active nature and yet fond of learning, and he was not ashamed to ask and learn of his inferiors! On these grounds he has been styled Wen.\""
      },
      {
        "ref": "5:39",
        "zh": "子謂子產，「有君子之道四焉：其行己也恭，其事上也敬，其養民也惠，其使民也義。」",
        "en": "The Master said of Zi Chan that he had four of the characteristics of a superior man - in his conduct of himself, he was humble; in serving his superior, he was respectful; in nourishing the people, he was kind; in ordering the people, he was just."
      },
      {
        "ref": "5:40",
        "zh": "子曰：「晏平仲善與人交，久而敬之。」",
        "en": "The Master said, \"Yan Ping knew well how to maintain friendly intercourse. The acquaintance might be long, but he showed the same respect as at first.\""
      },
      {
        "ref": "5:41",
        "zh": "子曰：「臧文仲居蔡，山節藻梲，何如其知也？」",
        "en": "The Master said, \"Zang Wen kept a large tortoise in a house, on the capitals of the pillars of which he had hills made, and with representations of duckweed on the small pillars above the beams supporting the rafters. Of what sort was his wisdom?\""
      },
      {
        "ref": "5:42",
        "zh": "子張問曰：「令尹子文三仕為令尹，無喜色；三已之，無慍色。舊令尹之政，必以告新令尹。何如？」",
        "en": "Zi Zhang asked, saying, \"The minister Zi Wen thrice took office, and manifested no joy in his countenance. Thrice he retired from office, and manifested no displeasure. He made it a point to inform the new minister of the way in which he had conducted the government - what do you say of him?\""
      },
      {
        "ref": "5:43",
        "zh": "子曰：「忠矣。」",
        "en": "The Master replied. \"He was loyal.\""
      },
      {
        "ref": "5:44",
        "zh": "曰：「仁矣乎？」",
        "en": "\"Was he perfectly virtuous?\""
      },
      {
        "ref": "5:45",
        "zh": "曰：「未知，焉得仁？」",
        "en": "\"I do not know. How can he be pronounced perfectly virtuous?\""
      },
      {
        "ref": "5:46",
        "zh": "「崔子弒齊君，陳文子有馬十乘，棄而違之。至於他邦，則曰：『猶吾大夫崔子也。』違之。之一邦，則又曰：『猶吾大夫崔子也。』違之。何如？」",
        "en": "Zi Zhang proceeded, \"When the officer Cui killed the prince of Qi, Chen Wen, though he was the owner of forty horses, abandoned them and left the country. Coming to another state, he said, 'They are here like our great officer, Cui,' and left it. He came to a second state, and again said 'They are here like our great officer, Cui,' and left it also - what do you say of him?\""
      },
      {
        "ref": "5:47",
        "zh": "子曰：「清矣。」",
        "en": "The Master replied, \"He was pure.\""
      },
      {
        "ref": "5:48",
        "zh": "曰：「仁矣乎？」",
        "en": "\"Was he perfectly virtuous?\""
      },
      {
        "ref": "5:49",
        "zh": "曰：「未知。焉得仁？」",
        "en": "\"I do not know. How can he be pronounced perfectly virtuous?\""
      },
      {
        "ref": "5:50",
        "zh": "季文子三思而後行。",
        "en": "Ji Wen thought thrice, and then acted."
      },
      {
        "ref": "5:51",
        "zh": "子聞之，曰：「再，斯可矣。」",
        "en": "When the Master was informed of it, he said, \"Twice may do.\""
      },
      {
        "ref": "5:52",
        "zh": "子曰：「甯武子邦有道則知，邦無道則愚。",
        "en": "The Master said, \"When good order prevailed in his country, Ning Wu acted the part of a wise man. When his country was in disorder, he acted the part of a stupid man."
      },
      {
        "ref": "5:53",
        "zh": "其知可及也，其愚不可及也。」",
        "en": "Others may equal his wisdom, but they cannot equal his stupidity.\""
      },
      {
        "ref": "5:54",
        "zh": "子在陳曰：「歸與！歸與！吾黨之小子狂簡，斐然成章，不知所以裁之。」",
        "en": "When the Master was in Chen, he said, \"Let me return! Let me return! The little children of my school are ambitious and too hasty. They are accomplished and complete so far, but they do not know how to restrict and shape themselves.\""
      },
      {
        "ref": "5:55",
        "zh": "子曰：「伯夷、叔齊不念舊惡，怨是用希。」",
        "en": "The Master said, \"Bo Yi and Shu Qi did not keep the former wickednesses of men in mind, and hence the resentments directed towards them were few.\""
      },
      {
        "ref": "5:56",
        "zh": "子曰：「孰謂微生高直？或乞醯焉，乞諸其鄰而與之。」",
        "en": "The Master said, \"Who says of Wei Sheng Gao that he is upright? One begged some vinegar of him, and he begged it of a neighbor and gave it to the man.\""
      },
      {
        "ref": "5:57",
        "zh": "子曰：「巧言、令色、足恭，左丘明恥之，丘亦恥之。",
        "en": "The Master said, \"Fine words, an insinuating appearance, and excessive respect - Zuo Qiu Ming was ashamed of them. I also am ashamed of them."
      },
      {
        "ref": "5:58",
        "zh": "匿怨而友其人，左丘明恥之，丘亦恥之。」",
        "en": "To conceal resentment against a person, and appear friendly with him - Zuo Qiu Ming was ashamed of such conduct. I also am ashamed of it.\""
      },
      {
        "ref": "5:59",
        "zh": "顏淵、季路侍。子曰：「盍各言爾志？」",
        "en": "Yan Yuan and Ji Lu being by his side, the Master said to them, \"Come, let each of you tell his wishes.\""
      },
      {
        "ref": "5:60",
        "zh": "子路曰：「願車馬、衣輕裘，與朋友共。敝之而無憾。」",
        "en": "Zi Lu said, \"I should like, having chariots and horses, and light fur clothes, to share them with my friends, and though they should spoil them, I would not be displeased.\""
      },
      {
        "ref": "5:61",
        "zh": "顏淵曰：「願無伐善，無施勞。」",
        "en": "Yan Yuan said, \"I should like not to boast of my excellence, nor to make a display of my meritorious deeds.\""
      },
      {
        "ref": "5:62",
        "zh": "子路曰：「願聞子之志。」",
        "en": "Zi Lu then said, \"I should like, sir, to hear your wishes.\""
      },
      {
        "ref": "5:63",
        "zh": "子曰：「老者安之，朋友信之，少者懷之。」",
        "en": "The Master said, \"They are, in regard to the aged, to give them rest; in regard to friends, to show them sincerity; in regard to the young, to treat them tenderly.\""
      },
      {
        "ref": "5:64",
        "zh": "子曰：「已矣乎！吾未見能見其過而內自訟者也。」",
        "en": "The Master said, \"It is all over. I have not yet seen one who could perceive his faults, and inwardly accuse himself.\""
      },
      {
        "ref": "5:65",
        "zh": "子曰：「十室之邑，必有忠信如丘者焉，不如丘之好學也。」",
        "en": "The Master said, \"In a hamlet of ten families, there may be found one honorable and sincere as I am, but not so fond of learning.\""
      }
    ]
  }
}
