{
  "id": "daodejing",
  "title": "道德經",
  "titleEn": "Dao De Jing",
  "source": "Chinese Text Project (ctext.org) - James Legge translation",
  "chapter": {
    "number": "31",
    "title": "Chapter 31",
    "slug": "chapter-31",
    "passages": [
      {
        "ref": "31:1",
        "zh": "夫佳兵者，不祥之器，物或惡之，故有道者不處。",
        "en": "(Stilling war) Now arms, however beautiful, are instruments of evil omen, hateful, it may be said, to all creatures. Therefore they who have the Dao do not like to employ them."
      },
      {
        "ref": "31:2",
        "zh": "君子居則貴左，用兵則貴右。",
        "en": "The superior man ordinarily considers the left hand the most honourable place, but in time of war the right hand."
      },
      {
        "ref": "31:3",
        "zh": "兵者不祥之器，非君子之器，不得已而用之，恬淡為上。",
        "en": "Those sharp weapons are instruments of evil omen, and not the instruments of the superior man; - he uses them only on the compulsion of necessity. Calm and repose are what he prizes;"
      },
      {
        "ref": "31:4",
        "zh": "勝而不美，而美之者，是樂殺人。",
        "en": "victory (by force of arms) is to him undesirable. To consider this desirable would be to delight in the slaughter of men;"
      },
      {
        "ref": "31:5",
        "zh": "夫樂殺人者，則不可以得志於天下矣。",
        "en": "and he who delights in the slaughter of men cannot get his will in the kingdom."
      },
      {
        "ref": "31:6",
        "zh": "吉事尚左，凶事尚右。",
        "en": "On occasions of festivity to be on the left hand is the prized position; on occasions of mourning, the right hand."
      },
      {
        "ref": "31:7",
        "zh": "偏將軍居左，上將軍居右，言以喪禮處之。",
        "en": "The second in command of the army has his place on the left; the general commanding in chief has his on the right; - his place, that is, is assigned to him as in the rites of mourning."
      },
      {
        "ref": "31:8",
        "zh": "殺人之衆，以哀悲泣之，戰勝以喪禮處之。",
        "en": "He who has killed multitudes of men should weep for them with the bitterest grief; and the victor in battle has his place (rightly) according to those rites."
      }
    ]
  }
}
