{
  "id": "daodejing",
  "title": "道德經",
  "titleEn": "Dao De Jing",
  "source": "Chinese Text Project (ctext.org) - James Legge translation",
  "chapter": {
    "number": "39",
    "title": "Chapter 39",
    "slug": "chapter-39",
    "passages": [
      {
        "ref": "39:1",
        "zh": "昔之得一者：天得一以清；地得一以寧；神得一以靈；谷得一以盈；萬物得一以生；侯王得一以為天下貞。",
        "en": "(The origin of the law) The things which from of old have got the One (the Dao) are - Heaven which by it is bright and pure; Earth rendered thereby firm and sure; Spirits with powers by it supplied; Valleys kept full throughout their void; All creatures which through it do live; Princes and kings who from it get the model which to all they give. All these are the results of the One (Dao)."
      },
      {
        "ref": "39:2",
        "zh": "其致之，天無以清，將恐裂；地無以寧，將恐發；神無以靈，將恐歇；谷無以盈，將恐竭；萬物無以生，將恐滅；侯王無以貴高將恐蹶。",
        "en": "If heaven were not thus pure, it soon would rend; If earth were not thus sure, 'twould break and bend; Without these powers, the spirits soon would fail; If not so filled, the drought would parch each vale; Without that life, creatures would pass away; Princes and kings, without that moral sway, however grand and high, would all decay."
      },
      {
        "ref": "39:3",
        "zh": "故貴以賤為本，高以下為基。",
        "en": "Thus it is that dignity finds its (firm) root in its (previous) meanness, and what is lofty finds its stability in the lowness (from which it rises)."
      },
      {
        "ref": "39:4",
        "zh": "是以侯王自稱孤、寡、不穀。",
        "en": "Hence princes and kings call themselves 'Orphans,' 'Men of small virtue,' and as 'Carriages without a nave.'"
      },
      {
        "ref": "39:5",
        "zh": "此非以賤為本耶？非乎？",
        "en": "Is not this an acknowledgment that in their considering themselves mean they see the foundation of their dignity?"
      },
      {
        "ref": "39:6",
        "zh": "故致數譽無譽。",
        "en": "So it is that in the enumeration of the different parts of a carriage we do not come on what makes it answer the ends of a carriage."
      },
      {
        "ref": "39:7",
        "zh": "不欲琭琭如玉，珞珞如石。",
        "en": "They do not wish to show themselves elegant-looking as jade, but (prefer) to be coarse-looking as an (ordinary) stone."
      }
    ]
  }
}
