{
  "id": "mengzi",
  "title": "孟子",
  "titleEn": "Mencius",
  "source": "Chinese Text Project (ctext.org) - James Legge translation",
  "chapter": {
    "number": "12",
    "title": "Gaozi II",
    "slug": "gaozi-ii",
    "passages": [
      {
        "ref": "12:1",
        "zh": "任人有問屋廬子曰：「禮與食孰重？」",
        "en": "A man of Ren asked the disciple Wu Lu, saying, 'Is an observance of the rules of propriety in regard to eating, or eating merely, the more important?'"
      },
      {
        "ref": "12:2",
        "zh": "曰：「禮重。」",
        "en": "The answer was, 'The observance of the rules of propriety is the more important.'"
      },
      {
        "ref": "12:3",
        "zh": "「色與禮孰重？」",
        "en": "'Is the gratifying the appetite of sex, or the doing so only according to the rules of propriety, the more important?'"
      },
      {
        "ref": "12:4",
        "zh": "曰：「禮重。」",
        "en": "The answer again was, 'The observance of the rules of propriety in the matter is the more important.'"
      },
      {
        "ref": "12:5",
        "zh": "曰：「以禮食，則飢而死；不以禮食，則得食，必以禮乎？",
        "en": "The man pursued, 'If the result of eating only according to the rules of propriety will be death by starvation, while by disregarding those rules we may get food, must they still be observed in such a case?"
      },
      {
        "ref": "12:6",
        "zh": "親迎，則不得妻；不親迎，則得妻，必親迎乎！」",
        "en": "If according to the rule that he shall go in person to meet his wife a man cannot get married, while by disregarding that rule he may get married, must he still observe the rule in such a case?'"
      },
      {
        "ref": "12:7",
        "zh": "屋廬子不能對，明日之鄒以告孟子。",
        "en": "Wu Lu was unable to reply to these questions, and the next day he went to Zou, and told them to Mencius."
      },
      {
        "ref": "12:8",
        "zh": "孟子曰：「於答是也何有？",
        "en": "Mencius said, 'What difficulty is there in answering these inquiries?"
      },
      {
        "ref": "12:9",
        "zh": "不揣其本而齊其末，方寸之木可使高於岑樓。",
        "en": "If you do not adjust them at their lower extremities, but only put their tops on a level, a piece of wood an inch square may be made to be higher than the pointed peak of a high building."
      },
      {
        "ref": "12:10",
        "zh": "金重於羽者，豈謂一鉤金與一輿羽之謂哉？",
        "en": "Gold is heavier than feathers; but does that saying have reference, on the one hand, to a single clasp of gold, and, on the other, to a waggon-load of feathers?"
      },
      {
        "ref": "12:11",
        "zh": "取食之重者，與禮之輕者而比之，奚翅食重？",
        "en": "If you take a case where the eating is of the utmost importance and the observing the rules of propriety is of little importance, and compare the things together, why stop with saying merely that the eating is more important?"
      },
      {
        "ref": "12:12",
        "zh": "取色之重者，與禮之輕者而比之，奚翅色重？",
        "en": "So, taking the case where the gratifying the appetite of sex is of the utmost importance and the observing the rules of propriety is of little importance, why stop with merely saying that the gratifying the appetite is the more important?"
      },
      {
        "ref": "12:13",
        "zh": "往應之曰：『紾兄之臂而奪之食，則得食；不紾，則不得食，則將紾之乎？",
        "en": "Go and answer him thus, \"If, by twisting your elder brother's arm, and snatching from him what he is eating, you can get food for yourself, while, if you do not do so, you will not get anything to eat, will you so twist his arm?"
      },
      {
        "ref": "12:14",
        "zh": "踰東家牆而摟其處子，則得妻；不摟，則不得妻，則將摟之乎？』」",
        "en": "If by getting over your neighbour's wall, and dragging away his virgin daughter, you can get a wife, while if you do not do so, you will not be able to get a wife, will you so drag her away?\"'"
      },
      {
        "ref": "12:15",
        "zh": "曹交問曰：「人皆可以為堯舜，有諸？」",
        "en": "Jiao of Cao asked Mencius, saying, 'It is said, \"All men may be Yaos and Shuns;\" -- is it so?'"
      },
      {
        "ref": "12:16",
        "zh": "孟子曰：「然。」",
        "en": "Mencius replied, 'It is.'"
      },
      {
        "ref": "12:17",
        "zh": "「交聞文王十尺，湯九尺，今交九尺四寸以長，食粟而已，如何則可？」",
        "en": "Jiao went on, 'I have heard that king Wen was ten cubits high, and Tang nine. Now I am nine cubits four inches in height. But I can do nothing but eat my millet. What am I to do to realize that saying?'"
      },
      {
        "ref": "12:18",
        "zh": "曰：「奚有於是？",
        "en": "Mencius answered him, 'What has this - the question of size - to do with the matter?"
      },
      {
        "ref": "12:19",
        "zh": "亦為之而已矣。",
        "en": "It all lies simply in acting as such."
      },
      {
        "ref": "12:20",
        "zh": "有人於此，力不能勝一匹雛，則為無力人矣；今曰舉百鈞，則為有力人矣。",
        "en": "Here is a man, whose strength was not equal to lift a duckling - he was then a man of no strength. But to-day he says, \"I can lift 3,000 catties' weight,\" and he is a man of strength."
      },
      {
        "ref": "12:21",
        "zh": "然則舉烏獲之任，是亦為烏獲而已矣。",
        "en": "And so, he who can lift the weight which Wu Huo lifted is just another Wu Huo."
      },
      {
        "ref": "12:22",
        "zh": "夫人豈以不勝為患哉？",
        "en": "Why should a man make a want of ability the subject of his grief?"
      },
      {
        "ref": "12:23",
        "zh": "弗為耳。",
        "en": "It is only that he will not do the thing."
      },
      {
        "ref": "12:24",
        "zh": "徐行後長者謂之弟，疾行先長者謂之不弟。",
        "en": "To walk slowly, keeping behind his elders, is to perform the part of a younger. To walk quickly and precede his elders, is to violate the duty of a younger brother."
      },
      {
        "ref": "12:25",
        "zh": "夫徐行者，豈人所不能哉？",
        "en": "Now, is it what a man cannot do - to walk slowly?"
      },
      {
        "ref": "12:26",
        "zh": "所不為也。",
        "en": "It is what he does not do."
      },
      {
        "ref": "12:27",
        "zh": "堯舜之道，孝弟而已矣。",
        "en": "The course of Yao and Shun was simply that of filial piety and fraternal duty."
      },
      {
        "ref": "12:28",
        "zh": "子服堯之服，誦堯之言，行堯之行，是堯而已矣；子服桀之服，誦桀之言，行桀之行，是桀而已矣。」",
        "en": "Wear the clothes of Yao, repeat the words of Yao, and do the actions of Yao, and you will just be a Yao. And, if you wear the clothes of Jie, repeat the words of Jie, and do the actions of Jie, you will just be a Jie.'"
      },
      {
        "ref": "12:29",
        "zh": "曰：「交得見於鄒君，可以假館，願留而受業於門。」",
        "en": "Jiao said, 'I shall be having an interview with the prince of Zou, and can ask him to let me have a house to lodge in. I wish to remain here, and receive instruction at your gate.'"
      },
      {
        "ref": "12:30",
        "zh": "曰：「夫道，若大路然，豈難知哉？",
        "en": "Mencius replied, 'The way of truth is like a great road. It is not difficult to know it."
      },
      {
        "ref": "12:31",
        "zh": "人病不求耳。",
        "en": "The evil is only that men will not seek it."
      },
      {
        "ref": "12:32",
        "zh": "子歸而求之，有餘師。」",
        "en": "Do you go home and search for it, and you will have abundance of teachers.'"
      },
      {
        "ref": "12:33",
        "zh": "公孫丑問曰：「高子曰：『《小弁》，小人之詩也。』」",
        "en": "Gong Sun Chou asked about an opinion of the scholar Gao, saying, 'Gao observed, \"The Xiao Pan is the ode of a little man.\"'"
      },
      {
        "ref": "12:34",
        "zh": "孟子曰：「何以言之？」",
        "en": "Mencius asked, 'Why did he say so?'"
      },
      {
        "ref": "12:35",
        "zh": "曰：「怨。」",
        "en": "'Because of the murmuring which it expresses,' was the reply."
      },
      {
        "ref": "12:36",
        "zh": "曰：「固哉，高叟之為《詩》也！",
        "en": "Mencius answered, 'How stupid was that old Gao in dealing with the ode!"
      },
      {
        "ref": "12:37",
        "zh": "有人於此，越人關弓而射之，則己談笑而道之；無他，疏之也。",
        "en": "There is a man here, and a native of Yue bends his bow to shoot him. I will advise him not to do so, but speaking calmly and smilingly; for no other reason but that he is not related to me."
      },
      {
        "ref": "12:38",
        "zh": "其兄關弓而射之，則己垂涕泣而道之；無他，戚之也。",
        "en": "But if my own brother be bending his bow to shoot the man, then I will advise him not to do so, weeping and crying the while; for no other reason than that he is related to me."
      },
      {
        "ref": "12:39",
        "zh": "小弁之怨，親親也。",
        "en": "The dissatisfaction expressed in the Xiao Pan is the working of relative affection, and that affection shows benevolence."
      },
      {
        "ref": "12:40",
        "zh": "親親，仁也。",
        "en": "Stupid indeed was old Gao's criticism on the ode.'"
      },
      {
        "ref": "12:41",
        "zh": "固矣夫，高叟之為《詩》也！」",
        "en": "Chou then said, 'How is it that there is no dissatisfaction expressed in the Kai Feng?'"
      },
      {
        "ref": "12:42",
        "zh": "曰：「《凱風》何以不怨？」",
        "en": "Mencius replied, 'The parent's fault referred to in the Kai Feng is small; that referred to in the Xiao Pan is great."
      },
      {
        "ref": "12:43",
        "zh": "曰：「《凱風》，親之過小者也；《小弁》，親之過大者也。",
        "en": "Where the parent's fault was great, not to have murmured on account of it would have increased the want of natural affection."
      },
      {
        "ref": "12:44",
        "zh": "親之過大而不怨，是愈疏也；親之過小而怨，是不可磯也。",
        "en": "Where the parent's fault was small, to have murmured on account of it would have been to act like water which frets and foams about a stone that interrupts its course."
      },
      {
        "ref": "12:45",
        "zh": "愈疏，不孝也；不可磯，亦不孝也。",
        "en": "To increase the want of natural affection would have been unfilial, and to fret and foam in such a manner would also have been unfilial."
      },
      {
        "ref": "12:46",
        "zh": "孔子曰：『舜其至孝矣，五十而慕。』」",
        "en": "Confucius said, \"Shun was indeed perfectly filial! And yet, when he was fifty, he was full of longing desire about his parents.\"'"
      },
      {
        "ref": "12:47",
        "zh": "宋牼將之楚，孟子遇於石丘。",
        "en": "Song Keng being about to go to Chu, Mencius met him in Shi Qiu."
      },
      {
        "ref": "12:48",
        "zh": "曰：「先生將何之？」",
        "en": "'Master, where are you going?' asked Mencius."
      },
      {
        "ref": "12:49",
        "zh": "曰：「吾聞秦楚構兵，我將見楚王說而罷之。",
        "en": "Keng replied, 'I have heard that Qin and Chu are fighting together, and I am going to see the king of Chu and persuade him to cease hostilities."
      },
      {
        "ref": "12:50",
        "zh": "楚王不悅，我將見秦王說而罷之，二王我將有所遇焉。」",
        "en": "If he shall not be pleased with my advice, I shall go to see the king of Qin, and persuade him in the same way. Of the two kings I shall surely find that I can succeed with one of them.'"
      },
      {
        "ref": "12:51",
        "zh": "曰：「軻也請無問其詳，願聞其指。",
        "en": "Mencius said, 'I will not venture to ask about the particulars, but I should like to hear the scope of your plan."
      },
      {
        "ref": "12:52",
        "zh": "說之將何如？」",
        "en": "What course will you take to try to persuade them?'"
      },
      {
        "ref": "12:53",
        "zh": "曰：「我將言其不利也。」",
        "en": "Keng answered, 'I will tell them how unprofitable their course is to them.'"
      },
      {
        "ref": "12:54",
        "zh": "曰：「先生之志則大矣，先生之號則不可。",
        "en": "'Master,' said Mencius, 'your aim is great, but your argument is not good."
      },
      {
        "ref": "12:55",
        "zh": "先生以利說秦楚之王，秦楚之王悅於利，以罷三軍之師，是三軍之士樂罷而悅於利也。",
        "en": "If you, starting from the point of profit, offer your persuasive counsels to the kings of Qin and Chu, and if those kings are pleased with the consideration of profit so as to stop the movements of their armies, then all belonging to those armies will rejoice in the cessation of war, and find their pleasure in the pursuit of profit."
      },
      {
        "ref": "12:56",
        "zh": "為人臣者懷利以事其君，為人子者懷利以事其父，為人弟者懷利以事其兄。",
        "en": "Ministers will serve their sovereign for the profit of which they cherish the thought; sons will serve their fathers, and younger brothers will serve their elder brothers, from the same consideration - and the issue will be, that, abandoning benevolence and righteousness, sovereign and minister, father and son, younger brother and elder, will carry on all their intercourse with this thought of profit cherished in their breasts."
      },
      {
        "ref": "12:57",
        "zh": "是君臣、父子、兄弟終去仁義，懷利以相接，然而不亡者，未之有也。",
        "en": "But never has there been such a state of society, without ruin being the result of it."
      },
      {
        "ref": "12:58",
        "zh": "先生以仁義說秦楚之王，秦楚之王悅於仁義，而罷三軍之師，是三軍之士樂罷而悅於仁義也。",
        "en": "If you, starting from the ground of benevolence and righteousness, offer your counsels to the kings of Qin and Chu, and if those kings are pleased with the consideration of benevolence and righteousness so as to stop the operations of their armies, then all belonging to those armies will rejoice in the stopping from war, and find their pleasure in benevolence and righteousness."
      },
      {
        "ref": "12:59",
        "zh": "為人臣者懷仁義以事其君，為人子者懷仁義以事其父，為人弟者懷仁義以事其兄，是君臣、父子、兄弟去利，懷仁義以相接也。",
        "en": "Ministers will serve their sovereign, cherishing the principles of benevolence and righteousness; sons will serve their fathers, and younger brothers will serve their elder brothers, in the same way - and so, sovereign and minister, father and son, elder brother and younger, abandoning the thought of profit, will cherish the principles of benevolence and righteousness, and carry on all their intercourse upon them."
      },
      {
        "ref": "12:60",
        "zh": "然而不王者，未之有也。",
        "en": "But never has there been such a state of society, without the State where it prevailed rising to the royal sway."
      },
      {
        "ref": "12:61",
        "zh": "何必曰利？」",
        "en": "Why must you use that word \"profit.\"'"
      },
      {
        "ref": "12:62",
        "zh": "孟子居鄒，季任為任處守，以幣交，受之而不報。",
        "en": "When Mencius was residing in Zou, the younger brother of the chief of Ren, who was guardian of Ren at the time, paid his respects to him by a present of silks, which Mencius received, not going to acknowledge it."
      },
      {
        "ref": "12:63",
        "zh": "處於平陸，儲子為相，以幣交，受之而不報。",
        "en": "When he was sojourning in Ping Lu, Chu, who was prime minister of the State, sent him a similar present, which he received in the same way."
      },
      {
        "ref": "12:64",
        "zh": "他日由鄒之任，見季子；由平陸之齊，不見儲子。",
        "en": "Subsequently, going from Zou to Ren, he visited the guardian; but when he went from Ping Lu to the capital of Qi, he did not visit the minister Chu."
      },
      {
        "ref": "12:65",
        "zh": "屋廬子喜曰：「連得閒矣。」",
        "en": "The disciple Wu Lu was glad, and said, 'I have got an opportunity to obtain some instruction.'"
      },
      {
        "ref": "12:66",
        "zh": "問曰：「夫子之任見季子，之齊不見儲子，為其為相與？」",
        "en": "He asked accordingly, 'Master, when you went to Ren, you visited the chief's brother; and when you went to Qi, you did not visit Chu. Was it not because he is only the minister?'"
      },
      {
        "ref": "12:67",
        "zh": "曰：「非也。",
        "en": "Mencius replied, 'No."
      },
      {
        "ref": "12:68",
        "zh": "《書》曰：『享多儀，儀不及物曰不享，惟不役志于享。』",
        "en": "It is said in the Book of History, \"In presenting an offering to a superior, most depends on the demonstrations of respect. If those demonstrations are not equal to the things offered, we say there is no offering, that is, there is no act of the will presenting the offering.\""
      },
      {
        "ref": "12:69",
        "zh": "為其不成享也。」",
        "en": "This is because the things so offered do not constitute an offering to a superior.'"
      },
      {
        "ref": "12:70",
        "zh": "屋廬子悅。",
        "en": "Wu Lu was pleased, and when some one asked him what Mencius meant, he said, 'The younger of Ren could not go to Zou, but the minister Chu might have gone to Ping Lu.'"
      },
      {
        "ref": "12:71",
        "zh": "或問之。",
        "en": "Chun Yu Kun said, 'He who makes fame and meritorious services his first objects, acts with a regard to others."
      },
      {
        "ref": "12:72",
        "zh": "屋廬子曰：「季子不得之鄒，儲子得之平陸。」",
        "en": "He who makes them only secondary objects, acts with a regard to himself."
      },
      {
        "ref": "12:73",
        "zh": "淳于髡曰：「先名實者，為人也；後名實者，自為也。",
        "en": "You, master, were ranked among the three chief ministers of the State, but before your fame and services had reached either to the prince or the people, you have left your place."
      },
      {
        "ref": "12:74",
        "zh": "夫子在三卿之中，名實未加於上下而去之，仁者固如此乎？」",
        "en": "Is this indeed the way of the benevolent?'"
      },
      {
        "ref": "12:75",
        "zh": "孟子曰：「居下位，不以賢事不肖者，伯夷也；五就湯，五就桀者，伊尹也；不惡汙君，不辭小官者，柳下惠也。",
        "en": "Mencius replied, 'There was Bo Yi - he abode in an inferior situation, and would not, with his virtue, serve a degenerate prince. There was Yi Yin - he five times went to Tang, and five times went to Jie. There was Hui of Liu Xia - he did not disdain to serve a vile prince, nor did he decline a small office."
      },
      {
        "ref": "12:76",
        "zh": "三子者不同道，其趨一也。",
        "en": "The courses pursued by those three worthies were different, but their aim was one."
      },
      {
        "ref": "12:77",
        "zh": "一者何也？",
        "en": "And what was their one aim?"
      },
      {
        "ref": "12:78",
        "zh": "曰：仁也。",
        "en": "We must answer \"To be perfectly virtuous.\""
      },
      {
        "ref": "12:79",
        "zh": "君子亦仁而已矣，何必同？」",
        "en": "And so it is simply after this that superior men strive. Why must they all pursue the same course?'"
      },
      {
        "ref": "12:80",
        "zh": "曰：「魯繆公之時，公儀子為政，子柳、子思為臣，魯之削也滋甚。",
        "en": "Kun pursued, 'In the time of the duke Mu of Lu, the government was in the hands of Gong Yi, while Zi Liu and Zi Si were ministers. And yet, the dismemberment of Lu then increased exceedingly."
      },
      {
        "ref": "12:81",
        "zh": "若是乎賢者之無益於國也！」",
        "en": "Such was the case, a specimen how your men of virtue are of no advantage to a kingdom!'"
      },
      {
        "ref": "12:82",
        "zh": "曰：「虞不用百里奚而亡，秦穆公用之而霸。",
        "en": "Mencius said, 'The prince of Yu did not use Bai Li Xi, and thereby lost his State. The duke Mu of Qin used him, and became chief of all the princes."
      },
      {
        "ref": "12:83",
        "zh": "不用賢則亡，削何可得與？」",
        "en": "Ruin is the consequence of not employing men of virtue and talents - how can it rest with dismemberment merely?'"
      },
      {
        "ref": "12:84",
        "zh": "曰：「昔者王豹處於淇，而河西善謳；緜駒處於高唐，而齊右善歌；華周、杞梁之妻善哭其夫，而變國俗。",
        "en": "Kun urged again, 'Formerly, when Wang Bao dwelt on the Qi, the people on the west of the Yellow River all became skilful at singing in his abrupt manner. When Mian Ju lived in Gao Tang, the people in the parts of Qi on the west became skilful at singing in his prolonged manner. The wives of Hua Zhou and Qi Liang bewailed their husbands so skilfully, that they changed the manners of the State."
      },
      {
        "ref": "12:85",
        "zh": "有諸內必形諸外。",
        "en": "When there is the gift within, it manifests itself without."
      },
      {
        "ref": "12:86",
        "zh": "為其事而無其功者，髡未嘗覩之也。",
        "en": "I have never seen the man who could do the deeds of a worthy, and did not realize the work of one."
      },
      {
        "ref": "12:87",
        "zh": "是故無賢者也，有則髡必識之。」",
        "en": "Therefore there are now no men of talents and virtue. If there were, I should know them.'"
      },
      {
        "ref": "12:88",
        "zh": "曰：「孔子為魯司寇，不用，從而祭，燔肉不至，不稅冕而行。",
        "en": "Mencius answered, 'When Confucius was chief minister of Justice in Lu, the prince came not to follow his counsels. Soon after there was the solstitial sacrifice, and when a part of the flesh presented in sacrifice was not sent to him, he went away even without taking off his cap of ceremony."
      },
      {
        "ref": "12:89",
        "zh": "不知者以為為肉也。",
        "en": "Those who did not know him supposed it was on account of the flesh."
      },
      {
        "ref": "12:90",
        "zh": "其知者以為為無禮也。",
        "en": "Those who knew him supposed that it was on account of the neglect of the usual ceremony."
      },
      {
        "ref": "12:91",
        "zh": "乃孔子則欲以微罪行，不欲為苟去。",
        "en": "The fact was, that Confucius wanted to go away on occasion of some small offence, not wishing to do so without some apparent cause."
      },
      {
        "ref": "12:92",
        "zh": "君子之所為，眾人固不識也。」",
        "en": "All men cannot be expected to understand the conduct of a superior man.'"
      },
      {
        "ref": "12:93",
        "zh": "孟子曰：「五霸者，三王之罪人也；今之諸侯，五霸之罪人也；今之大夫，今之諸侯之罪人也。",
        "en": "Mencius said, 'The five chiefs of the princes were sinners against the three kings. The princes of the present day are sinners against the five chiefs. The Great officers of the present day are sinners against the princes."
      },
      {
        "ref": "12:94",
        "zh": "天子適諸侯曰巡狩，諸侯朝於天子曰述職。",
        "en": "The sovereign visited the princes, which was called \"A tour of Inspection.\" The princes attended at the court of the sovereign, which was called \"Giving a report of office.\""
      },
      {
        "ref": "12:95",
        "zh": "春省耕而補不足，秋省斂而助不給。",
        "en": "It was a custom in the spring to examine the ploughing, and supply any deficiency of seed; and in autumn to examine the reaping, and assist where there was a deficiency of the crop."
      },
      {
        "ref": "12:96",
        "zh": "入其疆，土地辟，田野治，養老尊賢，俊傑在位，則有慶，慶以地。",
        "en": "When the sovereign entered the boundaries of a State, if the new ground was being reclaimed, and the old fields well cultivated; if the old were nourished and the worthy honoured; and if men of distinguished talents were placed in office: then the prince was rewarded - rewarded with an addition to his territory."
      },
      {
        "ref": "12:97",
        "zh": "入其疆，土地荒蕪，遺老失賢，掊克在位，則有讓。",
        "en": "On the other hand, if, on entering a State, the ground was found left wild or overrun with weeds; if the old were neglected and the worthy unhonoured; and if the offices were filled with hard taxgatherers: then the prince was reprimanded."
      },
      {
        "ref": "12:98",
        "zh": "一不朝，則貶其爵；再不朝，則削其地；三不朝，則六師移之。",
        "en": "If a prince once omitted his attendance at court, he was punished by degradation of rank; if he did so a second time, he was deprived of a portion of his territory; if he did so a third time, the royal forces were set in motion, and he was removed from his government."
      },
      {
        "ref": "12:99",
        "zh": "是故天子討而不伐，諸侯伐而不討。",
        "en": "Thus the sovereign commanded the punishment, but did not himself inflict it, while the princes inflicted the punishment, but did not command it."
      },
      {
        "ref": "12:100",
        "zh": "五霸者，摟諸侯以伐諸侯者也，故曰：五霸者，三王之罪人也。",
        "en": "The five chiefs, however, dragged the princes to punish other princes, and hence I say that they were sinners against the three kings."
      },
      {
        "ref": "12:101",
        "zh": "「五霸，桓公為盛。",
        "en": "'Of the five chiefs the most powerful was the duke Huan."
      },
      {
        "ref": "12:102",
        "zh": "葵丘之會諸侯，束牲、載書而不歃血。",
        "en": "At the assembly of the princes in Kui Qiu, he bound the victim and placed the writing upon it, but did not slay it to smear their mouths with the blood."
      },
      {
        "ref": "12:103",
        "zh": "初命曰：『誅不孝，無易樹子，無以妾為妻。』",
        "en": "The first injunction in their agreement was, \"Slay the unfilial; change not the son who has been appointed heir; exalt not a concubine to be the wife.\""
      },
      {
        "ref": "12:104",
        "zh": "再命曰：『尊賢育才，以彰有德。』",
        "en": "The second was, \"Honour the worthy, and maintain the talented, to give distinction to the virtuous.\""
      },
      {
        "ref": "12:105",
        "zh": "三命曰：『敬老慈幼，無忘賓旅。』",
        "en": "The third was, \"Respect the old, and be kind to the young. Be not forgetful of strangers and travellers.\""
      },
      {
        "ref": "12:106",
        "zh": "四命曰：『士無世官，官事無攝，取士必得，無專殺大夫。』",
        "en": "The fourth was, \"Let not offices be hereditary, nor let officers be pluralists. In the selection of officers let the object be to get the proper men. Let not a ruler take it on himself to put to death a Great officer.\""
      },
      {
        "ref": "12:107",
        "zh": "五命曰：『無曲防，無遏糴，無有封而不告。』",
        "en": "The fifth was, \"Follow no crooked policy in making embankments. Impose no restrictions on the sale of grain. Let there be no promotions without first announcing them to the sovereign.\""
      },
      {
        "ref": "12:108",
        "zh": "曰：『凡我同盟之人，既盟之後，言歸于好。』",
        "en": "It was then said, \"All we who have united in this agreement shall hereafter maintain amicable relations.\""
      },
      {
        "ref": "12:109",
        "zh": "今之諸侯，皆犯此五禁，故曰：今之諸侯，五霸之罪人也。",
        "en": "The princes of the present day all violate these five prohibitions, and therefore I say that the princes of the present day are sinners against the five chiefs."
      },
      {
        "ref": "12:110",
        "zh": "「長君之惡其罪小，逢君之惡其罪大。",
        "en": "'The crime of him who connives at, and aids, the wickedness of his prince is small, but the crime of him who anticipates and excites that wickedness is great."
      },
      {
        "ref": "12:111",
        "zh": "今之大夫，皆逢君之惡，故曰：今之大夫，今之諸侯之罪人也。」",
        "en": "The officers of the present day all go to meet their sovereigns' wickedness, and therefore I say that the Great officers of the present day are sinners against the princes.'"
      },
      {
        "ref": "12:112",
        "zh": "魯欲使慎子為將軍。",
        "en": "The prince of Lu wanted to make the minister Shen commander of his army."
      },
      {
        "ref": "12:113",
        "zh": "孟子曰：「不教民而用之，謂之殃民。",
        "en": "Mencius said, 'To employ an uninstructed people in war may be said to be destroying the people."
      },
      {
        "ref": "12:114",
        "zh": "殃民者，不容於堯舜之世。",
        "en": "A destroyer of the people would not have been tolerated in the times of Yao and Shun."
      },
      {
        "ref": "12:115",
        "zh": "一戰勝齊，遂有南陽，然且不可。」",
        "en": "Though by a single battle you should subdue Qi, and get possession of Nan Yang, the thing ought not to be done.'"
      },
      {
        "ref": "12:116",
        "zh": "慎子勃然不悅曰：「此則滑釐所不識也。」",
        "en": "Shen changed countenance, and said in displeasure, 'This is what I, Gu Li, do not understand.'"
      },
      {
        "ref": "12:117",
        "zh": "曰：「吾明告子。",
        "en": "Mencius said, 'I will lay the case plainly before you."
      },
      {
        "ref": "12:118",
        "zh": "天子之地方千里；不千里，不足以待諸侯。",
        "en": "The territory appropriated to the sovereign is 1,000 li square. Without a thousand li, he would not have sufficient for his entertainment of the princes."
      },
      {
        "ref": "12:119",
        "zh": "諸侯之地方百里；不百里，不足以守宗廟之典籍。",
        "en": "The territory appropriated to a Hou is 100 li square. Without 100 li, he would not have sufficient wherewith to observe the statutes kept in his ancestral temple."
      },
      {
        "ref": "12:120",
        "zh": "周公之封於魯，為方百里也；地非不足，而儉於百里。",
        "en": "When Zhou Gong was invested with the principalily of Lu, it was a hundred li square. The territory was indeed enough, but it was not more than 100 li."
      },
      {
        "ref": "12:121",
        "zh": "太公之封於齊也，亦為方百里也；地非不足也，而儉於百里。",
        "en": "When Tai Gong was invested with the principality of Qi, it was 100 li square. The territory was indeed enough, but it was not more than 100 li."
      },
      {
        "ref": "12:122",
        "zh": "今魯方百里者五，子以為有王者作，則魯在所損乎？",
        "en": "Now Lu is five times 100 li square. If a true royal ruler were to arise, whether do you think that Lu would be diminished or increased by him?"
      },
      {
        "ref": "12:123",
        "zh": "在所益乎？",
        "en": "If it were merely taking the place from the one State to give it to the other, a benevolent man would not do it; how much less will he do so, when the end is to be sought by the slaughter of men!"
      },
      {
        "ref": "12:124",
        "zh": "徒取諸彼以與此，然且仁者不為，況於殺人以求之乎？",
        "en": "The way in which a superior man serves his prince contemplates simply the leading him in the right path, and directing his mind to benevolence.'"
      },
      {
        "ref": "12:125",
        "zh": "君子之事君也，務引其君以當道，志於仁而已。」",
        "en": "Mencius said, 'Those who now-a-days serve their sovereigns say, \"We can for our sovereign enlarge the limits of the cultivated ground, and fill his treasuries and arsenals.\""
      },
      {
        "ref": "12:126",
        "zh": "孟子曰：「今之事君者曰：『我能為君辟土地，充府庫。』",
        "en": "Such persons are now-a-days called \"Good ministers,\" but anciently they were called \"Robbers of the people.\""
      },
      {
        "ref": "12:127",
        "zh": "今之所謂良臣，古之所謂民賊也。",
        "en": "If a sovereign follows not the right way, nor has his mind bent on benevolence, to seek to enrich him is to enrich a Jie."
      },
      {
        "ref": "12:128",
        "zh": "君不鄉道，不志於仁，而求富之，是富桀也。",
        "en": "Or they will say, \"We can for our sovereign form alliances with other States, so that our battles must be successful.\""
      },
      {
        "ref": "12:129",
        "zh": "『我能為君約與國，戰必克。』",
        "en": "Such persons are now-a-days called \"Good ministers,\" but anciently they were called \"Robbers of the people.\""
      },
      {
        "ref": "12:130",
        "zh": "今之所謂良臣，古之所謂民賊也。",
        "en": "If a sovereign follows not the right way, nor has his mind directed to benevolence, to seek to enrich him is to enrich a Jie."
      },
      {
        "ref": "12:131",
        "zh": "君不鄉道，不志於仁，而求為之強戰，是輔桀也。",
        "en": "Although a prince, pursuing the path of the present day, and not changing its practices, were to have the throne given to him, he could not retain it for a single morning.'"
      },
      {
        "ref": "12:132",
        "zh": "由今之道，無變今之俗，雖與之天下，不能一朝居也。」",
        "en": "Bai Gui said, 'I want to take a twentieth of the produce only as the tax. What do you think of it?'"
      },
      {
        "ref": "12:133",
        "zh": "白圭曰：「吾欲二十而取一，何如？」",
        "en": "Mencius said, 'Your way would be that of the Mo. In a country of ten thousand families, would it do to have only one potter?'"
      },
      {
        "ref": "12:134",
        "zh": "孟子曰：「子之道，貉道也。萬室之國，一人陶，則可乎？」",
        "en": "Gui replied, 'No. The vessels would not be enough to use.'"
      },
      {
        "ref": "12:135",
        "zh": "曰：「不可，器不足用也。」",
        "en": "Mencius went on, 'In Mo all the five kinds of grain are not grown; it only produces the millet."
      },
      {
        "ref": "12:136",
        "zh": "曰：「夫貉，五穀不生，惟黍生之。",
        "en": "There are no fortified cities, no edifices, no ancestral temples, no ceremonies of sacrifice; there are no princes requiring presents and entertainments; there is no system of officers with their various subordinates."
      },
      {
        "ref": "12:137",
        "zh": "無城郭、宮室、宗廟、祭祀之禮，無諸侯幣帛饔飧，無百官有司，故二十取一而足也。",
        "en": "On these accounts a tax of one-twentieth of the produce is sufficient there."
      },
      {
        "ref": "12:138",
        "zh": "今居中國，去人倫，無君子，如之何其可也？",
        "en": "But now it is the Middle Kingdom that we live in. To banish the relationships of men, and have no superior men - how can such a state of things be thought of?"
      },
      {
        "ref": "12:139",
        "zh": "陶以寡，且不可以為國，況無君子乎？",
        "en": "With but few potters a kingdom cannot subsist; how much less can it subsist without men of a higher rank than others?"
      },
      {
        "ref": "12:140",
        "zh": "欲輕之於堯舜之道者，大貉小貉也；欲重之於堯舜之道者，大桀小桀也。」",
        "en": "If we wish to make the taxation lighter than the system of Yao and Shun, we shall just have a great Mo and a small Mo. If we wish to make it heavier, we shall just have the great Jie and the small Jie.'"
      },
      {
        "ref": "12:141",
        "zh": "白圭曰：「丹之治水也愈於禹。」",
        "en": "Bai Gui said, 'My management of the waters is superior to that of Yu.'"
      },
      {
        "ref": "12:142",
        "zh": "孟子曰：「子過矣。",
        "en": "Mencius replied, 'You are wrong, Sir."
      },
      {
        "ref": "12:143",
        "zh": "禹之治水，水之道也。",
        "en": "Yu's regulation of the waters was according to the laws of water."
      },
      {
        "ref": "12:144",
        "zh": "是故禹以四海為壑，今吾子以鄰國為壑。",
        "en": "He therefore made the four seas their receptacle, while you make the neighbouring States their receptacle."
      },
      {
        "ref": "12:145",
        "zh": "水逆行，謂之洚水。",
        "en": "Water flowing out of its channels is called an inundation."
      },
      {
        "ref": "12:146",
        "zh": "洚水者，洪水也，仁人之所惡也。",
        "en": "Inundating waters are a vast waste of water, and what a benevolent man detests."
      },
      {
        "ref": "12:147",
        "zh": "吾子過矣。」",
        "en": "You are wrong, my good Sir.'"
      },
      {
        "ref": "12:148",
        "zh": "孟子曰：「君子不亮，惡乎執？」",
        "en": "Mencius said, 'If a scholar have not faith, how shall he take a firm hold of things?'"
      },
      {
        "ref": "12:149",
        "zh": "魯欲使樂正子為政。",
        "en": "The prince of Lu wanting to commit the administration of his government to the disciple Yue Zheng,"
      },
      {
        "ref": "12:150",
        "zh": "孟子曰：「吾聞之，喜而不寐。」",
        "en": "Mencius said, 'When I heard of it, I was so glad that I could not sleep.'"
      },
      {
        "ref": "12:151",
        "zh": "公孫丑曰：「樂正子強乎？」",
        "en": "Gong Sun Chou asked, 'Is Yue Zheng a man of vigour?' and was answered, 'No.'"
      },
      {
        "ref": "12:152",
        "zh": "曰：「否。」",
        "en": "'Is he wise in council?' 'No.'"
      },
      {
        "ref": "12:153",
        "zh": "「有知慮乎？」曰：「否。」",
        "en": "'Is he possessed of much information?' 'No.'"
      },
      {
        "ref": "12:154",
        "zh": "「多聞識乎？」曰：「否。」",
        "en": "'What then made you so glad that you could not sleep?' 'He is a man who loves what is good.'"
      },
      {
        "ref": "12:155",
        "zh": "「然則奚為喜而不寐？」",
        "en": "'Is the love of what is good sufficient?'"
      },
      {
        "ref": "12:156",
        "zh": "曰：「其為人也好善。」",
        "en": "'The love of what is good is more than a sufficient qualification for the government of the kingdom; how much more is it so for the State of Lu!"
      },
      {
        "ref": "12:157",
        "zh": "「好善足乎？」",
        "en": "If a minister love what is good, all within the four seas will count 1000 li but a small distance, and will come and lay their good thoughts before him."
      },
      {
        "ref": "12:158",
        "zh": "曰：「好善優於天下，而況魯國乎？",
        "en": "If he do not love what is good, men will say, \"How self-conceited he looks? He is saying to himself, I know it.\""
      },
      {
        "ref": "12:159",
        "zh": "夫苟好善，則四海之內，皆將輕千里而來告之以善。",
        "en": "The language and looks of that self-conceit will keep men off at a distance of 1,000 li."
      },
      {
        "ref": "12:160",
        "zh": "夫苟不好善，則人將曰：『訑訑，予既已知之矣。』",
        "en": "When good men stop 1,000 li off, calumniators, flatterers, and sycophants will make their appearance."
      },
      {
        "ref": "12:161",
        "zh": "訑訑之聲音顏色，距人於千里之外。",
        "en": "When a minister lives among calumniators, flatterers, and sycophants, though he may wish the State to be well governed, is it possible for it to be so?'"
      },
      {
        "ref": "12:162",
        "zh": "士止於千里之外，則讒諂面諛之人至矣。",
        "en": "The disciple Chen said, 'What were the principles on which superior men of old took office?'"
      },
      {
        "ref": "12:163",
        "zh": "與讒諂面諛之人居，國欲治，可得乎？」",
        "en": "Mencius replied, 'There were three cases in which they accepted office, and three in which they left it."
      },
      {
        "ref": "12:164",
        "zh": "陳子曰：「古之君子何如則仕？」",
        "en": "If received with the utmost respect and all polite observances, and they could say to themselves that the prince would carry their words into practice, then they took office with him."
      },
      {
        "ref": "12:165",
        "zh": "孟子曰：「所就三，所去三。",
        "en": "Afterwards, although there might be no remission in the polite demeanour of the prince, if their words were not carried into practice, they would leave him."
      },
      {
        "ref": "12:166",
        "zh": "迎之致敬以有禮，言將行其言也，則就之；禮貌未衰，言弗行也，則去之。",
        "en": "The second case was that in which, though the prince could not be expected at once to carry their words into practice, yet being received by him with the utmost respect, they took office with him."
      },
      {
        "ref": "12:167",
        "zh": "其次，雖未行其言也，迎之致敬以有禮，則就之；禮貌衰，則去之。",
        "en": "But afterwards, if there was a remission in his polite demeanour, they would leave him."
      },
      {
        "ref": "12:168",
        "zh": "其下，朝不食，夕不食，飢餓不能出門戶。",
        "en": "The last case was that of the superior man who had nothing to eat, either morning or evening, and was so famished that he could not move out of his door."
      },
      {
        "ref": "12:169",
        "zh": "君聞之曰：『吾大者不能行其道，又不能從其言也，使飢餓於我土地，吾恥之。』",
        "en": "If the prince, on hearing of his state, said, \"I must fail in the great point, that of carrying his doctrines into practice, neither am I able to follow his words, but I am ashamed to allow him to die of want in my country;\""
      },
      {
        "ref": "12:170",
        "zh": "周之，亦可受也，免死而已矣。」",
        "en": "the assistance offered in such a case might be received, but not beyond what was sufficient to avert death.'"
      },
      {
        "ref": "12:171",
        "zh": "孟子曰：「舜發於畎畝之中，傅說舉於版築之閒，膠鬲舉於魚鹽之中，管夷吾舉於士，孫叔敖舉於海，百里奚舉於市。",
        "en": "Mencius said, 'Shun rose from among the channelled fields. Fu Yue was called to office from the midst of his building frames; Jiao Ge from his fish and salt; Guan Yi Wu from the hands of his gaoler; Sun Shu Ao from his hiding by the sea-shore; and Bai Li Xi from the market-place."
      },
      {
        "ref": "12:172",
        "zh": "故天將降大任於是人也，必先苦其心志，勞其筋骨，餓其體膚，空乏其身，行拂亂其所為，所以動心忍性，曾益其所不能。",
        "en": "Thus, when Heaven is about to confer a great office on any man, it first exercises his mind with suffering, and his sinews and bones with toil. It exposes his body to hunger, and subjects him to extreme poverty. It confounds his undertakings. By all these methods it stimulates his mind, hardens his nature, and supplies his incompetencies."
      },
      {
        "ref": "12:173",
        "zh": "人恒過，然後能改；困於心，衡於慮，而後作；徵於色，發於聲，而後喻。",
        "en": "Men for the most part err, and are afterwards able to reform. They are distressed in mind and perplexed in their thoughts, and then they arise to vigorous reformation. When things have been evidenced in men's looks, and set forth in their words, then they understand them."
      },
      {
        "ref": "12:174",
        "zh": "入則無法家拂士，出則無敵國外患者，國恒亡。",
        "en": "If a prince have not about his court families attached to the laws and worthy counsellors, and if abroad there are not hostile States or other external calamities, his kingdom will generally come to ruin."
      },
      {
        "ref": "12:175",
        "zh": "然後知生於憂患而死於安樂也。」",
        "en": "From these things we see how life springs from sorrow and calamity, and death from ease and pleasure.'"
      },
      {
        "ref": "12:176",
        "zh": "孟子曰：「教亦多術矣，予不屑之教誨也者，是亦教誨之而已矣。」",
        "en": "Mencius said, 'There are many arts in teaching. I refuse, as inconsistent with my character, to teach a man, but I am only thereby still teaching him.'"
      }
    ]
  }
}
