{
  "id": "shiji",
  "title": "史記",
  "titleEn": "Records of the Grand Historian",
  "source": "Chinese Text Project (ctext.org) - James Legge translation",
  "chapter": {
    "number": "3",
    "title": "Yin Ben Ji",
    "slug": "yin-ben-ji",
    "passages": [
      {
        "ref": "3:1",
        "zh": "殷契，母曰簡狄，有娀氏之女，為帝嚳次妃。",
        "en": "Qi of Yin's mother was Jian Di, who was one of the daughters of Yousong and the secondary wife of Emperor Ku."
      },
      {
        "ref": "3:2",
        "zh": "三人行浴，見玄鳥墮其卵，簡狄取吞之，因孕生契。",
        "en": "She was going with her two sisters to bathe, when she saw a dark bird drop its egg. Jian Di picked it up, and swallowed it, and thus being with child gave birth to Qi."
      },
      {
        "ref": "3:3",
        "zh": "契長而佐禹治水有功。",
        "en": "When Qi grew up, he was succeseful in assisting Yu to control the flood,"
      },
      {
        "ref": "3:4",
        "zh": "帝舜乃命契曰：「百姓不親，五品不訓，汝為司徒而敬敷五教，五教在寬。」",
        "en": "and the Emperor Shun, directing Qi, said: The people are wanting in affection for one another, and do not observe the five orders of relationship. You, as Minister of Instruction, should reverently inculcate the lessons of duty belonging to those five orders, but do so with gentleness."
      },
      {
        "ref": "3:5",
        "zh": "封于商，賜姓子氏。",
        "en": "He held in fief the principality of Shang, and was given the surname of Zi (son)."
      },
      {
        "ref": "3:6",
        "zh": "契興於唐、虞、大禹之際，功業著於百姓，百姓以平。",
        "en": "Qi flourished in the reigns of Yao, Shun, and the great Yu. His services were manifest to the people, who were accordingly at peace."
      },
      {
        "ref": "3:7",
        "zh": "契卒，子昭明立。",
        "en": "Qi (documents) died, and his son Zhaoming (luminous) succeeded him."
      },
      {
        "ref": "3:8",
        "zh": "昭明卒，子相土立。",
        "en": "Zhaoming died, and his son Xiangtu (view land) succeeded him."
      },
      {
        "ref": "3:9",
        "zh": "相土卒，子昌若立。",
        "en": "Xiangtu died, and his son Chang Ruo (bright-like) succeeded him."
      },
      {
        "ref": "3:10",
        "zh": "昌若卒，子曹圉立。",
        "en": "Chang Ruo died, and his son Cao Yu (cattle-pens) succeeded him."
      },
      {
        "ref": "3:11",
        "zh": "曹圉卒，子冥立。",
        "en": "Zao Yu died, and his son Ming (obscure) succeeded him."
      },
      {
        "ref": "3:12",
        "zh": "冥卒，子振立。",
        "en": "Ming died, and his son Zhen (shake) succeeded him."
      },
      {
        "ref": "3:13",
        "zh": "振卒，子微立。",
        "en": "Zhen died, and his son Wei (diminutive) succeeded him."
      },
      {
        "ref": "3:14",
        "zh": "微卒，子報丁立。",
        "en": "Wei died, and his son Baoding (report D) succeeded him."
      },
      {
        "ref": "3:15",
        "zh": "報丁卒，子報乙立。",
        "en": "Baoding died, and his son Baoyi (report B) succeeded him."
      },
      {
        "ref": "3:16",
        "zh": "報乙卒，子報丙立。",
        "en": "Baoyi died, and his son Baobing (report C) succeeded him."
      },
      {
        "ref": "3:17",
        "zh": "報丙卒，子主壬立。",
        "en": "Baobing died, and his son Zhuren (lord I) succeeded him."
      },
      {
        "ref": "3:18",
        "zh": "主壬卒，子主癸立。",
        "en": "Zhuren died, and his son Zhu gui (lord J) succeeded him."
      },
      {
        "ref": "3:19",
        "zh": "主癸卒，子天乙立，是為成湯。",
        "en": "Zhu Gui died, and his son Tian Yi (Heaven B) or Tang the Completer succeeded him."
      },
      {
        "ref": "3:20",
        "zh": "成湯，自契至湯八遷。",
        "en": "From Qi to Tang the Completer there were eight changes of the capital."
      },
      {
        "ref": "3:21",
        "zh": "湯始居亳，從先王居，作帝誥。",
        "en": "Tang at first dwelt in Bo, choosing the residence of the first king, and the 'Emperor's Announcement' was written."
      },
      {
        "ref": "3:22",
        "zh": "湯征諸侯。",
        "en": "When Tang made an expedition against the princes,"
      },
      {
        "ref": "3:23",
        "zh": "葛伯不祀，湯始伐之。",
        "en": "the chief of Ge was not offering the proper sacrifices, and Tang began by punishing him."
      },
      {
        "ref": "3:24",
        "zh": "湯曰：「予有言：人視水見形，視民知治不。」",
        "en": "Tang said: 'I observe that if a man looks at the water he sees his reflection; if he seeks to make an impression on the people, should he not know how to govern?'"
      },
      {
        "ref": "3:25",
        "zh": "伊尹曰：「明哉！言能聽，道乃進。君國子民，為善者皆在王官。勉哉，勉哉！」",
        "en": "Yiyin said: 'That is clear! If you say that you will listen to reason you may offer yourself as ruler of the State. Whether the people do right or not depends entirely on the king and his ministers. Rouse yourself to action!'"
      },
      {
        "ref": "3:26",
        "zh": "湯曰：「汝不能敬命，予大罰殛之，無有攸赦。」",
        "en": "Tang said: 'If you cannot respect my commands, I will inflict upon you the extreme penalty death. You will not obtain forgiveness.'"
      },
      {
        "ref": "3:27",
        "zh": "作湯征。",
        "en": "The punitive expedition of Tang was written."
      },
      {
        "ref": "3:28",
        "zh": "伊尹名阿衡。",
        "en": "Yiyin's name was A-Heng."
      },
      {
        "ref": "3:29",
        "zh": "阿衡欲奸湯而無由，乃為有莘氏媵臣，負鼎俎，以滋味說湯，致于王道。",
        "en": "A-Heng wanted to meet Tang, but had no opportunity of doing so; he therefore became cook to the prince of Xin, and while bringing Tang dishes to taste urged him to perfect himself in the way of the ancient kings."
      },
      {
        "ref": "3:30",
        "zh": "或曰，伊尹處士，湯使人聘迎之，五反然後肯往從湯，言素王及九主之事。",
        "en": "Some say that when Yiyin was living in retirement Tang sent five times to invite him to a meeting before he would obey him, and talk about matters connected with the guileless king and the nine rulers."
      },
      {
        "ref": "3:31",
        "zh": "湯舉任以國政。",
        "en": "Tang promoted Ren to the administration of affairs."
      },
      {
        "ref": "3:32",
        "zh": "伊尹去湯適夏。",
        "en": "Yiyin went from Tang to Xia."
      },
      {
        "ref": "3:33",
        "zh": "既醜有夏，復歸于亳。",
        "en": "Being indignant with the sovereign of Xia, he returned to Bo,"
      },
      {
        "ref": "3:34",
        "zh": "入自北門，遇女鳩、女房，作女鳩女房。",
        "en": "and as he entered by the north gate met Rujiu and Rufang, and the 'Rujiu' and 'Rufang' were written."
      },
      {
        "ref": "3:35",
        "zh": "湯出，見野張網四面，祝曰：「自天下四方皆入吾網。」",
        "en": "Tang went out and saw a rustic, who was spreading nets in every direction, and vowing that every bird in the sky should go into his net."
      },
      {
        "ref": "3:36",
        "zh": "湯曰：「嘻，盡之矣！」",
        "en": "Tang said, 'What! all?'"
      },
      {
        "ref": "3:37",
        "zh": "乃去其三面，祝曰：「欲左，左。欲右，右。不用命，乃入吾網。」",
        "en": "Then, taking away the nets on three sides, he vowed that those which wanted to go to the left should go left, and those which wanted to go right should go right, and that only those which were the victims of fate should be caught in the net."
      },
      {
        "ref": "3:38",
        "zh": "諸侯聞之，曰：「湯德至矣，及禽獸。」",
        "en": "The princes, hearing of it, said, 'Tang's kindness is extreme, and extends even to birds and beasts.'"
      },
      {
        "ref": "3:39",
        "zh": "當是時，夏桀為虐政淫荒，而諸侯昆吾氏為亂。",
        "en": "At this time Jie of Xia was oppressive, and his rule dissipated, and one of the princes Kunwu rebelled,"
      },
      {
        "ref": "3:40",
        "zh": "湯乃興師率諸侯，伊尹從湯，湯自把鉞以伐昆吾，遂伐桀。",
        "en": "so Tang, levying an army, put himself at the head of the princes. Yiyin followed Tang, who, grasping a halberd, marched against Kunwu, and then attacked Jie."
      },
      {
        "ref": "3:41",
        "zh": "湯曰：「格女眾庶，來，女悉聽朕言。",
        "en": "Tang said: Come, ye multitudes of the people, listen ye all to my words."
      },
      {
        "ref": "3:42",
        "zh": "匪台小子敢行舉亂，有夏多罪，予維聞女眾言，夏氏有罪。",
        "en": "It is not I, the little child, who dare to raise a rebellion. The ruler of Xia has committed many crimes. I have indeed heard the words of you all, but the Xia ruler is an offender,"
      },
      {
        "ref": "3:43",
        "zh": "予畏上帝，不敢不正。",
        "en": "and, as I fear the Supreme god, I dare not but punish him."
      },
      {
        "ref": "3:44",
        "zh": "今夏多罪，天命殛之。",
        "en": "Now, as the Xia ruler has committed many crimes, Heaven has charged me to destroy him."
      },
      {
        "ref": "3:45",
        "zh": "今女有眾，女曰：『我君不恤我眾，捨我嗇事而割政』。",
        "en": "Now, ye multitudes, you are saying, 'Our sovereign does not compassionate us; he disregards our husbandry, and his government is a cruel one.'"
      },
      {
        "ref": "3:46",
        "zh": "女其曰：『有罪，其柰何』？",
        "en": "You say, 'As to his crimes, what remedy have we?'"
      },
      {
        "ref": "3:47",
        "zh": "夏王率止眾力，率奪夏國。",
        "en": "The king of Xia does nothing but exhaust his people's strength, and treat the kingdom of Xia oppressively."
      },
      {
        "ref": "3:48",
        "zh": "眾有率怠不和，曰：『是日何時喪？予與女皆亡』！",
        "en": "His people have all become idle, and are not in harmony with him, saying, 'When will this sun set? We shall all perish together.'"
      },
      {
        "ref": "3:49",
        "zh": "夏德若茲，今朕必往。",
        "en": "Such being the conduct of the sovereign of Xia, I must advance."
      },
      {
        "ref": "3:50",
        "zh": "爾尚及予一人致天之罰，予其大理女。",
        "en": "If you help me, the one man, to carry out the punishment decreed by Heaven, and I will greatly reward you."
      },
      {
        "ref": "3:51",
        "zh": "女毋不信，朕不食言。",
        "en": "On no account disbelieve me. I will not retract my words."
      },
      {
        "ref": "3:52",
        "zh": "女不從誓言，予則帑僇女，無有攸赦。」",
        "en": "If you do not carry out the words of my speech, I will put you and your children to death; you shall not be pardoned."
      },
      {
        "ref": "3:53",
        "zh": "以告令師，作湯誓。",
        "en": "This being announced to the army, the speech of Tang was written."
      },
      {
        "ref": "3:54",
        "zh": "於是湯曰：「吾甚武」，號曰武王。",
        "en": "Tang then said, 'I am very warlike'; and he was styled the 'warlike king.'"
      },
      {
        "ref": "3:55",
        "zh": "桀敗於有娀之虛，桀奔於鳴條，夏師敗績。",
        "en": "Jie was defeated in the wilds of Yousong, and fled to Mingtiao. The army of Xia being entirely defeated,"
      },
      {
        "ref": "3:56",
        "zh": "湯遂伐三嵕，俘厥寶玉，義伯、仲伯作典寶。",
        "en": "Tang smote Sanzong, where he captured the precious jewels. Yibo and Zhongbo wrote the 'Statutes and Jewels.'"
      },
      {
        "ref": "3:57",
        "zh": "湯既勝夏，欲遷其社，不可，作夏社。",
        "en": "When Tang had conquered Xia, he wished to remove the altars to the spirits of the land, but was unable to do so, and the 'Altar of Xia' was written."
      },
      {
        "ref": "3:58",
        "zh": "伊尹報。",
        "en": "Yiyin made a report,"
      },
      {
        "ref": "3:59",
        "zh": "於是諸侯畢服，湯乃踐天子位，平定海內。",
        "en": "and the princes being satisfied, Tang ascended the Imperial throne, and tranquillized the country within the four seas."
      },
      {
        "ref": "3:60",
        "zh": "湯歸至于泰卷陶，中壘作誥。",
        "en": "When Tang returned he came to Taijuantao, and Zhonglei wrote his announcement."
      },
      {
        "ref": "3:61",
        "zh": "既絀夏命，還亳，作湯誥：",
        "en": "Having made an end of the sovereignty of Xia, Tang returned to Bo and wrote the 'Announcement of Tang.'"
      },
      {
        "ref": "3:62",
        "zh": "「維三月，王自至於東郊。",
        "en": "In the third month the king came himself to the eastern suburb"
      },
      {
        "ref": "3:63",
        "zh": "告諸侯群后：『毋不有功於民，勤力乃事。予乃大罰殛女，毋予怨。』",
        "en": "and made the following announcement to the princes and nobles: 'If you do not perform meritorious service for the people and be diligent in your business, I shall inflict the extreme punishment of death. Do not murmur against me.'"
      },
      {
        "ref": "3:64",
        "zh": "曰：『古禹、皋陶久勞于外，其有功乎民，民乃有安。",
        "en": "He also said: 'Formerly Yu and Gaoyao laboured long in distant regions. They performed meritorious service for the people, who dwelt in peace."
      },
      {
        "ref": "3:65",
        "zh": "東為江，北為濟，西為河，南為淮，四瀆已修，萬民乃有居。",
        "en": "On the east there was the Great river, on the north the Ji, on the west the Yellow river, and on the south the Huai. These four streams were kept within bounds, and the people dwelt in safety."
      },
      {
        "ref": "3:66",
        "zh": "后稷降播，農殖百穀。",
        "en": "Prince Millet told them how to sow and cultivate the various kinds of grain."
      },
      {
        "ref": "3:67",
        "zh": "三公咸有功于民，故後有立。",
        "en": "These three chiefs all performed meritorious service for the people, and were therefore ennobled."
      },
      {
        "ref": "3:68",
        "zh": "昔蚩尤與其大夫作亂百姓，帝乃弗予，有狀。",
        "en": "Formerly Chiyou and his officers raised a rebellion among the people but the [Yellow] Emperor disapproved, and his crimes were exposed."
      },
      {
        "ref": "3:69",
        "zh": "先王言不可不勉。』",
        "en": "The words of the former kings cannot but rouse you to action."
      },
      {
        "ref": "3:70",
        "zh": "曰：『不道，毋之在國，女毋我怨。』」",
        "en": "If you are unprincipled you shall not rule in the State. 'Do not murmur against me.'"
      },
      {
        "ref": "3:71",
        "zh": "以令諸侯。",
        "en": "Thus he directed the princes."
      },
      {
        "ref": "3:72",
        "zh": "伊尹作咸有一德，咎單作明居。",
        "en": "Yiyin wrote the book 'Both possessed pure Virtue,' and Jiudan wrote the 'Illustrious Abode.'"
      },
      {
        "ref": "3:73",
        "zh": "湯乃改正朔，易服色，上白，朝會以晝。",
        "en": "Tang altered the day of the New Year, and changed the colour of the dresses, white being uniformly worn at State functions."
      },
      {
        "ref": "3:74",
        "zh": "湯崩，太子太丁未立而卒，於是乃立太丁之弟外丙，是為帝外丙。",
        "en": "After the demise of Tang his eldest son, Taiding (Great D), died before he could come to the throne; and so Taiding's younger brother Waibing (Outer C), that is Emperor Waibing, came to the throne."
      },
      {
        "ref": "3:75",
        "zh": "帝外丙即位三年，崩，立外丙之弟中壬，是為帝中壬。",
        "en": "Emperor Waibing reigned three years, and died, and his brother Zhongren (Middle I), that is Emperor Zhongren, came to the throne."
      },
      {
        "ref": "3:76",
        "zh": "帝中壬即位四年，崩，伊尹乃立太丁之子太甲。",
        "en": "Emperor Zhongren reigned four years, and died. Yiyin then set Taiding's son, Taijia (Great A), on the throne."
      },
      {
        "ref": "3:77",
        "zh": "太甲，成湯適長孫也，是為帝太甲。",
        "en": "He was Tang the Completer's eldest legitimate grandson. This was Emperor Taijia."
      },
      {
        "ref": "3:78",
        "zh": "帝太甲元年，伊尹作伊訓，作肆命，作徂后。",
        "en": "In the first year of Emperor Taijia, Yiyin wrote the 'Instructions of Yi,' the 'Declaration of the Appointment of Heaven,' and the 'Deceased Sovereign.'"
      },
      {
        "ref": "3:79",
        "zh": "帝太甲既立三年，不明，暴虐，不遵湯法，亂德，於是伊尹放之於桐宮。",
        "en": "After Emperor Taijia had been on the throne three years, he proved unintelligent and cruel. He did not obey Tang's laws, and his conduct was disorderly, so Yiyin placed him in the Dryandra (palace)."
      },
      {
        "ref": "3:80",
        "zh": "三年，伊尹攝行政當國，以朝諸侯。",
        "en": "For three years Yiyin administered the government, and as ruler of the State gave audience to the nobles."
      },
      {
        "ref": "3:81",
        "zh": "帝太甲居桐宮三年，悔過自責，反善，於是伊尹乃迎帝太甲而授之政。",
        "en": "After the Emperor Taijia had dwelt in the Dryandra palace for three years, he repented of his errors, blamed himself, and amended his ways. Whereupon Yiyin met the Emperor Taijia and resigned to him the reins of government."
      },
      {
        "ref": "3:82",
        "zh": "帝太甲修德，諸侯咸歸殷，百姓以寧。",
        "en": "Emperor Taijia became virtuous, the princes all returned to the Yin capital, and the people were tranquil."
      },
      {
        "ref": "3:83",
        "zh": "伊尹嘉之，乃作太甲訓三篇，褒帝太甲，稱太宗。",
        "en": "Yiyin praised him, and wrote the 'Instructions to Taijia' in three books. Commending Emperor Taijia, he honoured him with the title of 'Great Master.'"
      },
      {
        "ref": "3:84",
        "zh": "太宗崩，子沃丁立。",
        "en": "'Great Master' died, and his son Woding (Glossy D) came to the throne."
      },
      {
        "ref": "3:85",
        "zh": "帝沃丁之時，伊尹卒。",
        "en": "In Emperor Woding's reign, Yiyin died."
      },
      {
        "ref": "3:86",
        "zh": "既葬伊尹於亳，咎單遂訓伊尹事，作沃丁。",
        "en": "When they had buried Yiyin at Bo, Jiu Dan set forth as lessons the doings of Yiyin; and the 'Woding' was written."
      },
      {
        "ref": "3:87",
        "zh": "沃丁崩，弟太庚立，是為帝太庚。",
        "en": "Wuting died, and his brother Taigeng (Great G), that is Emperor Taigeng, came to the throne."
      },
      {
        "ref": "3:88",
        "zh": "帝太庚崩，子帝小甲立。",
        "en": "Emperor Taigeng died, and his son Emperor Xiaojia (Little A) came to the throne."
      },
      {
        "ref": "3:89",
        "zh": "帝小甲崩，弟雍己立，是為帝雍己。",
        "en": "Emperor Xiaojia died, and his brother Yongji (Harmonious F), that is Emperor Yongji, came to the throne."
      },
      {
        "ref": "3:90",
        "zh": "殷道衰，諸侯或不至。",
        "en": "The influence of the Yin dynasty beginning to decline, the princes occasionally neglected to come to court."
      },
      {
        "ref": "3:91",
        "zh": "帝雍己崩，弟太戊立，是為帝太戊。",
        "en": "Emperor Yongji died, and his brother Taiwu (Great E), that is Emperor Taiwu, came to the throne."
      },
      {
        "ref": "3:92",
        "zh": "帝太戊立伊陟為相。",
        "en": "In his reign Yizhi became prime minister,"
      },
      {
        "ref": "3:93",
        "zh": "亳有祥桑谷共生於朝，一暮大拱。",
        "en": "when there were omens in Bo, for a mulberry tree and a stalk of grain grew up together in the court. They attained full size in one evening,"
      },
      {
        "ref": "3:94",
        "zh": "帝太戊懼，問伊陟。",
        "en": "and Emperor Taiwu, being alarmed, questioned Yizhi on the subject."
      },
      {
        "ref": "3:95",
        "zh": "伊陟曰：「臣聞妖不勝德，帝之政其有闕與？帝其修德。」",
        "en": "Yizhi said: 'I, your servant, have heard that virtue is not overcome by evil omens. There may be defects in your Majesty's government, but let your Majesty cultivate virtue.'"
      },
      {
        "ref": "3:96",
        "zh": "太戊從之，而祥桑枯死而去。",
        "en": "Taiwu followed his advice, and the ominous mulberry withered away."
      },
      {
        "ref": "3:97",
        "zh": "伊陟贊言于巫咸。",
        "en": "Yizhi consulted with Xian the wizard,"
      },
      {
        "ref": "3:98",
        "zh": "巫咸治王家有成，作咸艾，作太戊。",
        "en": "who governed the king's household admirably, and wrote the 'Xian-ai' and the 'Taiwu.'"
      },
      {
        "ref": "3:99",
        "zh": "帝太戊贊伊陟于廟，言弗臣，伊陟讓，作原命。",
        "en": "Emperor Taiwu spoke on the subject with Yizhi in court, and said he was disloyal. Yizhi gave up his post, and wrote the original commands."
      },
      {
        "ref": "3:100",
        "zh": "殷復興，諸侯歸之，故稱中宗。",
        "en": "Yin prospered again, and the princes gave their allegiance to the Emperor, who was called Middle Master."
      },
      {
        "ref": "3:101",
        "zh": "中宗崩，子帝中丁立。",
        "en": "Middle Master died, and his son Emperor Zhongding (Middle D) came to the throne."
      },
      {
        "ref": "3:102",
        "zh": "帝中丁遷于隞。",
        "en": "Emperor Zhongding removed to Ao."
      },
      {
        "ref": "3:103",
        "zh": "河亶甲居相。",
        "en": "Hedanjia lived in Xiang."
      },
      {
        "ref": "3:104",
        "zh": "祖乙遷于邢。",
        "en": "Zuyi removed to Geng."
      },
      {
        "ref": "3:105",
        "zh": "帝中丁崩，弟外壬立，是為帝外壬。",
        "en": "Emperor Zhongding died, and his brother Wairen (Outer I), that is Emperor Wairen, came to the throne."
      },
      {
        "ref": "3:106",
        "zh": "仲丁書闕不具。",
        "en": "The omissions in the book 'Zhongding' were not supplied."
      },
      {
        "ref": "3:107",
        "zh": "帝外壬崩，弟河亶甲立，是為帝河亶甲。",
        "en": "Emperor Wairen died, and his brother Hedanjia (River Truth A), that is Emperor Hedanjia, came to the throne."
      },
      {
        "ref": "3:108",
        "zh": "河亶甲時，殷復衰。",
        "en": "In his time the influence of Yin again began to wane."
      },
      {
        "ref": "3:109",
        "zh": "河亶甲崩，子帝祖乙立。",
        "en": "Hedanjia died, and his son Emperor Zuyi (Ancestor B) came to the throne."
      },
      {
        "ref": "3:110",
        "zh": "帝祖乙立，殷復興。",
        "en": "In Emperor Zuyi's time Yin again prospered,"
      },
      {
        "ref": "3:111",
        "zh": "巫賢任職。",
        "en": "and the wizard Xian held office."
      },
      {
        "ref": "3:112",
        "zh": "祖乙崩，子帝祖辛立。",
        "en": "Zuyi died, and his son Emperor Zuxin (Ancestor H) came to the throne."
      },
      {
        "ref": "3:113",
        "zh": "帝祖辛崩，弟沃甲立，是為帝沃甲。",
        "en": "Emperor Zuxin died, and his brother Wojia (Glossy A), i.e. Emperor Wojia, came to the throne."
      },
      {
        "ref": "3:114",
        "zh": "帝沃甲崩，立沃甲兄祖辛之子祖丁，是為帝祖丁。",
        "en": "Emperor Wojia died, and Zuding (Ancestor D), that is Emperor Zuding, who was Wojia's elder brother, was put on the throne."
      },
      {
        "ref": "3:115",
        "zh": "帝祖丁崩，立弟沃甲之子南庚，是為帝南庚。",
        "en": "Emperor Zuding died, and his brother Wojia's son, Nangeng (South G), that is Emperor Nangeng, was put on the throne."
      },
      {
        "ref": "3:116",
        "zh": "帝南庚崩，立帝祖丁之子陽甲，是為帝陽甲。",
        "en": "Emperor Nangeng died, and Emperor Zuding's son Yangjia (Male A), that is Emperor Yangjia, was put on the throne."
      },
      {
        "ref": "3:117",
        "zh": "帝陽甲之時，殷衰。",
        "en": "In his reign the power of the Yins declined."
      },
      {
        "ref": "3:118",
        "zh": "自中丁以來，廢適而更立諸弟子，弟子或爭相代立，比九世亂，於是諸侯莫朝。",
        "en": "Ever since the reign of Zhongding the legitimate heir had been set aside, and junior scions put on the throne instead. These used to fight and displace each other. For the last nine generations there had been anarchy, and the princes neglected to come to court."
      },
      {
        "ref": "3:119",
        "zh": "帝陽甲崩，弟盤庚立，是為帝盤庚。",
        "en": "Emperor Yangjia died, and his brother Pangeng (Plate G), that is Emperor Pangeng, came to the throne."
      },
      {
        "ref": "3:120",
        "zh": "帝盤庚之時，殷已都河北，盤庚渡河南，復居成湯之故居，乃五遷，無定處。",
        "en": "In his reign the Yins had their capital on the north of the Yellow river, but Pangeng crossed to the south of the river, and reoccupied the old palace of Tang the Completer. This made the fifth change of capital, and, as they had no fixed place of abode,"
      },
      {
        "ref": "3:121",
        "zh": "殷民咨胥皆怨，不欲徙。",
        "en": "the people of Yin murmured and repined, for they did not like moving about."
      },
      {
        "ref": "3:122",
        "zh": "盤庚乃告諭諸侯大臣曰：「昔高后成湯與爾之先祖俱定天下，法則可修。捨而弗勉，何以成德！」",
        "en": "Pangeng made the following announcement to the princes and ministers: 'Formerly our exalted sovereign Tang the Completer, in conjunction with your ancestors, decided what laws and regulations of the empire should be attended to or set aside, but if you do not make an effort how can you attain perfection?'"
      },
      {
        "ref": "3:123",
        "zh": "乃遂涉河南，治亳，行湯之政，然後百姓由寧，殷道復興。",
        "en": "He then crossed over to the south of the river, set up his capital at Bo, and having adopted Tang's system of government, the people were thereby tranquillized, and the fortunes of Yin were again in the ascendant."
      },
      {
        "ref": "3:124",
        "zh": "諸侯來朝，以其遵成湯之德也。",
        "en": "The princes came to court, and were influenced by the virtues of Tang the Completer."
      },
      {
        "ref": "3:125",
        "zh": "帝盤庚崩，弟小辛立，是為帝小辛。",
        "en": "Emperor Pangeng died, and his brother Xiaoxin (Little H), that is Emperor Xiaoxin, came to the throne."
      },
      {
        "ref": "3:126",
        "zh": "帝小辛立，殷復衰。",
        "en": "In his reign the power of Yin was again on the wane."
      },
      {
        "ref": "3:127",
        "zh": "百姓思盤庚，乃作盤庚三篇。",
        "en": "The people remembered Pangeng, and the 'Pangeng' in three parts was written."
      },
      {
        "ref": "3:128",
        "zh": "帝小辛崩，弟小乙立，是為帝小乙。",
        "en": "Emperor Xiaoxin died, and his brother Xiaoyi (Little B), that is Emperor Xiaoyi, came to the throne."
      },
      {
        "ref": "3:129",
        "zh": "帝小乙崩，子帝武丁立。",
        "en": "Emperor Xiaoyi died, and his son Emperor Wuding (Martial D) came to the throne."
      },
      {
        "ref": "3:130",
        "zh": "帝武丁即位，思復興殷，而未得其佐。",
        "en": "When Emperor Wuding was on the throne, he pondered how the Yin dynasty could be revivified, but as he had not obtained an assistant"
      },
      {
        "ref": "3:131",
        "zh": "三年不言，政事決定於冢宰，以觀國風。",
        "en": "he did not speak for three years, government affairs having to be conducted by the prime minister, who examined into the customs of the country."
      },
      {
        "ref": "3:132",
        "zh": "武丁夜夢得聖人，名曰說。",
        "en": "Wuding dreamed one night that he had found a holy man named Yue,"
      },
      {
        "ref": "3:133",
        "zh": "以夢所見視群臣百吏，皆非也。",
        "en": "and, in order that he might secure the man he had seen in his dream, he passed under review his officers and ministers of State, but not one of them was the right man."
      },
      {
        "ref": "3:134",
        "zh": "於是乃使百工營求之野，得說於傅險中。",
        "en": "He then made all his officers search for him in the wilds, and Yue was discovered at the crag of Fu."
      },
      {
        "ref": "3:135",
        "zh": "是時說為胥靡，筑於傅險。",
        "en": "At this time Yue was a clerk, not a builder at the crag of Fu."
      },
      {
        "ref": "3:136",
        "zh": "見於武丁，武丁曰是也。",
        "en": "He had an audience of Wuding, who said, 'That is the right man.'"
      },
      {
        "ref": "3:137",
        "zh": "得而與之語，果聖人，舉以為相，殷國大治。",
        "en": "Having talked with him, and finding that he really was a holy man, Wuding promoted him to be his prime minister. The kingdom of Yin was well governed in consequence,"
      },
      {
        "ref": "3:138",
        "zh": "故遂以傅險姓之，號曰傅說。",
        "en": "and he was named after the crag of Fu, being called Fu Yue."
      },
      {
        "ref": "3:139",
        "zh": "帝武丁祭成湯，明日，有飛雉登鼎耳而呴，武丁懼。",
        "en": "Wuding was sacrificing to Tang the Completer the next day, when a pheasant flew up, lighted on the ear of a tripod, and crowed. Wuding was alarmed,"
      },
      {
        "ref": "3:140",
        "zh": "祖己曰：「王勿憂，先修政事。」",
        "en": "but Zuji (Ancestor F) said the king should not be anxious; he must first rectify the administration of affairs."
      },
      {
        "ref": "3:141",
        "zh": "祖己乃訓王曰：「唯天監下典厥義，降年有永有不永，非天夭民，中絕其命。",
        "en": "Zuji accordingly lectured the king, saying, 'In its superintendence over men below, Heaven pays special regard to their proper behaviour, and bestows on them accordingly length of years or the reverse. Heaven does not cut short men's lives; they bring them to an end themselves."
      },
      {
        "ref": "3:142",
        "zh": "民有不若德，不聽罪，天既附命正厥德，乃曰其奈何。",
        "en": "Some men may not have conformed to virtue, and will not acknowledge their crimes; Heaven then charges them to correct their conduct, but they say, 'What shall we do?'"
      },
      {
        "ref": "3:143",
        "zh": "鳴呼！王嗣敬民，罔非天繼，常祀毋禮于棄道。」",
        "en": "Ah! the king should continuously treat the people with respect. Are they not Heaven's descendants? Be constant in sacrificing, and do not worship with the rites of a discarded religion.'"
      },
      {
        "ref": "3:144",
        "zh": "武丁修政行德，天下咸驩，殷道復興。",
        "en": "Wuding instituted a government reform, and practised virtue. The whole nation rejoiced, and the fortunes of Yin again flourished."
      },
      {
        "ref": "3:145",
        "zh": "帝武丁崩，子帝祖庚立。",
        "en": "Emperor Wuding died, and his son Emperor Zugeng (Ancestor G) came to the throne."
      },
      {
        "ref": "3:146",
        "zh": "祖己嘉武丁之以祥雉為德，立其廟為高宗，遂作高宗肜日及訓。",
        "en": "Zuji commended Wuding for considering the omen of the pheasant as a ground for practising virtue, and conferred on him the posthumous title of 'exalted ancestor,' and the 'Day of the Supplementary Sacrifice of Gaozong' and the 'Instructions [to Gaozong]' were written."
      },
      {
        "ref": "3:147",
        "zh": "帝祖庚崩，弟祖甲立，是為帝甲。",
        "en": "Emperor Zugeng died, and his brother Zujia (Ancestor A), that is Emperor Jia, came to the throne."
      },
      {
        "ref": "3:148",
        "zh": "帝甲淫亂，殷復衰。",
        "en": "He was dissipated, and the fortunes of Yin again waned."
      },
      {
        "ref": "3:149",
        "zh": "帝甲崩，子帝廩辛立。",
        "en": "Emperor Jia died, and his son Emperor Linxin (Granary H) sat on the throne."
      },
      {
        "ref": "3:150",
        "zh": "帝廩辛崩，弟庚丁立，是為帝庚丁。",
        "en": "Emperor Linxin died, and his brother Gengding (G. D), that is Emperor Gengding, sat on the throne."
      },
      {
        "ref": "3:151",
        "zh": "帝庚丁崩，子帝武乙立。",
        "en": "Emperor Gengding died, and his son Emperor Wuyi (Martial B) sat on the throne."
      },
      {
        "ref": "3:152",
        "zh": "殷復去亳，徙河北。",
        "en": "The Yins again left Bo, and crossed to the north bank of the river."
      },
      {
        "ref": "3:153",
        "zh": "帝武乙無道，為偶人，謂之天神。",
        "en": "The Emperor Wuyi was unprincipled and made images, which he called 'Heavenly gods.'"
      },
      {
        "ref": "3:154",
        "zh": "與之博，令人為行。",
        "en": "With these he played chess, ordering some one to make the moves for them;"
      },
      {
        "ref": "3:155",
        "zh": "天神不勝，乃僇辱之。",
        "en": "and when the 'celestial gods' did not win he abused them,"
      },
      {
        "ref": "3:156",
        "zh": "為革囊，盛血，卬而射之，命曰「射天」。",
        "en": "and making a leather bag, filled it with blood, threw it up and shot at it. This he called shooting at Heaven."
      },
      {
        "ref": "3:157",
        "zh": "武乙獵於河渭之閒，暴雷，武乙震死。",
        "en": "While Wuyi was hunting between the Yellow and Wei rivers, there was a clap of thunder, and Wuyi was struck dead by lightning."
      },
      {
        "ref": "3:158",
        "zh": "子帝太丁立。",
        "en": "His son Emperor Taiding (Great D) came to the throne."
      },
      {
        "ref": "3:159",
        "zh": "帝太丁崩，子帝乙立。",
        "en": "Emperor Taiding died, and his son Emperor Yi (B) sat on the throne."
      },
      {
        "ref": "3:160",
        "zh": "帝乙立，殷益衰。",
        "en": "In his reign the fortunes of Yin declined still further."
      },
      {
        "ref": "3:161",
        "zh": "帝乙長子曰微子啟，啟母賤，不得嗣。",
        "en": "Emperor Yi's (B) eldest son was Qi, viscount of Wei. Qi's mother being of low caste, he could not be heir to the throne."
      },
      {
        "ref": "3:162",
        "zh": "少子辛，辛母正后，辛為嗣。",
        "en": "His younger son was Xin (X), whose mother was the principal consort, and so he became the heir-apparent."
      },
      {
        "ref": "3:163",
        "zh": "帝乙崩，子辛立，是為帝辛，天下謂之紂。",
        "en": "Emperor Yi died, and his son Xin sat on the throne. Emperor Xin was called by everybody in the empire Zhou (the tyrant)."
      },
      {
        "ref": "3:164",
        "zh": "帝紂資辨捷疾，聞見甚敏；",
        "en": "Emperor Zhou's discrimination was acute, his hearing and sight particularly good,"
      },
      {
        "ref": "3:165",
        "zh": "材力過人，手格猛獸；",
        "en": "his natural abilities extraordinary, and his physical strength equal to that of a wild beast."
      },
      {
        "ref": "3:166",
        "zh": "知足以距諫，言足以飾非；",
        "en": "He had cunning enough to evade reproofs, and volubility enough to gloss over his faults."
      },
      {
        "ref": "3:167",
        "zh": "矜人臣以能，高天下以聲，以為皆出己之下。",
        "en": "He boasted that he was above his ministers on the ground of ability, and that he surpassed the people of the empire on account of his reputation."
      },
      {
        "ref": "3:168",
        "zh": "好酒淫樂，嬖於婦人。",
        "en": "He indulged in wine, women, and lusts of all sorts."
      },
      {
        "ref": "3:169",
        "zh": "愛妲己，妲己之言是從。",
        "en": "His partiality for Taji (Actress F) caused him to carry out whatever she desired,"
      },
      {
        "ref": "3:170",
        "zh": "於是使師涓作新淫聲，北里之舞，靡靡之樂。",
        "en": "so that his ministers had to devise new forms of dissipation, the most depraved dances and extravagant music;"
      },
      {
        "ref": "3:171",
        "zh": "厚賦稅以實鹿臺之錢，而盈鉅橋之粟。",
        "en": "he increased the taxation in order to fill the Stag tower with money, and to store the granary at 'Big bridge.'"
      },
      {
        "ref": "3:172",
        "zh": "益收狗馬奇物，充仞宮室。",
        "en": "He made a collection of dogs, horses, and curiosities, with which he filled his palaces;"
      },
      {
        "ref": "3:173",
        "zh": "益廣沙丘苑臺，多取野獸蜚鳥置其中。",
        "en": "and enlarging his parks and towers at Shaqiu, procured numbers of wild beasts and birds and put them therein."
      },
      {
        "ref": "3:174",
        "zh": "慢於鬼神。",
        "en": "He slighted the spirits,"
      },
      {
        "ref": "3:175",
        "zh": "大聚樂戲於沙丘，以酒為池，縣肉為林，使男女裸相逐其閒，為長夜之飲。",
        "en": "assembled a great number of play actors at Shaqiu, made a pond of wine, hung the trees with meat, made men and women chase each other about quite naked, and had drinking bouts the whole night long."
      },
      {
        "ref": "3:176",
        "zh": "百姓怨望而諸侯有畔者，於是紂乃重刑辟，有炮格之法。",
        "en": "The people murmured, and when the nobles rebelled Zhouxin increased the severity of his punishments, instituting the punishment of roasting."
      },
      {
        "ref": "3:177",
        "zh": "以西伯昌、九侯、鄂侯為三公。",
        "en": "He appointed Chang Chief of the West, the prince of Jiu, and the prince of E his three principal ministers."
      },
      {
        "ref": "3:178",
        "zh": "九侯有好女，入之紂。",
        "en": "The prince of Jiu had a beloved daughter who was sent in to the emperor,"
      },
      {
        "ref": "3:179",
        "zh": "九侯女不喜淫，紂怒，殺之，而醢九侯。",
        "en": "and when she disapproved of his debaucheries the tyrant killed her in his rage, and made mincemeat of her father."
      },
      {
        "ref": "3:180",
        "zh": "鄂侯爭之彊，辨之疾，并脯鄂侯。",
        "en": "The prince of E objected, and vehemently remonstrated with him, whereupon he was sliced to pieces."
      },
      {
        "ref": "3:181",
        "zh": "西伯昌聞之，竊嘆。",
        "en": "Chang Chief of the West, hearing of all this, sighed furtively,"
      },
      {
        "ref": "3:182",
        "zh": "崇侯虎知之，以告紂，紂囚西伯羑里。",
        "en": "but 'Tiger' the prince of Chong, being aware of it, informed the tyrant, who thereupon cast Chief of the West into prison at Youli."
      },
      {
        "ref": "3:183",
        "zh": "西伯之臣閎夭之徒，求美女奇物善馬以獻紂，紂乃赦西伯。",
        "en": "His servant Hongyao and others procured a pretty girl, rare curiosities, and fine horses, which they presented to the tyrant, who thereupon pardoned Chief of the West."
      },
      {
        "ref": "3:184",
        "zh": "西伯出而獻洛西之地，以請除炮格之刑。",
        "en": "The latter went forth and gave the country to the west of the Luo river to the tyrant, and begged that he would abolish the punishment of roasting."
      },
      {
        "ref": "3:185",
        "zh": "紂乃許之，賜弓矢斧鉞，使得征伐，為西伯。",
        "en": "The emperor agreed to this, and gave him bows, arrows, axes, and halberds, with a commission to start on a warlike expedition. He was appointed Chief of the West,"
      },
      {
        "ref": "3:186",
        "zh": "而用費中為政。",
        "en": "and Feizhong was employed in the government."
      },
      {
        "ref": "3:187",
        "zh": "費中善諛，好利，殷人弗親。",
        "en": "Feizhong was fond of flattery and greedy of gain, so the men of Yin were not attached to him."
      },
      {
        "ref": "3:188",
        "zh": "紂又用惡來。",
        "en": "The tyrant also gave Elai an appointment,"
      },
      {
        "ref": "3:189",
        "zh": "惡來善毀讒，諸侯以此益疏。",
        "en": "but Elai was fond of vilifying persons, so the princes became more and more estranged from the court."
      },
      {
        "ref": "3:190",
        "zh": "西伯歸，乃陰修德行善，諸侯多叛紂而往歸西伯。",
        "en": "Now Chief of the West, on returning from his expedition, secretly cultivated virtue, and was charitable; many of the princes revolted from the tyrant and gave their allegiance to Chief of the West,"
      },
      {
        "ref": "3:191",
        "zh": "西伯滋大，紂由是稍失權重。",
        "en": "who from this time gained in influence, while the tyrant rather lost his authority."
      },
      {
        "ref": "3:192",
        "zh": "王子比干諫，弗聽。",
        "en": "The monarch's son Bigan remonstrated with his father, but he was not listened to."
      },
      {
        "ref": "3:193",
        "zh": "商容賢者，百姓愛之，紂廢之。",
        "en": "Shangrong praised his worth, and the people loved him, but the tyrant set him aside."
      },
      {
        "ref": "3:194",
        "zh": "及西伯伐饑國，滅之，紂之臣祖伊聞之而咎周，恐，奔告紂曰：「天既訖我殷命，假人元龜，無敢知吉，非先王不相我後人，維王淫虐用自絕，故天棄我，不有安食，不虞知天性，不迪率典。",
        "en": "Chief of the West marched against and conquered the Ji State, and the tyrant's minister Zu-yi heard of it, and blaming [the house of] Zhou hurried off in alarm to report it to the tyrant. He said: 'Heaven is bringing to an end the destiny of our dynasty of Yin; great men and the ancient tortoise do not venture to foretell good fortune. It is not that the former kings do not aid us men of this later time; but you, O king, by your dissoluteness and oppression are cutting yourself off. Heaven has therefore rejected us; we do not eat our meals in peace, we do not consider our heavenly nature, we do not follow and observe the statutes."
      },
      {
        "ref": "3:195",
        "zh": "今我民罔不欲喪，曰『天曷不降威，大命胡不至』？今王其柰何？」",
        "en": "Our people are now all longing for the destruction of the dynasty, saying, Why does not Heaven send down its awe-inspiring authority? Why is not its great decree manifested? What remedy is there against the present king?'"
      },
      {
        "ref": "3:196",
        "zh": "紂曰：「我生不有命在天乎！」",
        "en": "The tyrant said: 'Is not my life secured by the decree of Heaven?'"
      },
      {
        "ref": "3:197",
        "zh": "祖伊反，曰：「紂不可諫矣。」",
        "en": "Zu-yi returned, and said, 'The tyrant cannot be remonstrated with.'"
      },
      {
        "ref": "3:198",
        "zh": "西伯既卒，周武王之東伐，至盟津，諸侯叛殷會周者八百。",
        "en": "Chief of the West having died, King Wu of Zhou in his march eastward arrived at the ford of Meng. The princes revolted, and 800 princes of the house of Zhou having assembled"
      },
      {
        "ref": "3:199",
        "zh": "諸侯皆曰：「紂可伐矣。」",
        "en": "declared that the tyrant ought to be attacked."
      },
      {
        "ref": "3:200",
        "zh": "武王曰：「爾未知天命。」乃復歸。",
        "en": "King Wu said, 'You know nothing of Heaven's decree,' and retired."
      },
      {
        "ref": "3:201",
        "zh": "紂愈淫亂不止。",
        "en": "The tyrant abandoned himself all the more to lust and dissipation,"
      },
      {
        "ref": "3:202",
        "zh": "微子數諫不聽，乃與大師、少師謀，遂去。",
        "en": "and the viscount of Wei remonstrated with him several times, but he would not heed, so having consulted with the senior and junior tutors the viscount of Wei withdrew from court."
      },
      {
        "ref": "3:203",
        "zh": "比干曰：「為人臣者，不得不以死爭。」乃彊諫紂。",
        "en": "Bigan said, 'A minister cannot but argue to the death'; he accordingly remonstrated vehemently with the tyrant,"
      },
      {
        "ref": "3:204",
        "zh": "紂怒曰：「吾聞聖人心有七竅。」剖比干，觀其心。",
        "en": "who in a rage said, 'I have heard that the heart of a holy man has seven apertures,' and cut Bigan open to look at his heart."
      },
      {
        "ref": "3:205",
        "zh": "箕子懼，乃詳狂為奴，紂又囚之。",
        "en": "The viscount of Ji, in terror, then feigned himself mad, and became a slave, and the tyrant again imprisoned him."
      },
      {
        "ref": "3:206",
        "zh": "殷之大師、少師乃持其祭樂器奔周。",
        "en": "The senior and junior tutors of Yin, accordingly, taking the sacrificial and musical implements, hastened to the Zhou State,"
      },
      {
        "ref": "3:207",
        "zh": "周武王於是遂率諸侯伐紂。",
        "en": "and King Wu of Zhou upon this marched at the head of the princes to attack the tyrant,"
      },
      {
        "ref": "3:208",
        "zh": "紂亦發兵距之牧野。",
        "en": "who also sent out an army to withstand him in the plain of Mu."
      },
      {
        "ref": "3:209",
        "zh": "甲子日，紂兵敗。",
        "en": "On the day Jiazi the tyrant's troops were beaten,"
      },
      {
        "ref": "3:210",
        "zh": "紂走入，登鹿臺，衣其寶玉衣，赴火而死。",
        "en": "and he himself fled to the Stag tower, which he ascended, and, putting on his gorgeous robes and jewels, burnt himself to death."
      },
      {
        "ref": "3:211",
        "zh": "周武王遂斬紂頭，縣之［大］白旗。",
        "en": "King Wu of Zhou then cut off the tyrant's head and exhibited it on a pole;"
      },
      {
        "ref": "3:212",
        "zh": "殺妲己。",
        "en": "he also slew Daji,"
      },
      {
        "ref": "3:213",
        "zh": "釋箕子之囚，封比干之墓，表商容之閭。",
        "en": "released the viscount of Ji from prison, raised a tumulus over the grave of Bigan, and made a eulogy to the memory of Shangrong."
      },
      {
        "ref": "3:214",
        "zh": "封紂子武庚、祿父，以續殷祀，令修行盤庚之政。",
        "en": "His sons, Wugeng and Lufu, were appointed to continue the sacrifices to the Yins. He restored Pangeng's mode of administration,"
      },
      {
        "ref": "3:215",
        "zh": "殷民大說。",
        "en": "and the people of Yin were greatly rejoiced."
      },
      {
        "ref": "3:216",
        "zh": "於是周武王為天子。",
        "en": "Whereupon King Wu of Zhou became Son of Heaven (emperor)."
      },
      {
        "ref": "3:217",
        "zh": "其後世貶帝號，號為王。",
        "en": "His descendants abolished the title of Di (divine emperor), and called themselves kings (Wang);"
      },
      {
        "ref": "3:218",
        "zh": "而封殷後為諸侯，屬周。",
        "en": "and the descendants of the Yins were made princes subordinate to the house of Zhou."
      },
      {
        "ref": "3:219",
        "zh": "周武王崩，武庚與管叔、蔡叔作亂，成王命周公誅之，而立微子於宋，以續殷後焉。",
        "en": "After the death of King Wu of Zhou, Wugeng, Guanshu, and Caishu rebelled. King Cheng ordered the duke of Zhou to execute them, and the viscount of Wei was established in the Song State to continue (the ancestral worship as) a descendant of the Yins."
      },
      {
        "ref": "3:220",
        "zh": "太史公曰：余以頌次契之事，自成湯以來，采於書詩。",
        "en": "[Translation not available]"
      },
      {
        "ref": "3:221",
        "zh": "契為子姓，其後分封，以國為姓，有殷氏、來氏、宋氏、空桐氏、稚氏、北殷氏、目夷氏。",
        "en": "[Translation not available]"
      },
      {
        "ref": "3:222",
        "zh": "孔子曰，殷路車為善，而色尚白。",
        "en": "[Translation not available]"
      }
    ]
  }
}
