{
  "id": "yijing",
  "title": "易經",
  "titleEn": "Book of Changes (I Ching)",
  "source": "Chinese Text Project (ctext.org) - James Legge translation",
  "chapter": {
    "number": "62",
    "title": "Xiao Guo",
    "slug": "xiao-guo",
    "passages": [
      {
        "ref": "62:1",
        "zh": "小過：亨，利貞，可小事，不可大事。",
        "en": "Xiao Guo indicates that (in the circumstances which it implies) there will be progress and attainment. But it will be advantageous to be firm and correct. (What the name denotes) may be done in small affairs, but not in great affairs."
      },
      {
        "ref": "62:2",
        "zh": "飛鳥遺之音，不宜上，宜下，大吉。",
        "en": "(It is like) the notes that come down from a bird on the wing - to descend is better than to ascend. There will (in this way) be great good fortune."
      },
      {
        "ref": "62:3",
        "zh": "小過，小者過而亨也。",
        "en": "In Xiao Guo (we see) the small (lines) exceeding the others, and (giving the intimation of) progress and attainment."
      },
      {
        "ref": "62:4",
        "zh": "過以利貞，與時行也。",
        "en": "Such 'exceeding, in order to its being advantageous, must be associated with firmness and correctness:' - that is, it must take place (only) according to (the requirements of) the time."
      },
      {
        "ref": "62:5",
        "zh": "柔得中，是以小事吉也。",
        "en": "The weak (lines) are in the central places, and hence (it is said that what the name denotes) may be done in small affairs, and there will be good fortune."
      },
      {
        "ref": "62:6",
        "zh": "剛失位而不中，是以不可大事也。",
        "en": "Of the strong (lines one) is not in its proper place, and (the other) is not central, hence it is said that (what the name denotes) 'should not be done in great affairs.'"
      },
      {
        "ref": "62:7",
        "zh": "有飛鳥之象焉，有飛鳥遺之音，不宜上宜下，大吉；上逆而下順也。",
        "en": "(In the hexagram) we have 'the symbol of a bird on the wing, and of the notes that come down from such a bird, for which it is better to descend than to ascend, thereby leading to great good fortune:' - to ascend is contrary to what is reasonable in the case, while to descend is natural and right."
      },
      {
        "ref": "62:8",
        "zh": "山上有雷，小過；",
        "en": "(The trigram representing) a hill and that for thunder above it form Xiao Guo."
      },
      {
        "ref": "62:9",
        "zh": "君子以行過乎恭，喪過乎哀，用過乎儉。",
        "en": "The superior man, in accordance with this, in his conduct exceeds in humility, in mourning exceeds in sorrow, and in his expenditure exceeds in economy."
      },
      {
        "ref": "62:10",
        "zh": "初六：飛鳥以凶。",
        "en": "The first SIX, divided, suggests (the idea of) a bird flying, (and ascending) till the issue is evil."
      },
      {
        "ref": "62:11",
        "zh": "飛鳥以凶，不可如何也。",
        "en": "'There is a bird flying (and ascending) till the result is evil:' - nothing can be done to avoid this issue."
      },
      {
        "ref": "62:12",
        "zh": "六二：過其祖，遇其妣；不及其君，遇其臣；无咎。",
        "en": "The second SIX, divided, shows its subject passing by his grandfather, and meeting with his grandmother; not attempting anything against his ruler, but meeting him as his minister. There will be no error."
      },
      {
        "ref": "62:13",
        "zh": "不及其君，臣不可過也。",
        "en": "'He does not attempt to reach his ruler:' - a minister should not overpass the distance (between his ruler and himself)."
      },
      {
        "ref": "62:14",
        "zh": "九三：弗過防之，從或戕之，凶。",
        "en": "The third NINE, undivided, shows its subject taking no extraordinary precautions against danger; and some in consequence finding opportunity to assail and injure him. There will be evil."
      },
      {
        "ref": "62:15",
        "zh": "從或戕之，凶如何也。",
        "en": "'Some in consequence find opportunity to assail and injure him. There will be evil:' - how great will it be!"
      },
      {
        "ref": "62:16",
        "zh": "九四：无咎，弗過遇之。",
        "en": "The fourth NINE, undivided, shows its subject falling into no error, but meeting (the exigency of his situation), without exceeding (in his natural. course)."
      },
      {
        "ref": "62:17",
        "zh": "往厲必戒，勿用永貞。",
        "en": "If he go forward, there will be peril, and he must be cautious. There is no occasion to be using firmness perpetually."
      },
      {
        "ref": "62:18",
        "zh": "弗過遇之，位不當也。",
        "en": "'He meets the exigency (of his situation), without exceeding (the proper course):' - (he does so), the position being inappropriate (for a strong line)."
      },
      {
        "ref": "62:19",
        "zh": "往厲必戒，終不可長也。",
        "en": "'If he go forward, there will be peril, and he must be cautious:' - the result would be that his course would not be long pursued."
      },
      {
        "ref": "62:20",
        "zh": "六五：密雲不雨，自我西郊，公弋取彼在穴。",
        "en": "The fifth SIX, divided, (suggests the idea) of dense clouds, but no rain, coming from our borders in the west. It also (shows) the prince shooting his arrow, and taking the bird in a cave."
      },
      {
        "ref": "62:21",
        "zh": "密雲不雨，已上也。",
        "en": "'There are dense clouds, but no rain:' - (the line) is in too high a place."
      },
      {
        "ref": "62:22",
        "zh": "上六：弗遇過之，飛鳥離之，凶，是謂災眚。",
        "en": "The sixth SIX, divided, shows. its subject not meeting (the exigency of his situation), and exceeding (his proper course). (It suggests the idea of) a bird flying far aloft. There will be evil. The case is what is called one of calamity and self-produced injury."
      },
      {
        "ref": "62:23",
        "zh": "弗遇過之，已亢也。",
        "en": "'He does not meet the exigency (of his situation), and exceeds (his proper course):' - (the position indicates) the habit of domineering."
      }
    ]
  }
}
