{
  "id": "yijing",
  "title": "易經",
  "titleEn": "Book of Changes (I Ching)",
  "source": "Chinese Text Project (ctext.org) - James Legge translation",
  "chapter": {
    "number": "16",
    "title": "Yu",
    "slug": "yu",
    "passages": [
      {
        "ref": "16:1",
        "zh": "豫：利建侯，行師。",
        "en": "Yu indicates that, (in the state which it implies), feudal princes may be set up, and the hosts put in motion, with advantage."
      },
      {
        "ref": "16:2",
        "zh": "豫，剛應而志行，順以動，豫。",
        "en": "In Yu we see the strong (line) responded to by all the others, and the will (of him whom it represents) being carried out; and (also) docile obedience employing movement (for its purposes). (From these things comes) Yu (the Condition of harmony and satisfaction)."
      },
      {
        "ref": "16:3",
        "zh": "豫，順以動，故天地如之，而況建侯行師乎？",
        "en": "In this condition we have docile obedience employing movement (for its purposes), and therefore it is so as between heaven and earth; - how much more will it be so (among men) in 'the setting up of feudal princes and putting the hosts in motion!'"
      },
      {
        "ref": "16:4",
        "zh": "天地以順動，故日月不過，而四時不忒；",
        "en": "Heaven and earth show that docile obedience in connexion with movement, and hence the sun and moon make no error (in time), and the four seasons do not deviate (from their order)."
      },
      {
        "ref": "16:5",
        "zh": "聖人以順動，則刑罰清而民服。",
        "en": "The sages show such docile obedience in connexion with their movements, and hence their punishments and penalties are entirely just, and the people acknowledge it by their submission."
      },
      {
        "ref": "16:6",
        "zh": "豫之時義大矣哉！",
        "en": "Great indeed are the time and significance indicated in Yu!"
      },
      {
        "ref": "16:7",
        "zh": "雷出地奮，豫。",
        "en": "(The trigrams for) the earth and thunder issuing from it with its crashing noise form Yu."
      },
      {
        "ref": "16:8",
        "zh": "先王以作樂崇德，殷薦之上帝，以配祖考。",
        "en": "The ancient kings, in accordance with this, composed their music and did honour to virtue, presenting it especially and most grandly to God, when they associated with Him (at the service) their highest ancestor and their father."
      },
      {
        "ref": "16:9",
        "zh": "初六：鳴豫，凶。",
        "en": "The first SIX, divided, shows its subject proclaiming his pleasure and satisfaction. There will be evil."
      },
      {
        "ref": "16:10",
        "zh": "初六鳴豫，志窮凶也。",
        "en": "'The (subject of the) first six proclaims his pleasure and satisfaction:' - there will be evil; his wishes have been satisfied to overflowing."
      },
      {
        "ref": "16:11",
        "zh": "六二：介于石，不終日，貞吉。",
        "en": "The second SIX, divided, shows one who is firm as a rock. (He sees a thing) without waiting till it has come to pass; with his firm correctness there will be good fortune."
      },
      {
        "ref": "16:12",
        "zh": "不終日，貞吉；",
        "en": "'(He sees a thing) without waiting till it has come to pass; with his firm correctness there will be good fortune:'"
      },
      {
        "ref": "16:13",
        "zh": "以中正也。",
        "en": "this is shown by the central and correct position (of the line)."
      },
      {
        "ref": "16:14",
        "zh": "六三：盱豫，悔。",
        "en": "The third SIX, divided, shows one looking up (for favours), while he indulges the feeling of pleasure and satisfaction."
      },
      {
        "ref": "16:15",
        "zh": "遲有悔。",
        "en": "If he would understand!--If he be late in doing so, there will indeed be occasion for repentance."
      },
      {
        "ref": "16:16",
        "zh": "盱豫有悔，位不當也。",
        "en": "'He looks up (for favours), while he indulges the feeling of satisfaction; there will be occasion for repentance:' - this is intimated by the position not being the appropriate one."
      },
      {
        "ref": "16:17",
        "zh": "九四：由豫，大有得。",
        "en": "The fourth NINE, undivided, shows him from whom the harmony and satisfaction come. Great is the success which he obtains."
      },
      {
        "ref": "16:18",
        "zh": "勿疑。",
        "en": "Let him not allow suspicions to enter his mind, and thus friends will gather around him."
      },
      {
        "ref": "16:19",
        "zh": "朋盍簪。",
        "en": "Friends will gather around him."
      },
      {
        "ref": "16:20",
        "zh": "由豫，大有得；",
        "en": "'From him the harmony and satisfaction come; great is the success which he obtains:'"
      },
      {
        "ref": "16:21",
        "zh": "志大行也。",
        "en": "his aims take effect on a grand scale."
      },
      {
        "ref": "16:22",
        "zh": "六五：貞疾，恆不死。",
        "en": "The fifth six, divided, shows one with a chronic complaint, but who lives on without dying."
      },
      {
        "ref": "16:23",
        "zh": "六五貞疾，乘剛也。",
        "en": "'(The subject of) the fifth six has a chronic complaint:' - this is shown by his being mounted on the strong (line)."
      },
      {
        "ref": "16:24",
        "zh": "恆不死，中未亡也。",
        "en": "'He still lives on without dying:' - he is in the central position, (and its memories of the past) have not yet perished."
      },
      {
        "ref": "16:25",
        "zh": "上六：冥豫，成有渝，无咎。",
        "en": "The topmost six, divided, shows its subject with darkened mind devoted to the pleasure and satisfaction (of the time); but if he change his course even when (it may be considered as) completed, there will be no error."
      },
      {
        "ref": "16:26",
        "zh": "冥豫在上，何可長也。",
        "en": "'With darkened mind devoted to the harmony and satisfaction (of the time),' as shown in the topmost (line): - how can one in such a condition continue long?"
      }
    ]
  }
}
