{
  "id": "yijing",
  "title": "易經",
  "titleEn": "Book of Changes (I Ching)",
  "source": "Chinese Text Project (ctext.org) - James Legge translation",
  "chapter": {
    "number": "61",
    "title": "Zhong Fu",
    "slug": "zhong-fu",
    "passages": [
      {
        "ref": "61:1",
        "zh": "中孚：豚魚吉，利涉大川，利貞。",
        "en": "Zhong Fu (moves even) pigs and fish, and leads to good fortune. There will be advantage in crossing the great stream. There will be advantage in being firm and correct."
      },
      {
        "ref": "61:2",
        "zh": "中孚，柔在內而剛得中。",
        "en": "In Zhong Fu we have the (two) weak lines in the innermost part (of the figure), and strong lines occupying the central places (in the trigrams)."
      },
      {
        "ref": "61:3",
        "zh": "說而巽，孚，乃化邦也。",
        "en": "(We have the attributes) of pleased satisfaction and flexible penetration. Sincerity (thus symbolled) will transform a country."
      },
      {
        "ref": "61:4",
        "zh": "豚魚吉，信及豚魚也。",
        "en": "'Pigs and fish (are moved), and there will be good fortune:' - sincerity reaches to (and affects even) pigs and fishes."
      },
      {
        "ref": "61:5",
        "zh": "利涉大川，乘木舟虛也。",
        "en": "'There will be advantage in crossing the great stream:' - (we see in the figure) one riding on (the emblem of) wood, which forms an empty boat."
      },
      {
        "ref": "61:6",
        "zh": "中孚以利貞，乃應乎天也。",
        "en": "In (the exercise of the virtue denoted by) Zhong Fu, (it is said that) 'there will be advantage in being firm and correct:' - in that virtue indeed we have the response (of man) to Heaven."
      },
      {
        "ref": "61:7",
        "zh": "澤上有風，中孚；",
        "en": "(The trigram representing the waters of) a marsh and that for wind above it form Zhong Fu."
      },
      {
        "ref": "61:8",
        "zh": "君子以議獄緩死。",
        "en": "The superior man, in accordance with this, deliberates about cases of litigation and delays (the infliction of) death."
      },
      {
        "ref": "61:9",
        "zh": "初九：虞吉，有它不燕。",
        "en": "The first NINE, undivided, shows its subject resting (in himself). There will be good fortune. If he sought to any other, he would not find rest."
      },
      {
        "ref": "61:10",
        "zh": "初九虞吉，志未變也。",
        "en": "'The first NINE, (undivided), shows its subject resting (in himself). There will be good fortune:' - no change has yet come over his purpose."
      },
      {
        "ref": "61:11",
        "zh": "九二：鳴鶴在陰，其子和之，我有好爵，吾與爾靡之。",
        "en": "The second NINE, undivided, shows its subject (like) the crane crying out in her hidden retirement, and her young ones responding to her. (It is as if it were said), 'I have a cup of good spirits,' (and the response were), 'I will partake of it with you.'"
      },
      {
        "ref": "61:12",
        "zh": "其子和之，中心願也。",
        "en": "'Her young ones respond to her:' - from the (common) wish of the inmost heart."
      },
      {
        "ref": "61:13",
        "zh": "六三：得敵，或鼓或罷，或泣或歌。",
        "en": "The third SIX, divided, shows its subject having met with his mate. Now he beats his drum, and now he leaves off. Now he weeps, and now he sings."
      },
      {
        "ref": "61:14",
        "zh": "可鼓或罷，位不當也。",
        "en": "'Now he beats his drum, and now he leaves off:' - the position (of the line) is the appropriate one for it."
      },
      {
        "ref": "61:15",
        "zh": "六四：月幾望，馬匹亡，无咎。",
        "en": "The fourth SIX, divided, shows its subject (like) the moon nearly full, and (like) a horse (in a chariot) whose fellow disappears. There will be no error."
      },
      {
        "ref": "61:16",
        "zh": "馬匹亡，絕類上也。",
        "en": "'A horse the fellow of which disappears:' - he breaks from his (former) companions, and mounts upwards."
      },
      {
        "ref": "61:17",
        "zh": "九五：有孚攣如，无咎。",
        "en": "The fifth NINE, undivided, shows its subject perfectly sincere, and linking (others) to him in closest union. There will be no error."
      },
      {
        "ref": "61:18",
        "zh": "有孚攣如，位正當也。",
        "en": "'He is perfectly sincere, and links others to him in closest union:' - the place (of the line) is the correct and appropriate one."
      },
      {
        "ref": "61:19",
        "zh": "上九：翰音登于天，貞凶。",
        "en": "The topmost NINE, undivided, shows its subject in chanticleer (trying to) mount to heaven. Even with firm correctness there will be evil."
      },
      {
        "ref": "61:20",
        "zh": "翰音登于天，何可長也。",
        "en": "'Chanticleer (tries to) mount to heaven:' - but how can (such an effort) continue long?"
      }
    ]
  }
}
