{
  "id": "yijing",
  "title": "易經",
  "titleEn": "Book of Changes (I Ching)",
  "source": "Chinese Text Project (ctext.org) - James Legge translation",
  "chapter": {
    "number": "20",
    "title": "Guan",
    "slug": "guan",
    "passages": [
      {
        "ref": "20:1",
        "zh": "觀：盥而不薦，有孚顒若。",
        "en": "Guan shows (how he whom it represents should be like) the worshipper who has washed his hands, but not (yet) presented his offerings - with sincerity and an appearance of dignity (commanding reverent regard)."
      },
      {
        "ref": "20:2",
        "zh": "大觀在上，順而巽，中正以觀天下。觀，盥而不薦，有孚顒若，下觀而化也。觀天之神道，而四時不忒，聖人以神道設教，而天下服矣。",
        "en": "The great Manifester occupies an upper place (in the figure), which consists of (the trigrams whose attributes are) docility and flexibility. He is in the central position and his correct place, and thus exhibits (his lessons) to all under heaven. 'Guan shows its subject like a worshipper who has washed his hands, but not (yet) presented his offerings; - with sincerity and an appearance of dignity (commanding reverent regard):' - (all) beneath look to him and are transformed. When we contemplate the spirit-like way of Heaven, we see how the four seasons proceed without error. The sages, in accordance with (this) spirit-like way, laid down their instructions, and all under heaven yield submission to them."
      },
      {
        "ref": "20:3",
        "zh": "風行地上，觀；先王以省方，觀民設教。",
        "en": "(The trigram representing) the earth, and that for wind moving above it, form Guan. The ancient kings, in accordance with this, examined the (different) regions (of the kingdom), to see the (ways of the) people, and set forth their instructions."
      },
      {
        "ref": "20:4",
        "zh": "初六：童觀，小人无咎，君子吝。",
        "en": "The first SIX, divided, shows the looking of a lad - not blamable in men of inferior rank, but matter for regret in superior men."
      },
      {
        "ref": "20:5",
        "zh": "初六童觀，小人道也。",
        "en": "'The looking of a lad shown by the first six, (divided); indicates the way of the inferior people."
      },
      {
        "ref": "20:6",
        "zh": "六二：闚觀，利女貞。",
        "en": "The second SIX, divided, shows one peeping out from a door. It would be advantageous if it were (merely) the firm correctness of a female."
      },
      {
        "ref": "20:7",
        "zh": "窺觀女貞，亦可醜也。",
        "en": "'The firm correctness of a woman, in peeping out from a door' is also a thing to be ashamed of (in a superior man)."
      },
      {
        "ref": "20:8",
        "zh": "六三：觀我生，進退。",
        "en": "The third SIX, divided, shows one looking at (the course of) his own life, to advance or recede (accordingly)."
      },
      {
        "ref": "20:9",
        "zh": "觀我生，進退；未失道也。",
        "en": "'He looks at (the course of his own life, to advance or recede (accordingly):' - he will not err in the path (to be pursued)."
      },
      {
        "ref": "20:10",
        "zh": "六四：觀國之光，利用賓于王。",
        "en": "The fourth SIX, divided, shows one contemplating the glory of the kingdom. It will be advantageous for him, being such as he is, (to seek) to be a guest of the king."
      },
      {
        "ref": "20:11",
        "zh": "觀國之光，尚賓也。",
        "en": "'He contemplates the glory of the kingdom:'(thence) arises the wish to be a guest (at court)."
      },
      {
        "ref": "20:12",
        "zh": "九五：觀我生，君子无咎。",
        "en": "The fifth NINE, undivided, shows its subject contemplating his own life(-course). A superior man, he will (thus) fall into no error."
      },
      {
        "ref": "20:13",
        "zh": "觀我生，觀民也。",
        "en": "'He contemplates his own life(-course):' - he should (for this purpose) contemplate (the condition of) the people."
      },
      {
        "ref": "20:14",
        "zh": "上九：觀其生，君子无咎。",
        "en": "The sixth NINE, undivided, shows its subject contemplating his character to see if it be indeed that of a superior man. He will not fall into error."
      },
      {
        "ref": "20:15",
        "zh": "觀其生，志未平也。",
        "en": "'He contemplates his own character:' - he cannot even yet let his mind be at rest."
      }
    ]
  }
}