{
  "id": "yijing",
  "title": "易經",
  "titleEn": "Book of Changes (I Ching)",
  "source": "Chinese Text Project (ctext.org) - James Legge translation",
  "chapter": {
    "number": "31",
    "title": "Xian",
    "slug": "xian",
    "passages": [
      {
        "ref": "31:1",
        "zh": "咸，亨，利貞，取女吉。",
        "en": "Xian indicates that, (on the fulfilment of the conditions implied in it), there will be free course and success. Its advantageousness will depend on the being firm and correct, (as) in marrying a young lady. There will be good fortune."
      },
      {
        "ref": "31:2",
        "zh": "咸，感也。",
        "en": "Xian is here used in the sense of Kan, meaning (mutually) influencing."
      },
      {
        "ref": "31:3",
        "zh": "柔上而剛下，二氣感應以相與，止而說，男下女，是以亨利貞，取女吉也。",
        "en": "The weak (trigram) above, and the strong one below; their two influences moving and responding to each other, and thereby forming a union; the repression (of the one) and the satisfaction (of the other); (with their relative position), where the male is placed below the female: - all these things convey the notion of 'a free and successful course (on the fulfilment of the conditions), while the advantage will depend on being firm and correct, as in marrying a young lady, and there will be good fortune.'"
      },
      {
        "ref": "31:4",
        "zh": "天地感而萬物化生，聖人感人心而天下和平，觀其所感，而天地萬物之情可見矣。",
        "en": "Heaven and earth exert their influences, and there ensue the transformation and production of all things. The sages influence the minds of men, and the result is harmony and peace all under the sky. If we look at (the method and issues) of those influences, the true character of heaven and earth and of all things can be seen."
      },
      {
        "ref": "31:5",
        "zh": "山上有澤，咸，君子以虛受人。",
        "en": "(The trigram representing) a mountain and above it that for (the waters of) a marsh form Xian. The superior man, in accordance with this, keeps his mind free from pre-occupation, and open to receive (the influences of) others."
      },
      {
        "ref": "31:6",
        "zh": "初六，咸其拇。",
        "en": "The first six, divided, shows one moving his great toes."
      },
      {
        "ref": "31:7",
        "zh": "咸其拇，志在外也。",
        "en": "'He moves his great toe:' - his mind is set on what is beyond (himself)."
      },
      {
        "ref": "31:8",
        "zh": "六二，咸其腓，凶，居吉。",
        "en": "The second SIX, divided, shows one moving the calves of his leg. There will be evil. If he abide (quiet in his place), there will be good fortune."
      },
      {
        "ref": "31:9",
        "zh": "雖凶居吉，順不害也。",
        "en": "Though 'there would be evil; yet, if he abide (quiet) in his place, there will be good fortune:' - through compliance (with the circumstances of his condition and place) there will be no injury."
      },
      {
        "ref": "31:10",
        "zh": "九三，咸其股，執其隨，往吝。",
        "en": "The third NINE, undivided, shows one moving his thighs, and keeping close hold of those whom he follows. Going forward (in this way) will cause regret."
      },
      {
        "ref": "31:11",
        "zh": "咸其股，亦不處也。",
        "en": "'He moves his thighs:' - he still does not (want to) rest in his place."
      },
      {
        "ref": "31:12",
        "zh": "志在隨人，所執下也。",
        "en": "His will is set on 'following others:' - what he holds in his grasp is low."
      },
      {
        "ref": "31:13",
        "zh": "九四，貞吉，悔亡，憧憧往來，朋從爾思。",
        "en": "The fourth NINE, undivided, shows that firm correctness which will lead to good fortune, and prevent all occasion for repentance. If its subject be unsettled in his movements, (only) his friends will follow his purpose."
      },
      {
        "ref": "31:14",
        "zh": "貞吉悔亡，未感害也。",
        "en": "'Firm correctness will lead to good fortune, and prevent all occasion for repentance:' - there has not yet been any harm from (a selfish wish to) influence."
      },
      {
        "ref": "31:15",
        "zh": "憧憧往來，未光大也。",
        "en": "'He is unsettled in his movements:' (his power to influence) is not yet either brilliant or great."
      },
      {
        "ref": "31:16",
        "zh": "九五，咸其脢，无悔。",
        "en": "The fifth NINE, undivided, shows one moving the flesh along the spine above the heart. There will be no occasion for repentance."
      },
      {
        "ref": "31:17",
        "zh": "咸其脢，志末也。",
        "en": "'He (tries to) move the flesh along the spine above the heart:' - his aim is trivial."
      },
      {
        "ref": "31:18",
        "zh": "上六，咸其輔頰舌。",
        "en": "The sixth six, divided, shows one moving his jaws and tongue."
      },
      {
        "ref": "31:19",
        "zh": "咸其輔頰舌，滕口說也。",
        "en": "'He moves his jaws and tongue:' - he (only) talks with loquacious mouth."
      }
    ]
  }
}
