{
  "id": "yijing",
  "title": "易經",
  "titleEn": "Book of Changes (I Ching)",
  "source": "Chinese Text Project (ctext.org) - James Legge translation",
  "chapter": {
    "number": "37",
    "title": "Jia Ren",
    "slug": "jia-ren",
    "passages": [
      {
        "ref": "37:1",
        "zh": "家人：利女貞。",
        "en": "For (the realisation of what is taught in) Jia Ren, (or for the regulation of the family), what is most advantageous is that the wife be firm and correct."
      },
      {
        "ref": "37:2",
        "zh": "家人，女正位乎內，男正位乎外，男女正，天地之大義也。",
        "en": "In Jia Ren the wife has her correct place in the inner (trigram), and the man his correct place in the outer. That man and woman occupy their correct places is the great righteousness shown (in the relation and positions of) heaven and earth."
      },
      {
        "ref": "37:3",
        "zh": "家人有嚴君焉，父母之謂也。",
        "en": "In Jia Ren we have the idea of an authoritative ruler; - that, namely, represented by the parental authority."
      },
      {
        "ref": "37:4",
        "zh": "父父，子子，兄兄，弟弟，夫夫，婦婦，而家道正；",
        "en": "Let the father be indeed father, and the son son; let the elder brother be indeed elder brother, and the younger brother younger brother, let the husband be indeed husband, and the wife wife: - then will the family be in its normal state."
      },
      {
        "ref": "37:5",
        "zh": "正家而天下定矣。",
        "en": "Bring the family to that state, and all under heaven will be established."
      },
      {
        "ref": "37:6",
        "zh": "風自火出，家人；",
        "en": "(The trigram representing) fire, and that for wind coming forth from it, form Jia Ren."
      },
      {
        "ref": "37:7",
        "zh": "君子以言有物，而行有恆。",
        "en": "The superior man, in accordance with this, orders his words according to (the truth of) things, and his conduct so that it is uniformly consistent."
      },
      {
        "ref": "37:8",
        "zh": "初九：閑有家，悔亡。",
        "en": "The first NINE, undivided, shows its subject establishing restrictive regulations in his household. Occasion for repentance will disappear."
      },
      {
        "ref": "37:9",
        "zh": "閑有家，志未變也。",
        "en": "'He establishes restrictive regulations in his household:' - (he does so), before any change has taken place in their wills."
      },
      {
        "ref": "37:10",
        "zh": "六二：无攸遂，在中饋，貞吉。",
        "en": "The second SIX, divided, shows its subject taking nothing on herself, but in her central place attending to the preparation of the food. Through her firm correctness there will be good fortune."
      },
      {
        "ref": "37:11",
        "zh": "六二之吉，順以巽也。",
        "en": "'The good fortune attached to the second six, (divided),' is due to the docility (of its subject), operating with humility."
      },
      {
        "ref": "37:12",
        "zh": "九三：家人嗃嗃，悔厲吉；",
        "en": "The third NINE, undivided, shows its subject (treating) the members of the household with stern severity. There will be occasion for repentance, there will be peril, (but) there will (also) be good fortune."
      },
      {
        "ref": "37:13",
        "zh": "婦子嘻嘻，終吝。",
        "en": "If the wife and children were to be smirking and chattering, in the end there would be occasion for regret."
      },
      {
        "ref": "37:14",
        "zh": "家人嗃嗃，未失也；",
        "en": "When 'the members of the household are treated with stern severity,' there has been no (great) failure (in the regulation of the family)."
      },
      {
        "ref": "37:15",
        "zh": "婦子嘻嘻，失家節也。",
        "en": "When 'wife and children are smirking and chattering,' the (proper) economy of the family has been lost."
      },
      {
        "ref": "37:16",
        "zh": "六四：富家，大吉。",
        "en": "The fourth SIX, divided, shows its subject enriching the family. There will be great good fortune."
      },
      {
        "ref": "37:17",
        "zh": "富家大吉，順在位也。",
        "en": "'The family is enriched, and there is great good fortune:' - this is due to the docility (belonging to the subject of the line), and its being in its correct place."
      },
      {
        "ref": "37:18",
        "zh": "九五：王假有家，勿恤，往吉。",
        "en": "The fifth NINE, undivided, shows the influence of the king extending to his family. There need be no anxiety; there will be good fortune."
      },
      {
        "ref": "37:19",
        "zh": "王假有家，交相愛也。",
        "en": "'The influence of the king extends to his family:' - the intercourse between them is that of mutual love."
      },
      {
        "ref": "37:20",
        "zh": "上九：有孚威如，終吉。",
        "en": "The topmost NINE, undivided, shows its subject possessed of sincerity and arrayed in majesty. In the end there will be good fortune."
      },
      {
        "ref": "37:21",
        "zh": "威如之吉，反身之謂也。",
        "en": "'The good fortune connected with the display of majesty' describes (the result of) the recovery of the true character."
      }
    ]
  }
}
