{
  "id": "yijing",
  "title": "易經",
  "titleEn": "Book of Changes (I Ching)",
  "source": "Chinese Text Project (ctext.org) - James Legge translation",
  "chapter": {
    "number": "11",
    "title": "Tai",
    "slug": "tai",
    "passages": [
      {
        "ref": "11:1",
        "zh": "泰：小往大來，吉亨。",
        "en": "In Tai (we see) the little gone and the great come. (It indicates that) there will be good fortune, with progress and success."
      },
      {
        "ref": "11:2",
        "zh": "泰，小往大來，吉亨。則是天地交，而萬物通也；上下交，而其志同也。",
        "en": "'The little come and the great gone in Tai, and its indication that there will be good fortune with progress and success' show to us heaven and earth in communication with each other, and all things in consequence having free course, and (also) the high and the low, (superiors and inferiors), in communication with one another, and possessed by the same aim."
      },
      {
        "ref": "11:3",
        "zh": "內陽而外陰，內健而外順，內君子而外小人，君子道長，小人道消也。",
        "en": "The inner (trigram) is made up of the strong and undivided lines, and the outer of the weak and divided; the inner is (the symbol of) strength, and the outer of docility; the inner (represents) the superior man, and the outer the small man. (Thus) the way of the superior man appears increasing, and that of the small man decreasing."
      },
      {
        "ref": "11:4",
        "zh": "天地交泰，后以財成天地之道，輔相天地之宜，以左右民。",
        "en": "(The trigrams for) heaven and earth in communication together form Tai. The (sage) sovereign, in harmony with this, fashions and completes (his regulations) after the courses of heaven and earth, and assists the application of the adaptations furnished by them, - in order to benefit the people."
      },
      {
        "ref": "11:5",
        "zh": "初九：拔茅茹，以其彙，征吉。",
        "en": "The first NINE, undivided, suggests the idea of grass pulled up, and bringing with it other stalks with whose roots it is connected. Advance (on the part of its subject) will be fortunate."
      },
      {
        "ref": "11:6",
        "zh": "拔茅征吉，志在外也。",
        "en": "'The good fortune of advance, (as suggested by the emblem of) the grass pulled up,' arises from the will (of the party intended) being set on what is external to himself."
      },
      {
        "ref": "11:7",
        "zh": "九二：包荒，用馮河，不遐遺，朋亡，得尚于中行。",
        "en": "The second NINE, undivided, shows one who can bear with the uncultivated, will cross the He without a boat, does not forget the distant, and has no (selfish) friendships. Thus does he prove himself acting in accordance with the course of the due Mean."
      },
      {
        "ref": "11:8",
        "zh": "包荒，得尚于中行，以光大也。",
        "en": "'He bears with the uncultivated, and proves himself acting in accordance with the due mean:' - for (his intelligence is) bright and (his capacity is) great."
      },
      {
        "ref": "11:9",
        "zh": "九三：无平不陂，无往不復，艱貞无咎。",
        "en": "The third NINE, undivided, shows that, while there is no state of peace that is not liable to be disturbed, and no departure (of evil men) so that they shall not return, yet when one is firm and correct, as he realises the distresses that may arise, he will commit no error."
      },
      {
        "ref": "11:10",
        "zh": "勿恤其孚，于食有福。",
        "en": "There is no occasion for sadness at the certainty (of such recurring changes); and in this mood the happiness (of the present) may be (long) enjoyed."
      },
      {
        "ref": "11:11",
        "zh": "无往不復，天地際也。",
        "en": "'There is no going away so that there shall not be a return' refers to this as the point where the interaction of heaven and earth takes place."
      },
      {
        "ref": "11:12",
        "zh": "六四：翩翩，不富，以其鄰，不戒以孚。",
        "en": "The fourth SIX, divided, shows its subject fluttering (down) - not relying on his own rich resources, but calling in his neighbours. (They all come) not as having received warning, but in the sincerity (of their hearts)."
      },
      {
        "ref": "11:13",
        "zh": "翩翩不富，皆失實也。",
        "en": "'He comes fluttering (down), not relying on his own rich resources:' - both he and his neighbours are out of their real (place where they are)."
      },
      {
        "ref": "11:14",
        "zh": "不戒以孚，中心願也。",
        "en": "'They have not received warning, but (come) in the sincerity (of their hearts):' - this is what they have desired in the core of their hearts."
      },
      {
        "ref": "11:15",
        "zh": "六五：帝乙歸妹，以祉元吉。",
        "en": "The fifth six, divided, reminds us of (king) Di-yi's (rule about the) marriage of his younger sister. By such a course there is happiness and there will be great good fortune."
      },
      {
        "ref": "11:16",
        "zh": "以祉元吉，中以行愿也。",
        "en": "'By such a course there is happiness, and there will be great good fortune:' - (the subject of the line) employs the virtue proper to his central position to carry his wishes into effect."
      },
      {
        "ref": "11:17",
        "zh": "上六：城復于隍，勿用師。",
        "en": "The sixth six, divided, shows us the city wall returned into the moat. It is not the time to use the army."
      },
      {
        "ref": "11:18",
        "zh": "自邑告命，貞吝。",
        "en": "(The subject of the line) may, indeed, announce his orders to the people of his own city; but however correct and firm he may be, he will have cause for regret."
      },
      {
        "ref": "11:19",
        "zh": "城復于隍，其命亂也。",
        "en": "'The city wall returned back into the moat' shows how the (governmental) orders have (long) been in disorder."
      }
    ]
  }
}
