{
  "id": "yijing",
  "title": "易經",
  "titleEn": "Book of Changes (I Ching)",
  "source": "Chinese Text Project (ctext.org) - James Legge translation",
  "chapter": {
    "number": "54",
    "title": "Gui Mei",
    "slug": "gui-mei",
    "passages": [
      {
        "ref": "54:1",
        "zh": "歸妹：征凶，无攸利。",
        "en": "Gui Mei indicates that (under the conditions which it denotes) action will be evil, and in no wise advantageous."
      },
      {
        "ref": "54:2",
        "zh": "歸妹，天地之大義也。",
        "en": "By Gui Mei (the marrying away of a younger sister) the great and righteous relation between heaven and earth (is suggested to us)."
      },
      {
        "ref": "54:3",
        "zh": "天地不交，而萬物不興，歸妹人之終始也。",
        "en": "If heaven and earth were to have no intercommunication, things would not grow and flourish as they do. The marriage of a younger sister is the end (of her maidenhood) and the beginning (of her motherhood)."
      },
      {
        "ref": "54:4",
        "zh": "說以動，所歸妹也。",
        "en": "We have (in the hexagram the desire of) pleasure and, on the ground of that, movement following. The marrying away is of a younger sister."
      },
      {
        "ref": "54:5",
        "zh": "征凶，位不當也。",
        "en": "'Any action will be evil:' - the places (of the lines) are not those appropriate to them."
      },
      {
        "ref": "54:6",
        "zh": "无攸利，柔乘剛也。",
        "en": "'It will be in no wise advantageous:' - the weak (third and fifth lines) are mounted on strong lines."
      },
      {
        "ref": "54:7",
        "zh": "澤上有雷，歸妹；",
        "en": "(The trigram representing the waters of) a marsh and over it that for thunder form Gui Mei."
      },
      {
        "ref": "54:8",
        "zh": "君子以永終知敝。",
        "en": "The superior man, in accordance with this, having regard to the far-distant end, knows the mischief (that may be done at the beginning)."
      },
      {
        "ref": "54:9",
        "zh": "初九：歸妹以娣，跛能履，征吉。",
        "en": "The first NINE, undivided, shows the younger sister married off in a position ancillary to the real wife. (It suggests the idea of) a person lame on one leg who yet manages to tramp along. Going forward will be fortunate."
      },
      {
        "ref": "54:10",
        "zh": "歸妹以娣，以恆也。",
        "en": "'The younger sister is married off in a position ancillary to that of the real wife:' - it is the constant practice (for such a case)."
      },
      {
        "ref": "54:11",
        "zh": "跛能履吉，相承也。",
        "en": "'Lame on one leg, she is able to tramp along:' - she can render helpful service."
      },
      {
        "ref": "54:12",
        "zh": "九二：眇能視，利幽人之貞。",
        "en": "The second NINE, undivided, shows her blind of one eye, and yet able to see. There will be advantage in her maintaining the firm correctness of a solitary widow."
      },
      {
        "ref": "54:13",
        "zh": "利幽人之貞，未變常也。",
        "en": "'There will be advantage in maintaining the firm correctness of a solitary widow:' - (the subject of the line) has not changed from the constancy (proper to a wife)."
      },
      {
        "ref": "54:14",
        "zh": "六三：歸妹以須，反歸以娣。",
        "en": "The third SIX, divided, shows the younger sister who was to be married off in a mean position. She returns and accepts an ancillary position."
      },
      {
        "ref": "54:15",
        "zh": "歸妹以須，未當也。",
        "en": "'The younger sister who was to be married off is in a mean position:' - this is shown by the improprieties (indicated in the line)."
      },
      {
        "ref": "54:16",
        "zh": "九四：歸妹愆期，遲歸有時。",
        "en": "The fourth NINE, undivided, shows the younger sister who is to be married off protracting the time. She may be late in being married, but the time will come."
      },
      {
        "ref": "54:17",
        "zh": "愆期之志，有待而行也。",
        "en": "(The purpose in) 'protracting the time' is that, after waiting, the thing may be done (all the better)."
      },
      {
        "ref": "54:18",
        "zh": "六五：帝乙歸妹，其君之袂，不如其娣之袂良，月幾望，吉。",
        "en": "The fifth SIX, divided, reminds us of the marrying of the younger sister of (king) Di-yi, when the sleeves of her the princess were not equal to those of the (still) younger sister who accompanied her in an inferior capacity. (The case suggests the thought of) the moon almost full. There will be good fortune."
      },
      {
        "ref": "54:19",
        "zh": "帝乙歸妹，不如其娣之袂良也。",
        "en": "'The sleeves of the younger sister of (king) Di-yi, when she was married away, were not equal to those of her (half-)sister, who accompanied her:' - such was her noble character, indicated by the central position of the line."
      },
      {
        "ref": "54:20",
        "zh": "其位在中，以貴行也。",
        "en": "Her position is in the center, showing how nobility guides her conduct."
      },
      {
        "ref": "54:21",
        "zh": "上六：女承筐无實，士刲羊无血，无攸利。",
        "en": "The sixth SIX, divided, shows the young lady bearing the basket, but without anything in it, and the gentleman slaughtering the sheep, but without blood flowing from it. There will be no advantage in any way."
      },
      {
        "ref": "54:22",
        "zh": "上六无實，承虛筐也。",
        "en": "'(What is said in) the sixth SIX, (divided),about there being nothing in the basket' shows that the subject of it is carrying an empty basket."
      }
    ]
  }
}
