{
  "id": "analects",
  "title": "論語",
  "titleEn": "Analects",
  "source": "Chinese Text Project (ctext.org) - James Legge translation",
  "chapters": [
    {
      "number": "1",
      "title": "Xue Er",
      "slug": "xue-er",
      "passages": [
        {
          "ref": "1:1",
          "zh": "子曰：「學而時習之，不亦說乎？",
          "en": "The Master said, \"Is it not pleasant to learn with a constant perseverance and application?"
        },
        {
          "ref": "1:2",
          "zh": "有朋自遠方來，不亦樂乎？",
          "en": "Is it not delightful to have friends coming from distant quarters?"
        },
        {
          "ref": "1:3",
          "zh": "人不知而不慍，不亦君子乎？」",
          "en": "Is he not a man of complete virtue, who feels no discomposure though men may take no note of him?\""
        },
        {
          "ref": "1:4",
          "zh": "有子曰：「其為人也孝弟，而好犯上者，鮮矣；",
          "en": "The philosopher You said, \"They are few who, being filial and fraternal, are fond of offending against their superiors."
        },
        {
          "ref": "1:5",
          "zh": "不好犯上，而好作亂者，未之有也。",
          "en": "There have been none, who, not liking to offend against their superiors, have been fond of stirring up confusion."
        },
        {
          "ref": "1:6",
          "zh": "君子務本，本立而道生。",
          "en": "The superior man bends his attention to what is radical. That being established, all practical courses naturally grow up."
        },
        {
          "ref": "1:7",
          "zh": "孝弟也者，其為仁之本與！」",
          "en": "Filial piety and fraternal submission! - are they not the root of all benevolent actions?\""
        },
        {
          "ref": "1:8",
          "zh": "子曰：「巧言令色，鮮矣仁！」",
          "en": "The Master said, \"Fine words and an insinuating appearance are seldom associated with true virtue.\""
        },
        {
          "ref": "1:9",
          "zh": "曾子曰：「吾日三省吾身：為人謀而不忠乎？",
          "en": "The philosopher Zeng said, \"I daily examine myself on three points: whether, in transacting business for others, I may have been not faithful;"
        },
        {
          "ref": "1:10",
          "zh": "與朋友交而不信乎？",
          "en": "whether, in intercourse with friends, I may have been not sincere;"
        },
        {
          "ref": "1:11",
          "zh": "傳不習乎？」",
          "en": "whether I may have not mastered and practiced the instructions of my teacher.\""
        },
        {
          "ref": "1:12",
          "zh": "子曰：「道千乘之國：敬事而信，節用而愛人，使民以時。」",
          "en": "The Master said, \"To rule a country of a thousand chariots, there must be reverent attention to business, and sincerity; economy in expenditure, and love for men; and the employment of the people at the proper seasons.\""
        },
        {
          "ref": "1:13",
          "zh": "子曰：「弟子入則孝，出則弟，謹而信，汎愛眾，而親仁。",
          "en": "The Master said, \"A youth, when at home, should be filial, and, abroad, respectful to his elders. He should be earnest and truthful. He should overflow in love to all, and cultivate the friendship of the good."
        },
        {
          "ref": "1:14",
          "zh": "行有餘力，則以學文。」",
          "en": "When he has time and opportunity, after the performance of these things, he should employ them in polite studies.\""
        },
        {
          "ref": "1:15",
          "zh": "子夏曰：「賢賢易色，事父母能竭其力，事君能致其身，與朋友交言而有信。",
          "en": "Zi Xia said, \"If a man withdraws his mind from the love of beauty, and applies it as sincerely to the love of the virtuous; if, in serving his parents, he can exert his utmost strength; if, in serving his prince, he can devote his life; if, in his intercourse with his friends, his words are sincere -"
        },
        {
          "ref": "1:16",
          "zh": "雖曰未學，吾必謂之學矣。」",
          "en": "although men say that he has not learned, I will certainly say that he has.\""
        },
        {
          "ref": "1:17",
          "zh": "子曰：「君子不重則不威，學則不固。",
          "en": "The Master said, \"If the scholar be not grave, he will not call forth any veneration, and his learning will not be solid."
        },
        {
          "ref": "1:18",
          "zh": "主忠信，無友不如己者，過則勿憚改。」",
          "en": "Hold faithfulness and sincerity as first principles. Have no friends not equal to yourself. When you have faults, do not fear to abandon them.\""
        },
        {
          "ref": "1:19",
          "zh": "曾子曰：「慎終追遠，民德歸厚矣。」",
          "en": "The philosopher Zeng said, \"Let there be a careful attention to perform the funeral rites to parents, and let them be followed when long gone with the ceremonies of sacrifice - then the virtue of the people will resume its proper excellence.\""
        },
        {
          "ref": "1:20",
          "zh": "子禽問於子貢曰：「夫子至於是邦也，必聞其政，求之與？抑與之與？」",
          "en": "Zi Qin asked Zi Gong, saying, \"When our master comes to any country, he does not fail to learn all about its government. Does he ask his information? or is it given to him?\""
        },
        {
          "ref": "1:21",
          "zh": "子貢曰：「夫子溫、良、恭、儉、讓以得之。夫子之求之也，其諸異乎人之求之與？」",
          "en": "Zi Gong said, \"Our master is benign, upright, courteous, temperate, and complaisant and thus he gets his information. The master's mode of asking information! - is it not different from that of other men?\""
        },
        {
          "ref": "1:22",
          "zh": "子曰：「父在，觀其志；",
          "en": "The Master said, \"While a man's father is alive, look at the bent of his will;"
        },
        {
          "ref": "1:23",
          "zh": "父沒，觀其行；",
          "en": "when his father is dead, look at his conduct."
        },
        {
          "ref": "1:24",
          "zh": "三年無改於父之道，可謂孝矣。」",
          "en": "If for three years he does not alter from the way of his father, he may be called filial.\""
        },
        {
          "ref": "1:25",
          "zh": "有子曰：「禮之用，和為貴。",
          "en": "The philosopher You said, \"In practicing the rules of propriety, a natural ease is to be prized."
        },
        {
          "ref": "1:26",
          "zh": "先王之道斯為美，小大由之。",
          "en": "In the ways prescribed by the ancient kings, this is the excellent quality, and in things small and great we follow them."
        },
        {
          "ref": "1:27",
          "zh": "有所不行，知和而和，不以禮節之，亦不可行也。」",
          "en": "Yet it is not to be observed in all cases. If one, knowing how such ease should be prized, manifests it, without regulating it by the rules of propriety, this likewise is not to be done.\""
        },
        {
          "ref": "1:28",
          "zh": "有子曰：「信近於義，言可復也；",
          "en": "The philosopher You said, \"When agreements are made according to what is right, what is spoken can be made good."
        },
        {
          "ref": "1:29",
          "zh": "恭近於禮，遠恥辱也；",
          "en": "When respect is shown according to what is proper, one keeps far from shame and disgrace."
        },
        {
          "ref": "1:30",
          "zh": "因不失其親，亦可宗也。」",
          "en": "When the parties upon whom a man leans are proper persons to be intimate with, he can make them his guides and masters.\""
        },
        {
          "ref": "1:31",
          "zh": "子曰：「君子食無求飽，居無求安，敏於事而慎於言，就有道而正焉，可謂好學也已。」",
          "en": "The Master said, \"He who aims to be a man of complete virtue in his food does not seek to gratify his appetite, nor in his dwelling place does he seek the appliances of ease; he is earnest in what he is doing, and careful in his speech; he frequents the company of men of principle that he may be rectified - such a person may be said indeed to love to learn.\""
        },
        {
          "ref": "1:32",
          "zh": "子貢曰：「貧而無諂，富而無驕，何如？」",
          "en": "Zi Gong said, \"What do you pronounce concerning the poor man who yet does not flatter, and the rich man who is not proud?\""
        },
        {
          "ref": "1:33",
          "zh": "子曰：「可也。未若貧而樂，富而好禮者也。」",
          "en": "The Master replied, \"They will do; but they are not equal to him, who, though poor, is yet cheerful, and to him, who, though rich, loves the rules of propriety.\""
        },
        {
          "ref": "1:34",
          "zh": "子貢曰：「《詩》云：『如切如磋，如琢如磨。』其斯之謂與？」",
          "en": "Zi Gong replied, \"It is said in the Book of Poetry, 'As you cut and then file, as you carve and then polish.' - The meaning is the same, I apprehend, as that which you have just expressed.\""
        },
        {
          "ref": "1:35",
          "zh": "子曰：「賜也，始可與言詩已矣！告諸往而知來者。」",
          "en": "The Master said, \"With one like Ci, I can begin to talk about the odes. I told him one point, and he knew its proper sequence.\""
        },
        {
          "ref": "1:36",
          "zh": "子曰：「不患人之不己知，患不知人也。」",
          "en": "The Master said, \"I will not be afflicted at men's not knowing me; I will be afflicted that I do not know men.\""
        }
      ]
    },
    {
      "number": "2",
      "title": "Wei Zheng",
      "slug": "wei-zheng",
      "passages": [
        {
          "ref": "2:1",
          "zh": "子曰：「為政以德，譬如北辰，居其所而眾星共之。」",
          "en": "The Master said, \"He who exercises government by means of his virtue may be compared to the north polar star, which keeps its place and all the stars turn towards it.\""
        },
        {
          "ref": "2:2",
          "zh": "子曰：「詩三百，一言以蔽之，曰『思無邪』。」",
          "en": "The Master said, \"In the Book of Poetry are three hundred pieces, but the design of them all may be embraced in one sentence - 'Having no depraved thoughts.'\""
        },
        {
          "ref": "2:3",
          "zh": "子曰：「道之以政，齊之以刑，民免而無恥；",
          "en": "The Master said, \"If the people be led by laws, and uniformity sought to be given them by punishments, they will try to avoid the punishment, but have no sense of shame."
        },
        {
          "ref": "2:4",
          "zh": "道之以德，齊之以禮，有恥且格。」",
          "en": "If they be led by virtue, and uniformity sought to be given them by the rules of propriety, they will have the sense of shame, and moreover will become good.\""
        },
        {
          "ref": "2:5",
          "zh": "子曰：「吾十有五而志于學，三十而立，四十而不惑，五十而知天命，六十而耳順，七十而從心所欲，不踰矩。」",
          "en": "The Master said, \"At fifteen, I had my mind bent on learning. At thirty, I stood firm. At forty, I had no doubts. At fifty, I knew the decrees of Heaven. At sixty, my ear was an obedient organ for the reception of truth. At seventy, I could follow what my heart desired, without transgressing what was right.\""
        },
        {
          "ref": "2:6",
          "zh": "孟懿子問孝。子曰：「無違。」",
          "en": "Meng Yi asked what filial piety was. The Master said, \"It is not being disobedient.\""
        },
        {
          "ref": "2:7",
          "zh": "樊遲御，子告之曰：「孟孫問孝於我，我對曰『無違』。」",
          "en": "Soon after, as Fan Chi was driving him, the Master told him, saying, \"Meng-sun asked me what filial piety was, and I answered him, - 'not being disobedient.'\""
        },
        {
          "ref": "2:8",
          "zh": "樊遲曰：「何謂也？」",
          "en": "Fan Chi said, \"What did you mean?\""
        },
        {
          "ref": "2:9",
          "zh": "子曰：「生事之以禮；死葬之以禮，祭之以禮。」",
          "en": "The Master replied, \"That parents, when alive, be served according to propriety; that, when dead, they should be buried according to propriety; and that they should be sacrificed to according to propriety.\""
        },
        {
          "ref": "2:10",
          "zh": "孟武伯問孝。子曰：「父母唯其疾之憂。」",
          "en": "Meng Wu asked what filial piety was. The Master said, \"Parents are anxious lest their children should be sick.\""
        },
        {
          "ref": "2:11",
          "zh": "子游問孝。子曰：「今之孝者，是謂能養。",
          "en": "Zi You asked what filial piety was. The Master said, \"The filial piety nowadays means the support of one's parents."
        },
        {
          "ref": "2:12",
          "zh": "至於犬馬，皆能有養；",
          "en": "But dogs and horses likewise are able to do something in the way of support;"
        },
        {
          "ref": "2:13",
          "zh": "不敬，何以別乎？」",
          "en": "without reverence, what is there to distinguish the one support given from the other?\""
        },
        {
          "ref": "2:14",
          "zh": "子夏問孝。子曰：「色難。",
          "en": "Zi Xia asked what filial piety was. The Master said, \"The difficulty is with the countenance."
        },
        {
          "ref": "2:15",
          "zh": "有事弟子服其勞，有酒食先生饌，曾是以為孝乎？」",
          "en": "If, when their elders have any troublesome affairs, the young take the toil of them, and if, when the young have wine and food, they set them before their elders, is THIS to be considered filial piety?\""
        },
        {
          "ref": "2:16",
          "zh": "子曰：「吾與回言終日，不違如愚。",
          "en": "The Master said, \"I have talked with Hui for a whole day, and he has not made any objection to anything I said - as if he were stupid."
        },
        {
          "ref": "2:17",
          "zh": "退而省其私，亦足以發。",
          "en": "He has retired, and I have examined his conduct when away from me, and found him able to illustrate my teachings."
        },
        {
          "ref": "2:18",
          "zh": "回也，不愚。」",
          "en": "Hui! - He is not stupid.\""
        },
        {
          "ref": "2:19",
          "zh": "子曰：「視其所以，觀其所由，察其所安。",
          "en": "The Master said, \"See what a man does. Mark his motives. Examine in what things he rests."
        },
        {
          "ref": "2:20",
          "zh": "人焉廋哉？人焉廋哉？」",
          "en": "How can a man conceal his character? How can a man conceal his character?\""
        },
        {
          "ref": "2:21",
          "zh": "子曰：「溫故而知新，可以為師矣。」",
          "en": "The Master said, \"If a man keeps cherishing his old knowledge, so as continually to be acquiring new, he may be a teacher of others.\""
        },
        {
          "ref": "2:22",
          "zh": "子曰：「君子不器。」",
          "en": "The Master said, \"The accomplished scholar is not a utensil.\""
        },
        {
          "ref": "2:23",
          "zh": "子貢問君子。子曰：「先行其言，而後從之。」",
          "en": "Zi Gong asked what constituted the superior man. The Master said, \"He acts before he speaks, and afterwards speaks according to his actions.\""
        },
        {
          "ref": "2:24",
          "zh": "子曰：「君子周而不比，小人比而不周。」",
          "en": "The Master said, \"The superior man is catholic and not partisan. The mean man is partisan and not catholic.\""
        },
        {
          "ref": "2:25",
          "zh": "子曰：「學而不思則罔，思而不學則殆。」",
          "en": "The Master said, \"Learning without thought is labor lost; thought without learning is perilous.\""
        },
        {
          "ref": "2:26",
          "zh": "子曰：「攻乎異端，斯害也已！」",
          "en": "The Master said, \"The study of strange doctrines is injurious indeed!\""
        },
        {
          "ref": "2:27",
          "zh": "子曰：「由！誨女知之乎？",
          "en": "The Master said, \"You, shall I teach you what knowledge is?"
        },
        {
          "ref": "2:28",
          "zh": "知之為知之，不知為不知，是知也。」",
          "en": "When you know a thing, to hold that you know it; and when you do not know a thing, to allow that you do not know it - this is knowledge.\""
        },
        {
          "ref": "2:29",
          "zh": "子張學干祿。子曰：「多聞闕疑，慎言其餘，則寡尤；",
          "en": "Zi Zhang was learning with a view to official emolument. The Master said, \"Hear much and put aside the points of which you stand in doubt, while you speak cautiously at the same time of the others - then you will afford few occasions for blame."
        },
        {
          "ref": "2:30",
          "zh": "多見闕殆，慎行其餘，則寡悔。",
          "en": "See much and put aside the things which seem perilous, while you are cautious at the same time in carrying the others into practice - then you will have few occasions for repentance."
        },
        {
          "ref": "2:31",
          "zh": "言寡尤，行寡悔，祿在其中矣。」",
          "en": "When one gives few occasions for blame in his words, and few occasions for repentance in his conduct, he is in the way to get emolument.\""
        },
        {
          "ref": "2:32",
          "zh": "哀公問曰：「何為則民服？」",
          "en": "The Duke Ai asked, saying, \"What should be done in order to secure the submission of the people?\""
        },
        {
          "ref": "2:33",
          "zh": "孔子對曰：「舉直錯諸枉，則民服；舉枉錯諸直，則民不服。」",
          "en": "Confucius replied, \"Advance the upright and set aside the crooked, then the people will submit. Advance the crooked and set aside the upright, then the people will not submit.\""
        },
        {
          "ref": "2:34",
          "zh": "季康子問：「使民敬、忠以勸，如之何？」",
          "en": "Ji Kang asked how to cause the people to reverence their ruler, to be faithful to him, and to go on to nerve themselves to virtue."
        },
        {
          "ref": "2:35",
          "zh": "子曰：「臨之以莊則敬，孝慈則忠，舉善而教不能，則勸。」",
          "en": "The Master said, \"Let him preside over them with gravity; then they will reverence him. Let him be final and kind to all; then they will be faithful to him. Let him advance the good and teach the incompetent; then they will eagerly seek to be virtuous.\""
        },
        {
          "ref": "2:36",
          "zh": "或謂孔子曰：「子奚不為政？」",
          "en": "Some one addressed Confucius, saying, \"Sir, why are you not engaged in the government?\""
        },
        {
          "ref": "2:37",
          "zh": "子曰：「《書》云：『孝乎惟孝、友于兄弟，施於有政。』是亦為政，奚其為為政？」",
          "en": "The Master said, \"What does the Shu Jing say of filial piety? - 'You are filial, you discharge your brotherly duties. These qualities are displayed in government.' This then also constitutes the exercise of government. Why must there be THAT - making one be in the government?\""
        },
        {
          "ref": "2:38",
          "zh": "子曰：「人而無信，不知其可也。",
          "en": "The Master said, \"I do not know how a man without truthfulness is to get on."
        },
        {
          "ref": "2:39",
          "zh": "大車無輗，小車無軏，其何以行之哉？」",
          "en": "How can a large carriage be made to go without the crossbar for yoking the oxen to, or a small carriage without the arrangement for yoking the horses?\""
        },
        {
          "ref": "2:40",
          "zh": "子張問：「十世可知也？」",
          "en": "Zi Zhang asked whether the affairs of ten ages after could be known."
        },
        {
          "ref": "2:41",
          "zh": "子曰：「殷因於夏禮，所損益，可知也；",
          "en": "Confucius said, \"The Yin dynasty followed the regulations of the Xia; wherein it took from or added to them may be known."
        },
        {
          "ref": "2:42",
          "zh": "周因於殷禮，所損益，可知也；",
          "en": "The Zhou dynasty has followed the regulations of Yin; wherein it took from or added to them may be known."
        },
        {
          "ref": "2:43",
          "zh": "其或繼周者，雖百世可知也。」",
          "en": "Some other may follow the Zhou, but though it should be at the distance of a hundred ages, its affairs may be known.\""
        },
        {
          "ref": "2:44",
          "zh": "子曰：「非其鬼而祭之，諂也。",
          "en": "The Master said, \"For a man to sacrifice to a spirit which does not belong to him is flattery."
        },
        {
          "ref": "2:45",
          "zh": "見義不為，無勇也。」",
          "en": "To see what is right and not to do it is want of courage.\""
        }
      ]
    },
    {
      "number": "3",
      "title": "Ba Yi",
      "slug": "ba-yi",
      "passages": [
        {
          "ref": "3:1",
          "zh": "孔子謂季氏：「八佾舞於庭，是可忍也，孰不可忍也？」",
          "en": "Confucius said of the head of the Ji family, who had eight rows of pantomimes in his area, \"If he can bear to do this, what may he not bear to do?\""
        },
        {
          "ref": "3:2",
          "zh": "三家者以雍徹。",
          "en": "The three families used the Yong ode, while the vessels were being removed, at the conclusion of the sacrifice."
        },
        {
          "ref": "3:3",
          "zh": "子曰：「『相維辟公，天子穆穆』，奚取於三家之堂？」",
          "en": "The Master said, \"'Assisting are the princes; the son of heaven looks profound and grave' - what application can these words have in the hall of the three families?\""
        },
        {
          "ref": "3:4",
          "zh": "子曰：「人而不仁，如禮何？",
          "en": "The Master said, \"If a man be without the virtues proper to humanity, what has he to do with the rites of propriety?"
        },
        {
          "ref": "3:5",
          "zh": "人而不仁，如樂何？」",
          "en": "If a man be without the virtues proper to humanity, what has he to do with music?\""
        },
        {
          "ref": "3:6",
          "zh": "林放問禮之本。",
          "en": "Lin Fang asked what was the first thing to be attended to in ceremonies."
        },
        {
          "ref": "3:7",
          "zh": "子曰：「大哉問！",
          "en": "The Master said, \"A great question indeed!"
        },
        {
          "ref": "3:8",
          "zh": "禮，與其奢也，寧儉；",
          "en": "In festive ceremonies, it is better to be sparing than extravagant."
        },
        {
          "ref": "3:9",
          "zh": "喪，與其易也，寧戚。」",
          "en": "In the ceremonies of mourning, it is better that there be deep sorrow than a minute attention to observances.\""
        },
        {
          "ref": "3:10",
          "zh": "子曰：「夷狄之有君，不如諸夏之亡也。」",
          "en": "The Master said, \"The rude tribes of the east and north have their princes, and are not like the States of our great land which are without them.\""
        },
        {
          "ref": "3:11",
          "zh": "季氏旅於泰山。",
          "en": "The chief of the Ji family was about to sacrifice to the Tai mountain."
        },
        {
          "ref": "3:12",
          "zh": "子謂冉有曰：「女弗能救與？」",
          "en": "The Master said to Ran You, \"Can you not save him from this?\""
        },
        {
          "ref": "3:13",
          "zh": "對曰：「不能。」",
          "en": "He answered, \"I cannot.\""
        },
        {
          "ref": "3:14",
          "zh": "子曰：「嗚呼！曾謂泰山，不如林放乎？」",
          "en": "Confucius said, \"Alas! will you say that the Tai mountain is not so discerning as Lin Fang?\""
        },
        {
          "ref": "3:15",
          "zh": "子曰：「君子無所爭，必也射乎！",
          "en": "The Master said, \"The student of virtue has no contentions. If it be said he cannot avoid them, shall this be in archery?"
        },
        {
          "ref": "3:16",
          "zh": "揖讓而升，下而飲，其爭也君子。」",
          "en": "But he bows complaisantly to his competitors; thus he ascends the hall, descends, and exacts the forfeit of drinking. In his contention, he is still the Junzi.\""
        },
        {
          "ref": "3:17",
          "zh": "子夏問曰：「『巧笑倩兮，美目盼兮，素以為絢兮。』何謂也？」",
          "en": "Zi Xia asked, saying, \"What is the meaning of the passage - 'The pretty dimples of her artful smile! The well-defined black and white of her eye! The plain ground for the colors?'\""
        },
        {
          "ref": "3:18",
          "zh": "子曰：「繪事後素。」",
          "en": "The Master said, \"The business of laying on the colors follows (the preparation of) the plain ground.\""
        },
        {
          "ref": "3:19",
          "zh": "曰：「禮後乎？」",
          "en": "\"Ceremonies then are a subsequent thing?\""
        },
        {
          "ref": "3:20",
          "zh": "子曰：「起予者商也！始可與言詩已矣。」",
          "en": "The Master said, \"It is Shang who can bring out my meaning. Now I can begin to talk about the odes with him.\""
        },
        {
          "ref": "3:21",
          "zh": "子曰：「夏禮，吾能言之，杞不足徵也；",
          "en": "The Master said, \"I could describe the ceremonies of the Xia dynasty, but Qi cannot sufficiently attest my words."
        },
        {
          "ref": "3:22",
          "zh": "殷禮，吾能言之，宋不足徵也。",
          "en": "I could describe the ceremonies of the Yin dynasty, but Song cannot sufficiently attest my words."
        },
        {
          "ref": "3:23",
          "zh": "文獻不足故也，足則吾能徵之矣。」",
          "en": "(They cannot do so) because of the insufficiency of their records and wise men. If those were sufficient, I could adduce them in support of my words.\""
        },
        {
          "ref": "3:24",
          "zh": "子曰：「禘自既灌而往者，吾不欲觀之矣。」",
          "en": "The Master said, \"At the great sacrifice, after the pouring out of the libation, I have no wish to look on.\""
        },
        {
          "ref": "3:25",
          "zh": "或問禘之說。",
          "en": "Some one asked the meaning of the great sacrifice."
        },
        {
          "ref": "3:26",
          "zh": "子曰：「不知也。知其說者之於天下也，其如示諸斯乎！」指其掌。",
          "en": "The Master said, \"I do not know. He who knew its meaning would find it as easy to govern the kingdom as to look on this\" - pointing to his palm."
        },
        {
          "ref": "3:27",
          "zh": "祭如在，祭神如神在。",
          "en": "He sacrificed to the dead, as if they were present. He sacrificed to the spirits, as if the spirits were present."
        },
        {
          "ref": "3:28",
          "zh": "子曰：「吾不與祭，如不祭。」",
          "en": "The Master said, \"I consider my not being present at the sacrifice, as if I did not sacrifice.\""
        },
        {
          "ref": "3:29",
          "zh": "王孫賈問曰：「與其媚於奧，寧媚於竈，何謂也？」",
          "en": "Wang Sun Jia asked, saying, \"What is the meaning of the saying, 'It is better to pay court to the furnace than to the southwest corner?'\""
        },
        {
          "ref": "3:30",
          "zh": "子曰：「不然，獲罪於天，無所禱也。」",
          "en": "The Master said, \"Not so. He who offends against Heaven has none to whom he can pray.\""
        },
        {
          "ref": "3:31",
          "zh": "子曰：「周監於二代，郁郁乎文哉！吾從周。」",
          "en": "The Master said, \"Zhou had the advantage of viewing the two past dynasties. How complete and elegant are its regulations! I follow Zhou.\""
        },
        {
          "ref": "3:32",
          "zh": "子入大廟，每事問。",
          "en": "The Master, when he entered the grand temple, asked about everything."
        },
        {
          "ref": "3:33",
          "zh": "或曰：「孰謂鄹人之子知禮乎？入大廟，每事問。」",
          "en": "Some one said, \"Who say that the son of the man of Zou knows the rules of propriety! He has entered the grand temple and asks about everything.\""
        },
        {
          "ref": "3:34",
          "zh": "子聞之曰：「是禮也。」",
          "en": "The Master heard the remark, and said, \"This is a rule of propriety.\""
        },
        {
          "ref": "3:35",
          "zh": "子曰：「射不主皮，為力不同科，古之道也。」",
          "en": "The Master said, \"In archery it is not going through the leather which is the principal thing - because people's strength is not equal. This was the old way.\""
        },
        {
          "ref": "3:36",
          "zh": "子貢欲去告朔之餼羊。",
          "en": "Zi Gong wished to do away with the offering of a sheep connected with the inauguration of the first day of each month."
        },
        {
          "ref": "3:37",
          "zh": "子曰：「賜也，爾愛其羊，我愛其禮。」",
          "en": "The Master said, \"Ci, you love the sheep; I love the ceremony.\""
        },
        {
          "ref": "3:38",
          "zh": "子曰：「事君盡禮，人以為諂也。」",
          "en": "The Master said, \"The full observance of the rules of propriety in serving one's prince is accounted by people to be flattery.\""
        },
        {
          "ref": "3:39",
          "zh": "定公問：「君使臣，臣事君，如之何？」",
          "en": "The duke Ding asked how a prince should employ his ministers, and how ministers should serve their prince."
        },
        {
          "ref": "3:40",
          "zh": "孔子對曰：「君使臣以禮，臣事君以忠。」",
          "en": "Confucius replied, \"A prince should employ his minister according to according to the rules of propriety; ministers should serve their prince with faithfulness.\""
        },
        {
          "ref": "3:41",
          "zh": "子曰：「關雎，樂而不淫，哀而不傷。」",
          "en": "The Master said, \"The Guan Ju is expressive of enjoyment without being licentious, and of grief without being hurtfully excessive.\""
        },
        {
          "ref": "3:42",
          "zh": "哀公問社於宰我。",
          "en": "The duke Ai asked Zai Wo about the altars of the spirits of the land."
        },
        {
          "ref": "3:43",
          "zh": "宰我對曰：「夏后氏以松，殷人以柏，周人以栗，曰使民戰栗。」",
          "en": "Zai Wo replied, \"The Xia sovereign planted the pine tree about them; the men of the Yin planted the cypress; and the men of the Zhou planted the chestnut tree, meaning thereby to cause the people to be in awe.\""
        },
        {
          "ref": "3:44",
          "zh": "子聞之曰：「成事不說，遂事不諫，既往不咎。」",
          "en": "When the Master heard it, he said, \"Things that are done, it is needless to speak about; things that have had their course, it is needless to remonstrate about; things that are past, it is needless to blame.\""
        },
        {
          "ref": "3:45",
          "zh": "子曰：「管仲之器小哉！」",
          "en": "The Master said, \"Small indeed was the capacity of Guan Zhong!\""
        },
        {
          "ref": "3:46",
          "zh": "或曰：「管仲儉乎？」",
          "en": "Some one said, \"Was Guan Zhong parsimonious?\""
        },
        {
          "ref": "3:47",
          "zh": "曰：「管氏有三歸，官事不攝，焉得儉？」",
          "en": "\"Guan,\" was the reply, \"had the San Gui, and his officers performed no double duties; how can he be considered parsimonious?\""
        },
        {
          "ref": "3:48",
          "zh": "「然則管仲知禮乎？」",
          "en": "\"Then, did Guan Zhong know the rules of propriety?\""
        },
        {
          "ref": "3:49",
          "zh": "曰：「邦君樹塞門，管氏亦樹塞門；邦君為兩君之好，有反坫，管氏亦有反坫。管氏而知禮，孰不知禮？」",
          "en": "The Master said, \"The princes of States have a screen intercepting the view at their gates. Guan had likewise a screen at his gate. The princes of States on any friendly meeting between two of them, had a stand on which to place their inverted cups. Guan had also such a stand. If Guan knew the rules of propriety, who does not know them?\""
        },
        {
          "ref": "3:50",
          "zh": "子語魯大師樂。曰：「樂其可知也：始作，翕如也；從之，純如也，皦如也，繹如也，以成。」",
          "en": "The Master instructing the Grand music master of Lu said, \"How to play music may be known. At the commencement of the piece, all the parts should sound together. As it proceeds, they should be in harmony while severally distinct and flowing without break, and thus on to the conclusion.\""
        },
        {
          "ref": "3:51",
          "zh": "儀封人請見。曰：「君子之至於斯也，吾未嘗不得見也。」",
          "en": "The border warden at I requested to be introduced to the Master, saying, \"When men of superior virtue have come to this, I have never been denied the privilege of seeing them.\""
        },
        {
          "ref": "3:52",
          "zh": "從者見之。",
          "en": "The followers of the sage introduced him,"
        },
        {
          "ref": "3:53",
          "zh": "出曰：「二三子，何患於喪乎？天下之無道也久矣，天將以夫子為木鐸。」",
          "en": "and when he came out from the interview, he said, \"My friends, why are you distressed by your master's loss of office? The kingdom has long been without the principles of truth and right; Heaven is going to use your master as a bell with its wooden tongue.\""
        },
        {
          "ref": "3:54",
          "zh": "子謂韶，「盡美矣，又盡善也。」",
          "en": "The Master said of the Shao that it was perfectly beautiful and also perfectly good."
        },
        {
          "ref": "3:55",
          "zh": "謂武，「盡美矣，未盡善也」。",
          "en": "He said of the Wu that it was perfectly beautiful but not perfectly good."
        },
        {
          "ref": "3:56",
          "zh": "子曰：「居上不寬，為禮不敬，臨喪不哀，吾何以觀之哉？」",
          "en": "The Master said, \"High station filled without indulgent generosity; ceremonies performed without reverence; mourning conducted without sorrow - wherewith should I contemplate such ways?\""
        }
      ]
    },
    {
      "number": "4",
      "title": "Li Ren",
      "slug": "li-ren",
      "passages": [
        {
          "ref": "4:1",
          "zh": "子曰：「里仁為美。",
          "en": "The Master said, \"It is virtuous manners which constitute the excellence of a neighborhood."
        },
        {
          "ref": "4:2",
          "zh": "擇不處仁，焉得知？」",
          "en": "If a man in selecting a residence, do not fix on one where such prevail, how can he be wise?\""
        },
        {
          "ref": "4:3",
          "zh": "子曰：「不仁者不可以久處約，不可以長處樂。",
          "en": "The Master said, \"Those who are without virtue cannot abide long either in a condition of poverty and hardship, or in a condition of enjoyment."
        },
        {
          "ref": "4:4",
          "zh": "仁者安仁，知者利仁。」",
          "en": "The virtuous rest in virtue; the wise desire virtue.\""
        },
        {
          "ref": "4:5",
          "zh": "子曰：「唯仁者能好人，能惡人。」",
          "en": "The Master said, \"It is only the (truly) virtuous man, who can love, or who can hate, others.\""
        },
        {
          "ref": "4:6",
          "zh": "子曰：「苟志於仁矣，無惡也。」",
          "en": "The Master said, \"If the will be set on virtue, there will be no practice of wickedness.\""
        },
        {
          "ref": "4:7",
          "zh": "子曰：「富與貴是人之所欲也，不以其道得之，不處也；",
          "en": "The Master said, \"Riches and honors are what men desire. If it cannot be obtained in the proper way, they should not be held."
        },
        {
          "ref": "4:8",
          "zh": "貧與賤是人之所惡也，不以其道得之，不去也。",
          "en": "Poverty and meanness are what men dislike. If it cannot be avoided in the proper way, they should not be avoided."
        },
        {
          "ref": "4:9",
          "zh": "君子去仁，惡乎成名？",
          "en": "If a superior man abandon virtue, how can he fulfill the requirements of that name?"
        },
        {
          "ref": "4:10",
          "zh": "君子無終食之間違仁，造次必於是，顛沛必於是。」",
          "en": "The superior man does not, even for the space of a single meal, act contrary to virtue. In moments of haste, he cleaves to it. In seasons of danger, he cleaves to it.\""
        },
        {
          "ref": "4:11",
          "zh": "子曰：「我未見好仁者，惡不仁者。",
          "en": "The Master said, \"I have not seen a person who loved virtue, or one who hated what was not virtuous."
        },
        {
          "ref": "4:12",
          "zh": "好仁者，無以尚之；",
          "en": "He who loved virtue, would esteem nothing above it."
        },
        {
          "ref": "4:13",
          "zh": "惡不仁者，其為仁矣，不使不仁者加乎其身。",
          "en": "He who hated what is not virtuous, would practice virtue in such a way that he would not allow anything that is not virtuous to approach his person."
        },
        {
          "ref": "4:14",
          "zh": "有能一日用其力於仁矣乎？我未見力不足者。",
          "en": "Is any one able for one day to apply his strength to virtue? I have not seen the case in which his strength would be insufficient."
        },
        {
          "ref": "4:15",
          "zh": "蓋有之矣，我未之見也。」",
          "en": "Should there possibly be any such case, I have not seen it.\""
        },
        {
          "ref": "4:16",
          "zh": "子曰：「人之過也，各於其黨。",
          "en": "The Master said, \"The faults of men are characteristic of the class to which they belong."
        },
        {
          "ref": "4:17",
          "zh": "觀過，斯知仁矣。」",
          "en": "By observing a man's faults, it may be known that he is virtuous.\""
        },
        {
          "ref": "4:18",
          "zh": "子曰：「朝聞道，夕死可矣。」",
          "en": "The Master said, \"If a man in the morning hear the right way, he may die in the evening without regret.\""
        },
        {
          "ref": "4:19",
          "zh": "子曰：「士志於道，而恥惡衣惡食者，未足與議也。」",
          "en": "The Master said, \"A scholar, whose mind is set on truth, and who is ashamed of bad clothes and bad food, is not fit to be discoursed with.\""
        },
        {
          "ref": "4:20",
          "zh": "子曰：「君子之於天下也，無適也，無莫也，義之與比。」",
          "en": "The Master said, \"The superior man, in the world, does not set his mind either for anything, or against anything; what is right he will follow.\""
        },
        {
          "ref": "4:21",
          "zh": "子曰：「君子懷德，小人懷土；",
          "en": "The Master said, \"The superior man thinks of virtue; the small man thinks of comfort."
        },
        {
          "ref": "4:22",
          "zh": "君子懷刑，小人懷惠。」",
          "en": "The superior man thinks of the sanctions of law; the small man thinks of favors which he may receive.\""
        },
        {
          "ref": "4:23",
          "zh": "子曰：「放於利而行，多怨。」",
          "en": "The Master said: \"He who acts with a constant view to his own advantage will be much murmured against.\""
        },
        {
          "ref": "4:24",
          "zh": "子曰：「能以禮讓為國乎？何有？",
          "en": "The Master said, \"If a prince is able to govern his kingdom with the complaisance proper to the rules of propriety, what difficulty will he have?"
        },
        {
          "ref": "4:25",
          "zh": "不能以禮讓為國，如禮何？」",
          "en": "If he cannot govern it with that complaisance, what has he to do with the rules of propriety?\""
        },
        {
          "ref": "4:26",
          "zh": "子曰：「不患無位，患所以立；",
          "en": "The Master said, \"A man should say, I am not concerned that I have no place, I am concerned how I may fit myself for one."
        },
        {
          "ref": "4:27",
          "zh": "不患莫己知，求為可知也。」",
          "en": "I am not concerned that I am not known, I seek to be worthy to be known.\""
        },
        {
          "ref": "4:28",
          "zh": "子曰：「參乎！吾道一以貫之。」",
          "en": "The Master said, \"Shen, my doctrine is that of an all-pervading unity.\""
        },
        {
          "ref": "4:29",
          "zh": "曾子曰：「唯。」",
          "en": "The disciple Zeng replied, \"Yes.\""
        },
        {
          "ref": "4:30",
          "zh": "子出。門人問曰：「何謂也？」",
          "en": "The Master went out, and the other disciples asked, saying, \"What do his words mean?\""
        },
        {
          "ref": "4:31",
          "zh": "曾子曰：「夫子之道，忠恕而已矣。」",
          "en": "Zeng said, \"The doctrine of our master is to be true to the principles of our nature and the benevolent exercise of them to others, this and nothing more.\""
        },
        {
          "ref": "4:32",
          "zh": "子曰：「君子喻於義，小人喻於利。」",
          "en": "The Master said, \"The mind of the superior man is conversant with righteousness; the mind of the mean man is conversant with gain.\""
        },
        {
          "ref": "4:33",
          "zh": "子曰：「見賢思齊焉，見不賢而內自省也。」",
          "en": "The Master said, \"When we see men of worth, we should think of equaling them; when we see men of a contrary character, we should turn inwards and examine ourselves.\""
        },
        {
          "ref": "4:34",
          "zh": "子曰：「事父母幾諫。",
          "en": "The Master said, \"In serving his parents, a son may remonstrate with them, but gently;"
        },
        {
          "ref": "4:35",
          "zh": "見志不從，又敬不違，勞而不怨。」",
          "en": "when he sees that they do not incline to follow his advice, he shows an increased degree of reverence, but does not abandon his purpose; and should they punish him, he does not allow himself to murmur.\""
        },
        {
          "ref": "4:36",
          "zh": "子曰：「父母在，不遠遊。",
          "en": "The Master said, \"While his parents are alive, the son may not go abroad to a distance."
        },
        {
          "ref": "4:37",
          "zh": "遊必有方。」",
          "en": "If he does go abroad, he must have a fixed place to which he goes.\""
        },
        {
          "ref": "4:38",
          "zh": "子曰：「三年無改於父之道，可謂孝矣。」",
          "en": "The Master said, \"If the son for three years does not alter from the way of his father, he may be called filial.\""
        },
        {
          "ref": "4:39",
          "zh": "子曰：「父母之年，不可不知也。一則以喜，一則以懼。」",
          "en": "The Master said, \"The years of parents may by no means not be kept in the memory, as an occasion at once for joy and for fear.\""
        },
        {
          "ref": "4:40",
          "zh": "子曰：「古者言之不出，恥躬之不逮也。」",
          "en": "The Master said, \"The reason why the ancients did not readily give utterance to their words, was that they feared lest their actions should not come up to them.\""
        },
        {
          "ref": "4:41",
          "zh": "子曰：「以約失之者，鮮矣。」",
          "en": "The Master said, \"The cautious seldom err.\""
        },
        {
          "ref": "4:42",
          "zh": "子曰：「君子欲訥於言，而敏於行。」",
          "en": "The Master said, \"The superior man wishes to be slow in his speech and earnest in his conduct.\""
        },
        {
          "ref": "4:43",
          "zh": "子曰：「德不孤，必有鄰。」",
          "en": "The Master said, \"Virtue is not left to stand alone. He who practices it will have neighbors.\""
        },
        {
          "ref": "4:44",
          "zh": "子游曰：「事君數，斯辱矣，朋友數，斯疏矣。」",
          "en": "Zi You said, \"In serving a prince, frequent remonstrances lead to disgrace. Between friends, frequent reproofs make the friendship distant.\""
        }
      ]
    },
    {
      "number": "5",
      "title": "Gong Ye Chang",
      "slug": "gong-ye-chang",
      "passages": [
        {
          "ref": "5:1",
          "zh": "子謂公冶長，「可妻也。雖在縲絏之中，非其罪也」。",
          "en": "The Master said of Gong Ye Chang that he might be wived; although he was put in bonds, he had not been guilty of any crime."
        },
        {
          "ref": "5:2",
          "zh": "以其子妻之。",
          "en": "Accordingly, he gave him his own daughter to wife."
        },
        {
          "ref": "5:3",
          "zh": "子謂南容，「邦有道，不廢；邦無道，免於刑戮。」",
          "en": "The Master said of Nan Rong that if the country were well governed he would not be out of office, and if it were ill governed, he would escape punishment and disgrace."
        },
        {
          "ref": "5:4",
          "zh": "以其兄之子妻之。",
          "en": "He gave him the daughter of his own elder brother to wife."
        },
        {
          "ref": "5:5",
          "zh": "子謂子賤，「君子哉若人！",
          "en": "The Master said of Zi Jian, \"Of superior virtue indeed is such a man!"
        },
        {
          "ref": "5:6",
          "zh": "魯無君子者，斯焉取斯？」",
          "en": "If there were not virtuous men in Lu, how could this man have acquired this character?\""
        },
        {
          "ref": "5:7",
          "zh": "子貢問曰：「賜也何如？」",
          "en": "Zi Gong asked, \"What do you say of me, Ci!\""
        },
        {
          "ref": "5:8",
          "zh": "子曰：「女器也。」",
          "en": "The Master said, \"You are a utensil.\""
        },
        {
          "ref": "5:9",
          "zh": "曰：「何器也？」",
          "en": "\"What utensil?\""
        },
        {
          "ref": "5:10",
          "zh": "曰：「瑚璉也。」",
          "en": "\"A gemmed sacrificial utensil.\""
        },
        {
          "ref": "5:11",
          "zh": "或曰：「雍也，仁而不佞。」",
          "en": "Some one said, \"Yong is truly virtuous, but he is not ready with his tongue.\""
        },
        {
          "ref": "5:12",
          "zh": "子曰：「焉用佞？禦人以口給，屢憎於人。",
          "en": "The Master said, \"What is the good of being ready with the tongue? They who encounter men with smartness of speech for the most part procure themselves hatred."
        },
        {
          "ref": "5:13",
          "zh": "不知其仁，焉用佞？」",
          "en": "I know not whether he be truly virtuous, but why should he show readiness of the tongue?\""
        },
        {
          "ref": "5:14",
          "zh": "子使漆雕開仕。對曰：「吾斯之未能信。」子說。",
          "en": "The Master was wishing Qi Diao Kai to enter an official employment. He replied, \"I am not yet able to rest in the assurance of THIS.\" The Master was pleased."
        },
        {
          "ref": "5:15",
          "zh": "子曰：「道不行，乘桴浮于海。從我者其由與？」",
          "en": "The Master said, \"My doctrines make no way. I will get upon a raft, and float about on the sea. He that will accompany me will be You, I dare to say.\""
        },
        {
          "ref": "5:16",
          "zh": "子路聞之喜。",
          "en": "Zi Lu hearing this was glad,"
        },
        {
          "ref": "5:17",
          "zh": "子曰：「由也好勇過我，無所取材。」",
          "en": "upon which the Master said, \"You is fonder of daring than I am. He does not exercise his judgment upon matters.\""
        },
        {
          "ref": "5:18",
          "zh": "孟武伯問：「子路仁乎？」",
          "en": "Meng Wu asked about Zi Lu, whether he was perfectly virtuous."
        },
        {
          "ref": "5:19",
          "zh": "子曰：「不知也。」",
          "en": "The Master said, \"I do not know.\""
        },
        {
          "ref": "5:20",
          "zh": "又問。子曰：「由也，千乘之國，可使治其賦也，不知其仁也。」",
          "en": "He asked again, when the Master replied, \"You, in a kingdom of a thousand chariots, might be employed to manage the military levies, but I do not know whether he be perfectly virtuous.\""
        },
        {
          "ref": "5:21",
          "zh": "「求也何如？」子曰：「求也，千室之邑，百乘之家，可使為之宰也，不知其仁也。」",
          "en": "\"And what do you say of Qiu?\" The Master replied, \"Qiu, in a city of a thousand families, or a clan of a hundred chariots, might be employed as governor, but I do not know whether he is perfectly virtuous.\""
        },
        {
          "ref": "5:22",
          "zh": "「赤也何如？」子曰：「赤也，束帶立於朝，可使與賓客言也，不知其仁也。」",
          "en": "\"What do you say of Chi?\" The Master replied, \"Chi, with his sash girt and standing in a court, might be employed to converse with the visitors and guests, but I do not know whether he is perfectly virtuous.\""
        },
        {
          "ref": "5:23",
          "zh": "子謂子貢曰：「女與回也孰愈？」",
          "en": "The Master said to Zi Gong, \"Which do you consider superior, yourself or Hui?\""
        },
        {
          "ref": "5:24",
          "zh": "對曰：「賜也何敢望回。回也聞一以知十，賜也聞一以知二。」",
          "en": "Zi Gong replied, \"How dare I compare myself with Hui? Hui hears one point and knows all about a subject; I hear one point, and know a second.\""
        },
        {
          "ref": "5:25",
          "zh": "子曰：「弗如也！吾與女弗如也。」",
          "en": "The Master said, \"You are not equal to him. I grant you, you are not equal to him.\""
        },
        {
          "ref": "5:26",
          "zh": "宰予晝寢。",
          "en": "Zai Yu being asleep during the daytime,"
        },
        {
          "ref": "5:27",
          "zh": "子曰：「朽木不可雕也，糞土之牆不可杇也，於予與何誅。」",
          "en": "the Master said, \"Rotten wood cannot be carved; a wall of dirty earth will not receive the trowel. This Yu! - what is the use of my reproving him?\""
        },
        {
          "ref": "5:28",
          "zh": "子曰：「始吾於人也，聽其言而信其行；今吾於人也，聽其言而觀其行。於予與改是。」",
          "en": "The Master said, \"At first, my way with men was to hear their words, and give them credit for their conduct. Now my way is to hear their words, and look at their conduct. It is from Yu that I have learned to make this change.\""
        },
        {
          "ref": "5:29",
          "zh": "子曰：「吾未見剛者。」",
          "en": "The Master said, \"I have not seen a firm and unbending man.\""
        },
        {
          "ref": "5:30",
          "zh": "或對曰：「申棖。」",
          "en": "Some one replied, \"There is Shen Cheng.\""
        },
        {
          "ref": "5:31",
          "zh": "子曰：「棖也慾，焉得剛？」",
          "en": "\"Cheng,\" said the Master, \"is under the influence of his passions; how can he be pronounced firm and unbending?\""
        },
        {
          "ref": "5:32",
          "zh": "子貢曰：「我不欲人之加諸我也，吾亦欲無加諸人。」",
          "en": "Zi Gong said, \"What I do not wish men to do to me, I also wish not to do to men.\""
        },
        {
          "ref": "5:33",
          "zh": "子曰：「賜也，非爾所及也。」",
          "en": "The Master said, \"Ci, you have not attained to that.\""
        },
        {
          "ref": "5:34",
          "zh": "子貢曰：「夫子之文章，可得而聞也；",
          "en": "Zi Gong said, \"The Master's personal displays of his principles and ordinary descriptions of them may be heard."
        },
        {
          "ref": "5:35",
          "zh": "夫子之言性與天道，不可得而聞也。」",
          "en": "His discourses about man's nature, and the way of Heaven, cannot be heard.\""
        },
        {
          "ref": "5:36",
          "zh": "子路有聞，未之能行，唯恐有聞。",
          "en": "When Zi Lu heard anything, if he had not yet succeeded in carrying it into practice, he was only afraid lest he should hear something else."
        },
        {
          "ref": "5:37",
          "zh": "子貢問曰：「孔文子何以謂之文也？」",
          "en": "Zi Gong asked, saying, \"On what ground did Kong Wen get that title of Wen?\""
        },
        {
          "ref": "5:38",
          "zh": "子曰：「敏而好學，不恥下問，是以謂之文也。」",
          "en": "The Master said, \"He was of an active nature and yet fond of learning, and he was not ashamed to ask and learn of his inferiors! On these grounds he has been styled Wen.\""
        },
        {
          "ref": "5:39",
          "zh": "子謂子產，「有君子之道四焉：其行己也恭，其事上也敬，其養民也惠，其使民也義。」",
          "en": "The Master said of Zi Chan that he had four of the characteristics of a superior man - in his conduct of himself, he was humble; in serving his superior, he was respectful; in nourishing the people, he was kind; in ordering the people, he was just."
        },
        {
          "ref": "5:40",
          "zh": "子曰：「晏平仲善與人交，久而敬之。」",
          "en": "The Master said, \"Yan Ping knew well how to maintain friendly intercourse. The acquaintance might be long, but he showed the same respect as at first.\""
        },
        {
          "ref": "5:41",
          "zh": "子曰：「臧文仲居蔡，山節藻梲，何如其知也？」",
          "en": "The Master said, \"Zang Wen kept a large tortoise in a house, on the capitals of the pillars of which he had hills made, and with representations of duckweed on the small pillars above the beams supporting the rafters. Of what sort was his wisdom?\""
        },
        {
          "ref": "5:42",
          "zh": "子張問曰：「令尹子文三仕為令尹，無喜色；三已之，無慍色。舊令尹之政，必以告新令尹。何如？」",
          "en": "Zi Zhang asked, saying, \"The minister Zi Wen thrice took office, and manifested no joy in his countenance. Thrice he retired from office, and manifested no displeasure. He made it a point to inform the new minister of the way in which he had conducted the government - what do you say of him?\""
        },
        {
          "ref": "5:43",
          "zh": "子曰：「忠矣。」",
          "en": "The Master replied. \"He was loyal.\""
        },
        {
          "ref": "5:44",
          "zh": "曰：「仁矣乎？」",
          "en": "\"Was he perfectly virtuous?\""
        },
        {
          "ref": "5:45",
          "zh": "曰：「未知，焉得仁？」",
          "en": "\"I do not know. How can he be pronounced perfectly virtuous?\""
        },
        {
          "ref": "5:46",
          "zh": "「崔子弒齊君，陳文子有馬十乘，棄而違之。至於他邦，則曰：『猶吾大夫崔子也。』違之。之一邦，則又曰：『猶吾大夫崔子也。』違之。何如？」",
          "en": "Zi Zhang proceeded, \"When the officer Cui killed the prince of Qi, Chen Wen, though he was the owner of forty horses, abandoned them and left the country. Coming to another state, he said, 'They are here like our great officer, Cui,' and left it. He came to a second state, and again said 'They are here like our great officer, Cui,' and left it also - what do you say of him?\""
        },
        {
          "ref": "5:47",
          "zh": "子曰：「清矣。」",
          "en": "The Master replied, \"He was pure.\""
        },
        {
          "ref": "5:48",
          "zh": "曰：「仁矣乎？」",
          "en": "\"Was he perfectly virtuous?\""
        },
        {
          "ref": "5:49",
          "zh": "曰：「未知。焉得仁？」",
          "en": "\"I do not know. How can he be pronounced perfectly virtuous?\""
        },
        {
          "ref": "5:50",
          "zh": "季文子三思而後行。",
          "en": "Ji Wen thought thrice, and then acted."
        },
        {
          "ref": "5:51",
          "zh": "子聞之，曰：「再，斯可矣。」",
          "en": "When the Master was informed of it, he said, \"Twice may do.\""
        },
        {
          "ref": "5:52",
          "zh": "子曰：「甯武子邦有道則知，邦無道則愚。",
          "en": "The Master said, \"When good order prevailed in his country, Ning Wu acted the part of a wise man. When his country was in disorder, he acted the part of a stupid man."
        },
        {
          "ref": "5:53",
          "zh": "其知可及也，其愚不可及也。」",
          "en": "Others may equal his wisdom, but they cannot equal his stupidity.\""
        },
        {
          "ref": "5:54",
          "zh": "子在陳曰：「歸與！歸與！吾黨之小子狂簡，斐然成章，不知所以裁之。」",
          "en": "When the Master was in Chen, he said, \"Let me return! Let me return! The little children of my school are ambitious and too hasty. They are accomplished and complete so far, but they do not know how to restrict and shape themselves.\""
        },
        {
          "ref": "5:55",
          "zh": "子曰：「伯夷、叔齊不念舊惡，怨是用希。」",
          "en": "The Master said, \"Bo Yi and Shu Qi did not keep the former wickednesses of men in mind, and hence the resentments directed towards them were few.\""
        },
        {
          "ref": "5:56",
          "zh": "子曰：「孰謂微生高直？或乞醯焉，乞諸其鄰而與之。」",
          "en": "The Master said, \"Who says of Wei Sheng Gao that he is upright? One begged some vinegar of him, and he begged it of a neighbor and gave it to the man.\""
        },
        {
          "ref": "5:57",
          "zh": "子曰：「巧言、令色、足恭，左丘明恥之，丘亦恥之。",
          "en": "The Master said, \"Fine words, an insinuating appearance, and excessive respect - Zuo Qiu Ming was ashamed of them. I also am ashamed of them."
        },
        {
          "ref": "5:58",
          "zh": "匿怨而友其人，左丘明恥之，丘亦恥之。」",
          "en": "To conceal resentment against a person, and appear friendly with him - Zuo Qiu Ming was ashamed of such conduct. I also am ashamed of it.\""
        },
        {
          "ref": "5:59",
          "zh": "顏淵、季路侍。子曰：「盍各言爾志？」",
          "en": "Yan Yuan and Ji Lu being by his side, the Master said to them, \"Come, let each of you tell his wishes.\""
        },
        {
          "ref": "5:60",
          "zh": "子路曰：「願車馬、衣輕裘，與朋友共。敝之而無憾。」",
          "en": "Zi Lu said, \"I should like, having chariots and horses, and light fur clothes, to share them with my friends, and though they should spoil them, I would not be displeased.\""
        },
        {
          "ref": "5:61",
          "zh": "顏淵曰：「願無伐善，無施勞。」",
          "en": "Yan Yuan said, \"I should like not to boast of my excellence, nor to make a display of my meritorious deeds.\""
        },
        {
          "ref": "5:62",
          "zh": "子路曰：「願聞子之志。」",
          "en": "Zi Lu then said, \"I should like, sir, to hear your wishes.\""
        },
        {
          "ref": "5:63",
          "zh": "子曰：「老者安之，朋友信之，少者懷之。」",
          "en": "The Master said, \"They are, in regard to the aged, to give them rest; in regard to friends, to show them sincerity; in regard to the young, to treat them tenderly.\""
        },
        {
          "ref": "5:64",
          "zh": "子曰：「已矣乎！吾未見能見其過而內自訟者也。」",
          "en": "The Master said, \"It is all over. I have not yet seen one who could perceive his faults, and inwardly accuse himself.\""
        },
        {
          "ref": "5:65",
          "zh": "子曰：「十室之邑，必有忠信如丘者焉，不如丘之好學也。」",
          "en": "The Master said, \"In a hamlet of ten families, there may be found one honorable and sincere as I am, but not so fond of learning.\""
        }
      ]
    },
    {
      "number": "6",
      "title": "Yong Ye",
      "slug": "yong-ye",
      "passages": [
        {
          "ref": "6:1",
          "zh": "子曰：「雍也可使南面。」",
          "en": "The Master said, \"There is Yong - he might occupy the place of a prince.\""
        },
        {
          "ref": "6:2",
          "zh": "仲弓問子桑伯子，子曰：「可也簡。」",
          "en": "Zhong Gong asked about Zi Sang Bo Zi. The Master said, \"He may pass. He does not mind small matters.\""
        },
        {
          "ref": "6:3",
          "zh": "仲弓曰：「居敬而行簡，以臨其民，不亦可乎？",
          "en": "Zhong Gong said, \"If a man cherish in himself a reverential feeling of the necessity of attention to business, though he may be easy in small matters in his government of the people, that may be allowed."
        },
        {
          "ref": "6:4",
          "zh": "居簡而行簡，無乃大簡乎？」",
          "en": "But if he cherish in himself that easy feeling, and also carry it out in his practice, is not such an easy mode of procedure excessive?\""
        },
        {
          "ref": "6:5",
          "zh": "子曰：「雍之言然。」",
          "en": "The Master said, \"Yong's words are right.\""
        },
        {
          "ref": "6:6",
          "zh": "哀公問：「弟子孰為好學？」",
          "en": "The Duke Ai asked which of the disciples loved to learn."
        },
        {
          "ref": "6:7",
          "zh": "孔子對曰：「有顏回者好學，不遷怒，不貳過。",
          "en": "Confucius replied to him, \"There was Yan Hui; HE loved to learn. He did not transfer his anger; he did not repeat a fault."
        },
        {
          "ref": "6:8",
          "zh": "不幸短命死矣！",
          "en": "Unfortunately, his appointed time was short and he died;"
        },
        {
          "ref": "6:9",
          "zh": "今也則亡，未聞好學者也。」",
          "en": "and now there is not such another. I have not yet heard of any one who loves to learn as he did.\""
        },
        {
          "ref": "6:10",
          "zh": "子華使於齊，冉子為其母請粟。",
          "en": "Zi Hua being employed on a mission to Qi, the disciple Ran requested grain for his mother."
        },
        {
          "ref": "6:11",
          "zh": "子曰：「與之釜。」",
          "en": "The Master said, \"Give her a fu.\""
        },
        {
          "ref": "6:12",
          "zh": "請益。曰：「與之庾。」",
          "en": "Ran requested more. \"Give her an yu,\" said the Master."
        },
        {
          "ref": "6:13",
          "zh": "冉子與之粟五秉。",
          "en": "Ran gave her five bing."
        },
        {
          "ref": "6:14",
          "zh": "子曰：「赤之適齊也，乘肥馬，衣輕裘。吾聞之也，君子周急不繼富。」",
          "en": "The Master said, \"When Chi was proceeding to Qi, he had fat horses to his carriage, and wore light furs. I have heard that a superior man helps the distressed, but does not add to the wealth of the rich.\""
        },
        {
          "ref": "6:15",
          "zh": "原思為之宰，與之粟九百，辭。",
          "en": "Yuan Si being made governor of his town by the Master, he gave him nine hundred measures of grain, but Si declined them."
        },
        {
          "ref": "6:16",
          "zh": "子曰：「毋！以與爾鄰里鄉黨乎！」",
          "en": "The Master said, \"Do not decline them. May you not give them away in the neighborhoods, hamlets, towns, and villages?\""
        },
        {
          "ref": "6:17",
          "zh": "子謂仲弓曰：「犂牛之子騂且角，雖欲勿用，山川其舍諸？」",
          "en": "The Master, speaking of Zhong Gong, said, \"If the calf of a brindled cow be red and horned, although men may not wish to use it, would the spirits of the mountains and rivers put it aside?\""
        },
        {
          "ref": "6:18",
          "zh": "子曰：「回也，其心三月不違仁，其餘則日月至焉而已矣。」",
          "en": "The Master said, \"Such was Hui that for three months there would be nothing in his mind contrary to perfect virtue. The others may attain to this on some days or in some months, but nothing more.\""
        },
        {
          "ref": "6:19",
          "zh": "季康子問：「仲由可使從政也與？」",
          "en": "Ji Kang asked about Zhong You, whether he was fit to be employed as an officer of government."
        },
        {
          "ref": "6:20",
          "zh": "子曰：「由也果，於從政乎何有？」",
          "en": "The Master said, \"You is a man of decision; what difficulty would he find in being an officer of government?\""
        },
        {
          "ref": "6:21",
          "zh": "曰：「賜也，可使從政也與？」曰：「賜也達，於從政乎何有？」",
          "en": "Kang asked, \"Is Ci fit to be employed as an officer of government?\" and was answered, \"Ci is a man of intelligence; what difficulty would he find in being an officer of government?\""
        },
        {
          "ref": "6:22",
          "zh": "曰：「求也，可使從政也與？」曰：「求也藝，於從政乎何有？」",
          "en": "Asked, \"Is Qui fit to be employed as an officer of government?\" the master replied, \"Qiu is a man of various ability; what difficulty would he find in being an officer of government?\""
        },
        {
          "ref": "6:23",
          "zh": "季氏使閔子騫為費宰。",
          "en": "The chief of the Ji family sent to ask Min Zi Qian to be governor of Fei."
        },
        {
          "ref": "6:24",
          "zh": "閔子騫曰：「善為我辭焉。如有復我者，則吾必在汶上矣。」",
          "en": "Min Zi Qian said, \"Decline the offer for me politely. If any one come again to me with a second invitation, I shall be obliged to go and live on the banks of the Wen.\""
        },
        {
          "ref": "6:25",
          "zh": "伯牛有疾，子問之，自牖執其手，曰：「亡之，命矣夫！",
          "en": "Bo Niu being ill, the Master went to ask for him. He took hold of his hand through the window, and said, \"It is killing him. It is the appointment of Heaven, alas!"
        },
        {
          "ref": "6:26",
          "zh": "斯人也而有斯疾也！斯人也而有斯疾也！」",
          "en": "That such a man should have such a sickness! That such a man should have such a sickness!\""
        },
        {
          "ref": "6:27",
          "zh": "子曰：「賢哉回也！一簞食，一瓢飲，在陋巷。",
          "en": "The Master said, \"Admirable indeed was the virtue of Hui! With a single bamboo dish of rice, a single gourd dish of drink, and living in his mean narrow lane,"
        },
        {
          "ref": "6:28",
          "zh": "人不堪其憂，回也不改其樂。",
          "en": "while others could not have endured the distress, he did not allow his joy to be affected by it."
        },
        {
          "ref": "6:29",
          "zh": "賢哉回也！」",
          "en": "Admirable indeed was the virtue of Hui!\""
        },
        {
          "ref": "6:30",
          "zh": "冉求曰：「非不說子之道，力不足也。」",
          "en": "Ran Qiu said, \"It is not that I do not delight in your doctrines, but my strength is insufficient.\""
        },
        {
          "ref": "6:31",
          "zh": "子曰：「力不足者，中道而廢。今女畫。」",
          "en": "The Master said, \"Those whose strength is insufficient give over in the middle of the way but now you limit yourself.\""
        },
        {
          "ref": "6:32",
          "zh": "子謂子夏曰：「女為君子儒，無為小人儒。」",
          "en": "The Master said to Zi Xia, \"Do you be a scholar after the style of the superior man, and not after that of the mean man.\""
        },
        {
          "ref": "6:33",
          "zh": "子游為武城宰。子曰：「女得人焉爾乎？」",
          "en": "Zi You being governor of Wu Cheng, the Master said to him, \"Have you got good men there?\""
        },
        {
          "ref": "6:34",
          "zh": "曰：「有澹臺滅明者，行不由徑。非公事，未嘗至於偃之室也。」",
          "en": "He answered, \"There is Dan Tai Mie Ming, who never in walking takes a short cut, and excepting on public business never comes to my office.\""
        },
        {
          "ref": "6:35",
          "zh": "子曰：「孟之反不伐，奔而殿。",
          "en": "The Master said, \"Meng Zhi Fan does not boast of his merit. Being in the rear on an occasion of flight,"
        },
        {
          "ref": "6:36",
          "zh": "將入門，策其馬，曰：『非敢後也，馬不進也。』」",
          "en": "when they were about to enter the gate, he whipped up his horse, saying, 'It is not that I dare to be last. My horse would not advance.'\""
        },
        {
          "ref": "6:37",
          "zh": "子曰：「不有祝鮀之佞而有宋朝之美，難乎免於今之世矣！」",
          "en": "The Master said, \"Without the specious speech of the litanist Tuo and the beauty of the prince Zhao of Song, it is difficult to escape in the present age.\""
        },
        {
          "ref": "6:38",
          "zh": "子曰：「誰能出不由戶？何莫由斯道也？」",
          "en": "The Master said, \"Who can go out but by the door? How is it that men will not walk according to these ways?\""
        },
        {
          "ref": "6:39",
          "zh": "子曰：「質勝文則野，文勝質則史。",
          "en": "The Master said, \"Where the solid qualities are in excess of accomplishments, we have rusticity; where the accomplishments are in excess of the solid qualities, we have the manners of a clerk."
        },
        {
          "ref": "6:40",
          "zh": "文質彬彬，然後君子。」",
          "en": "When the accomplishments and solid qualities are equally blended, we then have the man of virtue.\""
        },
        {
          "ref": "6:41",
          "zh": "子曰：「人之生也直，罔之生也幸而免。」",
          "en": "The Master said, \"Man is born for uprightness. If a man lose his uprightness, and yet live, his escape from death is the effect of mere good fortune.\""
        },
        {
          "ref": "6:42",
          "zh": "子曰：「知之者不如好之者，好之者不如樂之者。」",
          "en": "The Master said, \"They who know the truth are not equal to those who love it, and they who love it are not equal to those who delight in it.\""
        },
        {
          "ref": "6:43",
          "zh": "子曰：「中人以上，可以語上也；",
          "en": "The Master said, \"To those whose talents are above mediocrity, the highest subjects may be announced."
        },
        {
          "ref": "6:44",
          "zh": "中人以下，不可以語上也。」",
          "en": "To those who are below mediocrity, the highest subjects may not be announced.\""
        },
        {
          "ref": "6:45",
          "zh": "樊遲問知。子曰：「務民之義，敬鬼神而遠之，可謂知矣。」",
          "en": "Fan Chi asked what constituted wisdom. The Master said, \"To give one's self earnestly to the duties due to men, and, while respecting spiritual beings, to keep aloof from them, may be called wisdom.\""
        },
        {
          "ref": "6:46",
          "zh": "問仁。曰：「仁者先難而後獲，可謂仁矣。」",
          "en": "He asked about perfect virtue. The Master said, \"The man of virtue makes the difficulty to be overcome his first business, and success only a subsequent consideration - this may be called perfect virtue.\""
        },
        {
          "ref": "6:47",
          "zh": "子曰：「知者樂水，仁者樂山；",
          "en": "The Master said, \"The wise find pleasure in water; the virtuous find pleasure in hills."
        },
        {
          "ref": "6:48",
          "zh": "知者動，仁者靜；",
          "en": "The wise are active; the virtuous are tranquil."
        },
        {
          "ref": "6:49",
          "zh": "知者樂，仁者壽。」",
          "en": "The wise are joyful; the virtuous are long-lived.\""
        },
        {
          "ref": "6:50",
          "zh": "子曰：「齊一變，至於魯；魯一變，至於道。」",
          "en": "The Master said, \"Qi, by one change, would come to the State of Lu. Lu, by one change, would come to a State where true principles predominated.\""
        },
        {
          "ref": "6:51",
          "zh": "子曰：「觚不觚，觚哉！觚哉！」",
          "en": "The Master said, \"A cornered vessel without corners - a strange cornered vessel! A strange cornered vessel!\""
        },
        {
          "ref": "6:52",
          "zh": "宰我問曰：「仁者，雖告之曰：『井有仁焉。』其從之也？」",
          "en": "Zai Wo asked, saying, \"A benevolent man, though it be told him, 'There is a man in the well' will go in after him, I suppose.\""
        },
        {
          "ref": "6:53",
          "zh": "子曰：「何為其然也？君子可逝也，不可陷也；可欺也，不可罔也。」",
          "en": "Confucius said, \"Why should he do so? A superior man may be made to go to the well, but he cannot be made to go down into it. He may be imposed upon, but he cannot be fooled.\""
        },
        {
          "ref": "6:54",
          "zh": "子曰：「君子博學於文，約之以禮，亦可以弗畔矣夫！」",
          "en": "The Master said, \"The superior man, extensively studying all learning, and keeping himself under the restraint of the rules of propriety, may thus likewise not overstep what is right.\""
        },
        {
          "ref": "6:55",
          "zh": "子見南子，子路不說。",
          "en": "The Master having visited Nan Zi, Zi Lu was displeased,"
        },
        {
          "ref": "6:56",
          "zh": "夫子矢之曰：「予所否者，天厭之！天厭之！」",
          "en": "on which the Master swore, saying, \"Wherein I have done improperly, may Heaven reject me! may Heaven reject me!\""
        },
        {
          "ref": "6:57",
          "zh": "子曰：「中庸之為德也，其至矣乎！民鮮久矣。」",
          "en": "The Master said, \"Perfect is the virtue which is according to the Constant Mean! Rare for a long time has been its practice among the people.\""
        },
        {
          "ref": "6:58",
          "zh": "子貢曰：「如有博施於民而能濟眾，何如？可謂仁乎？」",
          "en": "Zi Gong said, \"Suppose the case of a man extensively conferring benefits on the people, and able to assist all, what would you say of him? Might he be called perfectly virtuous?\""
        },
        {
          "ref": "6:59",
          "zh": "子曰：「何事於仁，必也聖乎！堯舜其猶病諸！",
          "en": "The Master said, \"Why speak only of virtue in connection with him? Must he not have the qualities of a sage? Even Yao and Shun were still solicitous about this."
        },
        {
          "ref": "6:60",
          "zh": "夫仁者，己欲立而立人，己欲達而達人。",
          "en": "Now the man of perfect virtue, wishing to be established himself, seeks also to establish others; wishing to be enlarged himself, he seeks also to enlarge others."
        },
        {
          "ref": "6:61",
          "zh": "能近取譬，可謂仁之方也已。」",
          "en": "To be able to judge of others by what is nigh in ourselves - this may be called the art of virtue.\""
        }
      ]
    },
    {
      "number": "7",
      "title": "Shu Er",
      "slug": "shu-er",
      "passages": [
        {
          "ref": "7:1",
          "zh": "子曰：「述而不作，信而好古，竊比於我老彭。」",
          "en": "The Master said, \"A transmitter and not a maker, believing in and loving the ancients, I venture to compare myself with our old Peng.\""
        },
        {
          "ref": "7:2",
          "zh": "子曰：「默而識之，學而不厭，誨人不倦，何有於我哉？」",
          "en": "The Master said, \"The silent treasuring up of knowledge; learning without satiety; and instructing others without being wearied - which one of these things belongs to me?\""
        },
        {
          "ref": "7:3",
          "zh": "子曰：「德之不脩，學之不講，聞義不能徙，不善不能改，是吾憂也。」",
          "en": "The Master said, \"The learning virtue without proper cultivation; the not thoroughly discussing what is learned; not being able to move towards righteousness of which a knowledge is gained; and not being able to change what is not good - these are the things which occasion me solicitude.\""
        },
        {
          "ref": "7:4",
          "zh": "子之燕居，申申如也，夭夭如也。",
          "en": "When the Master was unoccupied with business, his manner was easy, and he looked pleased."
        },
        {
          "ref": "7:5",
          "zh": "子曰：「甚矣吾衰也！",
          "en": "The Master said, \"Extreme is my decay."
        },
        {
          "ref": "7:6",
          "zh": "久矣吾不復夢見周公。」",
          "en": "For a long time, I have not dreamed, as I was wont to do, that I saw the duke of Zhou.\""
        },
        {
          "ref": "7:7",
          "zh": "子曰：「志於道，據於德，依於仁，游於藝。」",
          "en": "The Master said, \"Let the will be set on the path of duty. Let every attainment in what is good be firmly grasped. Let perfect virtue be accorded with. Let relaxation and enjoyment be found in the polite arts.\""
        },
        {
          "ref": "7:8",
          "zh": "子曰：「自行束脩以上，吾未嘗無誨焉。」",
          "en": "The Master said, \"From the man bringing his bundle of dried flesh for my teaching upwards, I have never refused instruction to any one.\""
        },
        {
          "ref": "7:9",
          "zh": "子曰：「不憤不啟，不悱不發，舉一隅不以三隅反，則不復也。」",
          "en": "The Master said, \"I do not open up the truth to one who is not eager to get knowledge, nor help out any one who is not anxious to explain himself. When I have presented one corner of a subject to any one, and he cannot from it learn the other three, I do not repeat my lesson.\""
        },
        {
          "ref": "7:10",
          "zh": "子食於有喪者之側，未嘗飽也。",
          "en": "When the Master was eating by the side of a mourner, he never ate to the full."
        },
        {
          "ref": "7:11",
          "zh": "子於是日哭，則不歌。",
          "en": "On a day when the master had wept, he did not sing."
        },
        {
          "ref": "7:12",
          "zh": "子謂顏淵曰：「用之則行，舍之則藏，唯我與爾有是夫！」",
          "en": "The Master said to Yan Yuan, \"When called to office, to undertake its duties; when not so called, to lie retired - it is only I and you who have attained to this.\""
        },
        {
          "ref": "7:13",
          "zh": "子路曰：「子行三軍，則誰與？」",
          "en": "Zi Lu said, \"If you had the conduct of the armies of a great state, whom would you have to act with you?\""
        },
        {
          "ref": "7:14",
          "zh": "子曰：「暴虎馮河，死而無悔者，吾不與也。必也臨事而懼，好謀而成者也。」",
          "en": "The Master said, \"He who will unarmed attack a tiger, or cross a river without a boat, dying without any regret, I would not have act with me. My associate must be the man who proceeds to action full of solicitude, who is fond of adjusting his plans, and then carries them into execution.\""
        },
        {
          "ref": "7:15",
          "zh": "子曰：「富而可求也，雖執鞭之士，吾亦為之。",
          "en": "The Master said, \"If the search for riches is sure to be successful, though I should become a groom with whip in hand to get them, I will do so."
        },
        {
          "ref": "7:16",
          "zh": "如不可求，從吾所好。」",
          "en": "As the search may not be successful, I will follow after that which I love.\""
        },
        {
          "ref": "7:17",
          "zh": "子之所慎：齊，戰，疾。",
          "en": "The things in reference to which the Master exercised the greatest caution were - fasting, war, and sickness."
        },
        {
          "ref": "7:18",
          "zh": "子在齊聞韶，三月不知肉味。",
          "en": "When the Master was in Qi, he heard the Shao, and for three months did not know the taste of flesh."
        },
        {
          "ref": "7:19",
          "zh": "曰：「不圖為樂之至於斯也！」",
          "en": "He said, \"I did not think that music could have been made so excellent as this.\""
        },
        {
          "ref": "7:20",
          "zh": "冉有曰：「夫子為衛君乎？」",
          "en": "Ran You said, \"Is our Master for the ruler of Wei?\""
        },
        {
          "ref": "7:21",
          "zh": "子貢曰：「諾。吾將問之。」",
          "en": "Zi Gong said, \"Oh! I will ask him.\""
        },
        {
          "ref": "7:22",
          "zh": "入，曰：「伯夷、叔齊何人也？」",
          "en": "He went in accordingly, and said, \"What sort of men were Bo Yi and Shu Qi?\""
        },
        {
          "ref": "7:23",
          "zh": "曰：「古之賢人也。」",
          "en": "\"They were ancient worthies,\" said the Master."
        },
        {
          "ref": "7:24",
          "zh": "曰：「怨乎？」",
          "en": "\"Did they have any repinings because of their course?\""
        },
        {
          "ref": "7:25",
          "zh": "曰：「求仁而得仁，又何怨。」",
          "en": "The Master again replied, \"They sought to act virtuously, and they did so; what was there for them to repine about?\""
        },
        {
          "ref": "7:26",
          "zh": "出，曰：「夫子不為也。」",
          "en": "On this, Zi Gong went out and said, \"Our Master is not for him.\""
        },
        {
          "ref": "7:27",
          "zh": "子曰：「飯疏食飲水，曲肱而枕之，樂亦在其中矣。",
          "en": "The Master said, \"With coarse rice to eat, with water to drink, and my bended arm for a pillow; I have still joy in the midst of these things."
        },
        {
          "ref": "7:28",
          "zh": "不義而富且貴，於我如浮雲。」",
          "en": "Riches and honors acquired by unrighteousness, are to me as a floating cloud.\""
        },
        {
          "ref": "7:29",
          "zh": "子曰：「加我數年，五十以學易，可以無大過矣。」",
          "en": "The Master said, \"If some years were added to my life, I would give fifty to the study of the Yi, and then I might come to be without great faults.\""
        },
        {
          "ref": "7:30",
          "zh": "子所雅言，詩、書、執禮，皆雅言也。",
          "en": "The Master's frequent themes of discourse were: the Odes, the History, and the maintenance of the Rules of Propriety. On all these he frequently discoursed."
        },
        {
          "ref": "7:31",
          "zh": "葉公問孔子於子路，子路不對。",
          "en": "The Duke of She asked Zi Lu about Confucius, and Zi Lu did not answer him."
        },
        {
          "ref": "7:32",
          "zh": "子曰：「女奚不曰，其為人也，發憤忘食，樂以忘憂，不知老之將至云爾。」",
          "en": "The Master said, \"Why did you not say to him, 'He is simply a man, who in his eager pursuit of knowledge forgets his food, who in the joy of its attainment forgets his sorrows, and who does not perceive that old age is coming on?'\""
        },
        {
          "ref": "7:33",
          "zh": "子曰：「我非生而知之者，好古，敏以求之者也。」",
          "en": "The Master said, \"I am not one who was born in the possession of knowledge; I am one who is fond of antiquity, and earnest in seeking it there.\""
        },
        {
          "ref": "7:34",
          "zh": "子不語怪，力，亂，神。",
          "en": "The subjects on which the Master did not talk, were: extraordinary things, feats of strength, disorder, and spiritual beings."
        },
        {
          "ref": "7:35",
          "zh": "子曰：「三人行，必有我師焉。",
          "en": "The Master said, \"When I walk along with two others, they may serve me as my teachers."
        },
        {
          "ref": "7:36",
          "zh": "擇其善者而從之，其不善者而改之。」",
          "en": "I will select their good qualities and follow them, their bad qualities and avoid them.\""
        },
        {
          "ref": "7:37",
          "zh": "子曰：「天生德於予，桓魋其如予何？」",
          "en": "The Master said, \"Heaven produced the virtue that is in me. Huan Tui - what can he do to me?\""
        },
        {
          "ref": "7:38",
          "zh": "子曰：「二三子以我為隱乎？吾無隱乎爾。",
          "en": "The Master said, \"Do you think, my disciples, that I have any concealments? I conceal nothing from you."
        },
        {
          "ref": "7:39",
          "zh": "吾無行而不與二三子者，是丘也。」",
          "en": "There is nothing which I do that is not shown to you, my disciples; that is my way.\""
        },
        {
          "ref": "7:40",
          "zh": "子以四教：文，行，忠，信。",
          "en": "There were four things which the Master taught: letters, ethics, devotion of soul, and truthfulness."
        },
        {
          "ref": "7:41",
          "zh": "子曰：「聖人，吾不得而見之矣；得見君子者，斯可矣。」",
          "en": "The Master said, \"A sage it is not mine to see; could I see a man of real talent and virtue, that would satisfy me.\""
        },
        {
          "ref": "7:42",
          "zh": "子曰：「善人，吾不得而見之矣；得見有恆者，斯可矣。",
          "en": "The Master said, \"A good man it is not mine to see; could I see a man possessed of constancy, that would satisfy me."
        },
        {
          "ref": "7:43",
          "zh": "亡而為有，虛而為盈，約而為泰，難乎有恆矣。」",
          "en": "Having not and yet affecting to have, empty and yet affecting to be full, straitened and yet affecting to be at ease - it is difficult with such characteristics to have constancy.\""
        },
        {
          "ref": "7:44",
          "zh": "子釣而不綱，弋不射宿。",
          "en": "The Master angled, but did not use a net. He shot, but not at birds perching."
        },
        {
          "ref": "7:45",
          "zh": "子曰：「蓋有不知而作之者，我無是也。",
          "en": "The Master said, \"There may be those who act without knowing why. I do not do so."
        },
        {
          "ref": "7:46",
          "zh": "多聞擇其善者而從之，多見而識之，知之次也。」",
          "en": "Hearing much and selecting what is good and following it; seeing much and keeping it in memory - this is the second style of knowledge.\""
        },
        {
          "ref": "7:47",
          "zh": "互鄉難與言，童子見，門人惑。",
          "en": "It was difficult to talk (profitably and reputably) with the people of Hu Xiang, and a lad of that place having had an interview with the Master, the disciples doubted."
        },
        {
          "ref": "7:48",
          "zh": "子曰：「與其進也，不與其退也，唯何甚！",
          "en": "The Master said, \"I admit people's approach to me without committing myself as to what they may do when they have retired. Why must one be so severe?"
        },
        {
          "ref": "7:49",
          "zh": "人潔己以進，與其潔也，不保其往也。」",
          "en": "If a man purify himself to wait upon me, I receive him so purified, without guaranteeing his past conduct.\""
        },
        {
          "ref": "7:50",
          "zh": "子曰：「仁遠乎哉？我欲仁，斯仁至矣。」",
          "en": "The Master said, \"Is virtue a thing remote? I wish to be virtuous, and lo! virtue is at hand.\""
        },
        {
          "ref": "7:51",
          "zh": "陳司敗問昭公知禮乎？",
          "en": "The minister of crime of Chen asked whether the duke Zhao knew propriety,"
        },
        {
          "ref": "7:52",
          "zh": "孔子曰：「知禮。」",
          "en": "and Confucius said, \"He knew propriety.\""
        },
        {
          "ref": "7:53",
          "zh": "孔子退，揖巫馬期而進之，曰：「吾聞君子不黨，君子亦黨乎？",
          "en": "Confucius having retired, the minister bowed to Wu Ma Qi to come forward, and said, \"I have heard that the superior man is not a partisan. May the superior man be a partisan also?"
        },
        {
          "ref": "7:54",
          "zh": "君取於吳為同姓，謂之吳孟子。君而知禮，孰不知禮？」",
          "en": "The prince married a daughter of the house of Wu, of the same surname with himself, and called her, 'The elder Zi of Wu.' If the prince knew propriety, who does not know it?\""
        },
        {
          "ref": "7:55",
          "zh": "巫馬期以告。子曰：「丘也幸，苟有過，人必知之。」",
          "en": "Wu Ma Qi reported these remarks, and the Master said, \"I am fortunate! If I have any errors, people are sure to know them.\""
        },
        {
          "ref": "7:56",
          "zh": "子與人歌而善，必使反之，而後和之。",
          "en": "When the Master was in company with a person who was singing, if he sang well, he would make him repeat the song, while he accompanied it with his own voice."
        },
        {
          "ref": "7:57",
          "zh": "子曰：「文，莫吾猶人也。躬行君子，則吾未之有得。」",
          "en": "The Master said, \"In letters I am perhaps equal to other men, but the character of the superior man, carrying out in his conduct what he professes, is what I have not yet attained to.\""
        },
        {
          "ref": "7:58",
          "zh": "子曰：「若聖與仁，則吾豈敢？抑為之不厭，誨人不倦，則可謂云爾已矣。」",
          "en": "The Master said, \"The sage and the man of perfect virtue - how dare I rank myself with them? That I strive to become such without satiety, and teach others without weariness - this much can be said of me.\""
        },
        {
          "ref": "7:59",
          "zh": "公西華曰：「正唯弟子不能學也。」",
          "en": "Gong Xi Hua said, \"This is just what we, the disciples, cannot imitate you in.\""
        },
        {
          "ref": "7:60",
          "zh": "子疾病，子路請禱。",
          "en": "The Master being very sick, Zi Lu asked leave to pray for him."
        },
        {
          "ref": "7:61",
          "zh": "子曰：「有諸？」",
          "en": "He said, \"May such a thing be done?\""
        },
        {
          "ref": "7:62",
          "zh": "子路對曰：「有之。誄曰：『禱爾于上下神祇。』」",
          "en": "Zi Lu replied, \"It may. In the Eulogies it is said, 'Prayer has been made for thee to the spirits of the upper and lower worlds.'\""
        },
        {
          "ref": "7:63",
          "zh": "子曰：「丘之禱久矣。」",
          "en": "The Master said, \"My praying has been for a long time.\""
        },
        {
          "ref": "7:64",
          "zh": "子曰：「奢則不孫，儉則固。與其不孫也，寧固。」",
          "en": "The Master said, \"Extravagance leads to insubordination, and parsimony to meanness. It is better to be mean than to be insubordinate.\""
        },
        {
          "ref": "7:65",
          "zh": "子曰：「君子坦蕩蕩，小人長戚戚。」",
          "en": "The Master said, \"The superior man is satisfied and composed; the mean man is always full of distress.\""
        },
        {
          "ref": "7:66",
          "zh": "子溫而厲，威而不猛，恭而安。",
          "en": "The Master was mild, and yet dignified; majestic, and yet not fierce; respectful, and yet easy."
        }
      ]
    },
    {
      "number": "8",
      "title": "Tai Bo",
      "slug": "tai-bo",
      "passages": [
        {
          "ref": "8:1",
          "zh": "子曰：「泰伯，其可謂至德也已矣！",
          "en": "The Master said, \"Tai Bo may be said to have reached the highest point of virtuous action."
        },
        {
          "ref": "8:2",
          "zh": "三以天下讓，民無得而稱焉。」",
          "en": "Thrice he declined the kingdom, and the people in ignorance of his motives could not express their approbation of his conduct.\""
        },
        {
          "ref": "8:3",
          "zh": "子曰：「恭而無禮則勞，慎而無禮則葸，勇而無禮則亂，直而無禮則絞。",
          "en": "The Master said, \"Respectfulness, without the rules of propriety, becomes laborious bustle; carefulness, without the rules of propriety, becomes timidity; boldness, without the rules of propriety, becomes insubordination; straightforwardness, without the rules of propriety, becomes rudeness."
        },
        {
          "ref": "8:4",
          "zh": "君子篤於親，則民興於仁；",
          "en": "When those who are in high stations perform well all their duties to their relations, the people are aroused to virtue."
        },
        {
          "ref": "8:5",
          "zh": "故舊不遺，則民不偷。」",
          "en": "When old friends are not neglected by them, the people are preserved from meanness.\""
        },
        {
          "ref": "8:6",
          "zh": "曾子有疾，召門弟子曰：「啟予足！啟予手！",
          "en": "The philosopher Zeng being ill, he called to him the disciples of his school, and said, \"Uncover my feet, uncover my hands."
        },
        {
          "ref": "8:7",
          "zh": "《詩》云『戰戰兢兢，如臨深淵，如履薄冰。』",
          "en": "It is said in the Book of Poetry, 'We should be apprehensive and cautious, as if on the brink of a deep gulf, as if treading on thin ice.'"
        },
        {
          "ref": "8:8",
          "zh": "而今而後，吾知免夫！小子！」",
          "en": "Now and hereafter, I know my escape from all injury to my person. O ye, my little children.\""
        },
        {
          "ref": "8:9",
          "zh": "曾子有疾，孟敬子問之。",
          "en": "The philosopher Zeng being ill, Meng Jing went to ask how he was."
        },
        {
          "ref": "8:10",
          "zh": "曾子言曰：「鳥之將死，其鳴也哀；",
          "en": "Zeng said to him, \"When a bird is about to die, its notes are mournful;"
        },
        {
          "ref": "8:11",
          "zh": "人之將死，其言也善。",
          "en": "when a man is about to die, his words are good."
        },
        {
          "ref": "8:12",
          "zh": "君子所貴乎道者三：動容貌，斯遠暴慢矣；",
          "en": "There are three principles of conduct which the man of high rank should consider specially important: that in his deportment and manner he keep from violence and heedlessness;"
        },
        {
          "ref": "8:13",
          "zh": "正顏色，斯近信矣；",
          "en": "that in regulating his countenance he keep near to sincerity;"
        },
        {
          "ref": "8:14",
          "zh": "出辭氣，斯遠鄙倍矣。",
          "en": "and that in his words and tones he keep far from lowness and impropriety."
        },
        {
          "ref": "8:15",
          "zh": "籩豆之事，則有司存。」",
          "en": "As to such matters as attending to the sacrificial vessels, there are the proper officers for them.\""
        },
        {
          "ref": "8:16",
          "zh": "曾子曰：「以能問於不能，以多問於寡；",
          "en": "The philosopher Zeng said, \"Gifted with ability, and yet putting questions to those who were not so; possessed of much, and yet putting questions to those possessed of little;"
        },
        {
          "ref": "8:17",
          "zh": "有若無，實若虛，犯而不校，昔者吾友嘗從事於斯矣。」",
          "en": "having, as though he had not; full, and yet counting himself as empty; offended against, and yet entering into no altercation; formerly I had a friend who pursued this style of conduct.\""
        },
        {
          "ref": "8:18",
          "zh": "曾子曰：「可以託六尺之孤，可以寄百里之命，臨大節而不可奪也。",
          "en": "The philosopher Zeng said, \"Suppose that there is an individual who can be entrusted with the charge of a young orphan prince, and can be commissioned with authority over a state of a hundred li, and whom no emergency however great can drive from his principles -"
        },
        {
          "ref": "8:19",
          "zh": "君子人與？君子人也。」",
          "en": "is such a man a superior man? He is a superior man indeed.\""
        },
        {
          "ref": "8:20",
          "zh": "曾子曰：「士不可以不弘毅，任重而道遠。",
          "en": "The philosopher Zeng said, \"The officer may not be without breadth of mind and vigorous endurance. His burden is heavy and his course is long."
        },
        {
          "ref": "8:21",
          "zh": "仁以為己任，不亦重乎？",
          "en": "Perfect virtue is the burden which he considers it is his to sustain - is it not heavy?"
        },
        {
          "ref": "8:22",
          "zh": "死而後已，不亦遠乎？」",
          "en": "Only with death does his course stop - is it not long?\""
        },
        {
          "ref": "8:23",
          "zh": "子曰：「興於詩，立於禮。",
          "en": "The Master said, \"It is by the Odes that the mind is aroused. It is by the Rules of Propriety that the character is established."
        },
        {
          "ref": "8:24",
          "zh": "成於樂。」",
          "en": "It is from Music that the finish is received.\""
        },
        {
          "ref": "8:25",
          "zh": "子曰：「民可使由之，不可使知之。」",
          "en": "The Master said, \"The people may be made to follow a path of action, but they may not be made to understand it.\""
        },
        {
          "ref": "8:26",
          "zh": "子曰：「好勇疾貧，亂也。",
          "en": "The Master said, \"The man who is fond of daring and is dissatisfied with poverty, will proceed to insubordination."
        },
        {
          "ref": "8:27",
          "zh": "人而不仁，疾之已甚，亂也。」",
          "en": "The man who is not virtuous, when you carry your dislike of him to an extreme, will also proceed to insubordination.\""
        },
        {
          "ref": "8:28",
          "zh": "子曰：「如有周公之才之美，使驕且吝，其餘不足觀也已。」",
          "en": "The Master said, \"Though a man have abilities as admirable as those of the duke of Zhou, yet if he be proud and niggardly, those other things are really not worth being looked at.\""
        },
        {
          "ref": "8:29",
          "zh": "子曰：「三年學，不至於穀，不易得也。」",
          "en": "The Master said, \"Having learned for three years without coming to be good - such a man is not easy to find.\""
        },
        {
          "ref": "8:30",
          "zh": "子曰：「篤信好學，守死善道。",
          "en": "The Master said, \"With sincere faith he unites the love of learning; holding firm to death, he is perfecting the excellence of his course."
        },
        {
          "ref": "8:31",
          "zh": "危邦不入，亂邦不居。",
          "en": "Such a one will not enter a tottering state, nor dwell in a disorganized one."
        },
        {
          "ref": "8:32",
          "zh": "天下有道則見，無道則隱。",
          "en": "When right principles of government prevail in the kingdom, he will show himself; when they are prostrated, he will keep concealed."
        },
        {
          "ref": "8:33",
          "zh": "邦有道，貧且賤焉，恥也；",
          "en": "When a country is well governed, poverty and a mean condition are things to be ashamed of."
        },
        {
          "ref": "8:34",
          "zh": "邦無道，富且貴焉，恥也。」",
          "en": "When a country is ill governed, riches and honor are things to be ashamed of.\""
        },
        {
          "ref": "8:35",
          "zh": "子曰：「不在其位，不謀其政。」",
          "en": "The Master said, \"He who is not in any particular office has nothing to do with plans for the administration of its duties.\""
        },
        {
          "ref": "8:36",
          "zh": "子曰：「師摯之始，關雎之亂，洋洋乎！盈耳哉。」",
          "en": "The Master said, \"When the music master Zhi first entered on his office, the finish of the Guan Ju was magnificent - how it filled the ears!\""
        },
        {
          "ref": "8:37",
          "zh": "子曰：「狂而不直，侗而不愿，悾悾而不信，吾不知之矣。」",
          "en": "The Master said, \"Ardent and yet not upright, stupid and yet not attentive; simple and yet not sincere - such persons I do not understand.\""
        },
        {
          "ref": "8:38",
          "zh": "子曰：「學如不及，猶恐失之。」",
          "en": "The Master said, \"Learn as if you could not reach your object, and were always fearing also lest you should lose it.\""
        },
        {
          "ref": "8:39",
          "zh": "子曰：「巍巍乎！舜禹之有天下也，而不與焉。」",
          "en": "The Master said, \"How majestic was the manner in which Shun and Yu held possession of the empire, as if it were nothing to them!\""
        },
        {
          "ref": "8:40",
          "zh": "子曰：「大哉，堯之為君也！",
          "en": "The Master said, \"Great indeed was Yao as a sovereign!"
        },
        {
          "ref": "8:41",
          "zh": "巍巍乎！唯天為大，唯堯則之。",
          "en": "How majestic was he! It is only Heaven that is grand, and only Yao corresponded to it."
        },
        {
          "ref": "8:42",
          "zh": "蕩蕩乎！民無能名焉。",
          "en": "How vast was his virtue! The people could find no name for it."
        },
        {
          "ref": "8:43",
          "zh": "巍巍乎！其有成功也；",
          "en": "How majestic was he in the works which he accomplished!"
        },
        {
          "ref": "8:44",
          "zh": "煥乎，其有文章！」",
          "en": "How glorious in the elegant regulations which he instituted!\""
        },
        {
          "ref": "8:45",
          "zh": "舜有臣五人而天下治。",
          "en": "Shun had five ministers, and the empire was well governed."
        },
        {
          "ref": "8:46",
          "zh": "武王曰：「予有亂臣十人。」",
          "en": "King Wu said, \"I have ten able ministers.\""
        },
        {
          "ref": "8:47",
          "zh": "孔子曰：「才難，不其然乎？",
          "en": "Confucius said, \"Is not the saying that talents are difficult to find, true?"
        },
        {
          "ref": "8:48",
          "zh": "唐虞之際，於斯為盛。",
          "en": "Only when the dynasties of Tang and Yu met, were they more abundant than in this of Zhou,"
        },
        {
          "ref": "8:49",
          "zh": "有婦人焉，九人而已。",
          "en": "yet there was a woman among them. The able ministers were no more than nine men."
        },
        {
          "ref": "8:50",
          "zh": "三分天下有其二，以服事殷。",
          "en": "King Wen possessed two of the three parts of the empire, and with those he served the dynasty of Yin."
        },
        {
          "ref": "8:51",
          "zh": "周之德，其可謂至德也已矣。」",
          "en": "The virtue of the house of Zhou may be said to have reached the highest point indeed.\""
        },
        {
          "ref": "8:52",
          "zh": "子曰：「禹，吾無間然矣。",
          "en": "The Master said, \"I can find no flaw in the character of Yu."
        },
        {
          "ref": "8:53",
          "zh": "菲飲食，而致孝乎鬼神；",
          "en": "He used himself coarse food and drink, but displayed the utmost filial piety towards the spirits."
        },
        {
          "ref": "8:54",
          "zh": "惡衣服，而致美乎黻冕；",
          "en": "His ordinary garments were poor, but he displayed the utmost elegance in his sacrificial cap and apron."
        },
        {
          "ref": "8:55",
          "zh": "卑宮室，而盡力乎溝洫。",
          "en": "He lived in a low, mean house, but expended all his strength on the ditches and water channels."
        },
        {
          "ref": "8:56",
          "zh": "禹，吾無間然矣。」",
          "en": "I can find nothing like a flaw in Yu.\""
        }
      ]
    },
    {
      "number": "9",
      "title": "Zi Han",
      "slug": "zi-han",
      "passages": [
        {
          "ref": "9:1",
          "zh": "子罕言利，與命，與仁。",
          "en": "The subjects of which the Master seldom spoke were: profitableness, and also the appointments of Heaven, and perfect virtue."
        },
        {
          "ref": "9:2",
          "zh": "達巷黨人曰：「大哉孔子！博學而無所成名。」",
          "en": "A man of the village of Da Xiang said, \"Great indeed is the philosopher Kong! His learning is extensive, and yet he does not render his name famous by any particular thing.\""
        },
        {
          "ref": "9:3",
          "zh": "子聞之，謂門弟子曰：「吾何執？執御乎？執射乎？吾執御矣。」",
          "en": "The Master heard the observation, and said to his disciples, \"What shall I practice? Shall I practice charioteering, or shall I practice archery? I will practice charioteering.\""
        },
        {
          "ref": "9:4",
          "zh": "子曰：「麻冕，禮也；今也純，儉。吾從眾。",
          "en": "The Master said, \"The linen cap is that prescribed by the rules of ceremony, but now a silk one is worn. It is economical, and I follow the common practice."
        },
        {
          "ref": "9:5",
          "zh": "拜下，禮也；今拜乎上，泰也。雖違眾，吾從下。」",
          "en": "Bowing below the hall is prescribed by the rules of ceremony, but now the practice is to bow only after ascending it. That is arrogant. I continue to bow below the hall, though I oppose the common practice.\""
        },
        {
          "ref": "9:6",
          "zh": "子絕四：毋意，毋必，毋固，毋我。",
          "en": "There were four things from which the Master was entirely free. He had no foregone conclusions, no arbitrary predeterminations, no obstinacy, and no egoism."
        },
        {
          "ref": "9:7",
          "zh": "子畏於匡。",
          "en": "The Master was put in fear in Kuang."
        },
        {
          "ref": "9:8",
          "zh": "曰：「文王既沒，文不在茲乎？",
          "en": "He said, \"After the death of King Wen, was not the cause of truth lodged here in me?"
        },
        {
          "ref": "9:9",
          "zh": "天之將喪斯文也，後死者不得與於斯文也；",
          "en": "If Heaven had wished to let this cause of truth perish, then I, a future mortal, should not have got such a relation to that cause."
        },
        {
          "ref": "9:10",
          "zh": "天之未喪斯文也，匡人其如予何？」",
          "en": "While Heaven does not let the cause of truth perish, what can the people of Kuang do to me?\""
        },
        {
          "ref": "9:11",
          "zh": "大宰問於子貢曰：「夫子聖者與？何其多能也？」",
          "en": "A high officer asked Zi Gong, saying, \"May we not say that your Master is a sage? How various is his ability!\""
        },
        {
          "ref": "9:12",
          "zh": "子貢曰：「固天縱之將聖，又多能也。」",
          "en": "Zi Gong said, \"Certainly Heaven has endowed him unlimitedly. He is about a sage. And, moreover, his ability is various.\""
        },
        {
          "ref": "9:13",
          "zh": "子聞之，曰：「大宰知我乎！吾少也賤，故多能鄙事。",
          "en": "The Master heard of the conversation and said, \"Does the high officer know me? When I was young, my condition was low, and therefore I acquired my ability in many things, but they were mean matters."
        },
        {
          "ref": "9:14",
          "zh": "君子多乎哉？不多也。」",
          "en": "Must the superior man have such variety of ability? He does not need variety of ability.\""
        },
        {
          "ref": "9:15",
          "zh": "牢曰：「子云，『吾不試，故藝』。」",
          "en": "Lao said, \"The Master said, 'Having no official employment, I acquired many arts.'\""
        },
        {
          "ref": "9:16",
          "zh": "子曰：「吾有知乎哉？無知也。",
          "en": "The Master said, \"Am I indeed possessed of knowledge? I am not knowing."
        },
        {
          "ref": "9:17",
          "zh": "有鄙夫問於我，空空如也，我叩其兩端而竭焉。」",
          "en": "But if a mean person, who appears quite empty-like, ask anything of me, I set it forth from one end to the other, and exhaust it.\""
        },
        {
          "ref": "9:18",
          "zh": "子曰：「鳳鳥不至，河不出圖，吾已矣夫！」",
          "en": "The Master said, \"The Feng bird does not come; the river sends forth no map - it is all over with me!\""
        },
        {
          "ref": "9:19",
          "zh": "子見齊衰者、冕衣裳者與瞽者，見之，雖少必作；",
          "en": "When the Master saw a person in a mourning dress, or any one with the cap and upper and lower garments of full dress, or a blind person, on observing them approaching, though they were younger than himself, he would rise up,"
        },
        {
          "ref": "9:20",
          "zh": "過之，必趨。",
          "en": "and if he had to pass by them, he would do so hastily."
        },
        {
          "ref": "9:21",
          "zh": "顏淵喟然歎曰：「仰之彌高，鑽之彌堅；",
          "en": "Yan Yuan, in admiration of the Master's doctrines, sighed and said, \"I looked up to them, and they seemed to become more high; I tried to penetrate them, and they seemed to become more firm;"
        },
        {
          "ref": "9:22",
          "zh": "瞻之在前，忽焉在後。",
          "en": "I looked at them before me, and suddenly they seemed to be behind."
        },
        {
          "ref": "9:23",
          "zh": "夫子循循然善誘人，博我以文，約我以禮。",
          "en": "The Master, by orderly method, skillfully leads men on. He enlarged my mind with learning, and taught me the restraints of propriety."
        },
        {
          "ref": "9:24",
          "zh": "欲罷不能，既竭吾才，如有所立卓爾。",
          "en": "When I wish to give over the study of his doctrines, I cannot do so, and having exerted all my ability, there seems something to stand right up before me;"
        },
        {
          "ref": "9:25",
          "zh": "雖欲從之，末由也已。」",
          "en": "but though I wish to follow and lay hold of it, I really find no way to do so.\""
        },
        {
          "ref": "9:26",
          "zh": "子疾病，子路使門人為臣。",
          "en": "The Master being very ill, Zi Lu wished the disciples to act as ministers to him."
        },
        {
          "ref": "9:27",
          "zh": "病閒，曰：「久矣哉！由之行詐也，無臣而為有臣。",
          "en": "During a remission of his illness, he said, \"Long has the conduct of You been deceitful! By pretending to have ministers when I have them not, whom should I impose upon?"
        },
        {
          "ref": "9:28",
          "zh": "吾誰欺？欺天乎？",
          "en": "Should I impose upon Heaven?"
        },
        {
          "ref": "9:29",
          "zh": "且予與其死於臣之手也，無寧死於二三子之手乎？",
          "en": "Moreover, than that I should die in the hands of ministers, is it not better that I should die in the hands of you, my disciples?"
        },
        {
          "ref": "9:30",
          "zh": "且予縱不得大葬，予死於道路乎？」",
          "en": "And though I may not get a great burial, shall I die upon the road?\""
        },
        {
          "ref": "9:31",
          "zh": "子貢曰：「有美玉於斯，韞匵而藏諸？求善賈而沽諸？」",
          "en": "Zi Gong said, \"There is a beautiful gem here. Should I lay it up in a case and keep it? or should I seek for a good price and sell it?\""
        },
        {
          "ref": "9:32",
          "zh": "子曰：「沽之哉！沽之哉！我待賈者也。」",
          "en": "The Master said, \"Sell it! Sell it! But I would wait for one to offer the price.\""
        },
        {
          "ref": "9:33",
          "zh": "子欲居九夷。",
          "en": "The Master was wishing to go and live among the nine wild tribes of the east."
        },
        {
          "ref": "9:34",
          "zh": "或曰：「陋，如之何！」",
          "en": "Some one said, \"They are rude. How can you do such a thing?\""
        },
        {
          "ref": "9:35",
          "zh": "子曰：「君子居之，何陋之有？」",
          "en": "The Master said, \"If a superior man dwelt among them, what rudeness would there be?\""
        },
        {
          "ref": "9:36",
          "zh": "子曰：「吾自衛反魯，然後樂正，雅頌各得其所。」",
          "en": "The Master said, \"I returned from Wei to Lu, and then the music was reformed, and the pieces in the Royal songs and Praise songs all found their proper places.\""
        },
        {
          "ref": "9:37",
          "zh": "子曰：「出則事公卿，入則事父兄，喪事不敢不勉，不為酒困，何有於我哉？」",
          "en": "The Master said, \"Abroad, to serve the high ministers and nobles; at home, to serve one's father and elder brothers; in all duties to the dead, not to dare not to exert one's self; and not to be overcome of wine - which one of these things do I attain to?\""
        },
        {
          "ref": "9:38",
          "zh": "子在川上，曰：「逝者如斯夫！不舍晝夜。」",
          "en": "The Master standing by a stream, said, \"It passes on just like this, not ceasing day or night!\""
        },
        {
          "ref": "9:39",
          "zh": "子曰：「吾未見好德如好色者也。」",
          "en": "The Master said, \"I have not seen one who loves virtue as he loves beauty.\""
        },
        {
          "ref": "9:40",
          "zh": "子曰：「譬如為山，未成一簣，止，吾止也；",
          "en": "The Master said, \"The prosecution of learning may be compared to what may happen in raising a mound. If there want but one basket of earth to complete the work, and I stop, the stopping is my own work."
        },
        {
          "ref": "9:41",
          "zh": "譬如平地，雖覆一簣，進，吾往也。」",
          "en": "It may be compared to throwing down the earth on the level ground. Though but one basketful is thrown at a time, the advancing with it is my own going forward.\""
        },
        {
          "ref": "9:42",
          "zh": "子曰：「語之而不惰者，其回也與！」",
          "en": "The Master said, \"Never flagging when I set forth anything to him - ah! that is Hui.\""
        },
        {
          "ref": "9:43",
          "zh": "子謂顏淵，曰：「惜乎！吾見其進也，未見其止也。」",
          "en": "The Master said of Yan Yuan, \"Alas! I saw his constant advance. I never saw him stop in his progress.\""
        },
        {
          "ref": "9:44",
          "zh": "子曰：「苗而不秀者有矣夫！",
          "en": "The Master said, \"There are cases in which the blade springs, but the plant does not go on to flower!"
        },
        {
          "ref": "9:45",
          "zh": "秀而不實者有矣夫！」",
          "en": "There are cases where it flowers but no fruit is subsequently produced!\""
        },
        {
          "ref": "9:46",
          "zh": "子曰：「後生可畏，焉知來者之不如今也？",
          "en": "The Master said, \"A youth is to be regarded with respect. How do we know that his future will not be equal to our present?"
        },
        {
          "ref": "9:47",
          "zh": "四十、五十而無聞焉，斯亦不足畏也已。」",
          "en": "If he reach the age of forty or fifty, and has not made himself heard of, then indeed he will not be worth being regarded with respect.\""
        },
        {
          "ref": "9:48",
          "zh": "子曰：「法語之言，能無從乎？改之為貴。",
          "en": "The Master said, \"Can men refuse to assent to the words of strict admonition? But it is reforming the conduct because of them which is valuable."
        },
        {
          "ref": "9:49",
          "zh": "巽與之言，能無說乎？繹之為貴。",
          "en": "Can men refuse to be pleased with words of gentle advice? But it is unfolding their aim which is valuable."
        },
        {
          "ref": "9:50",
          "zh": "說而不繹，從而不改，吾末如之何也已矣。」",
          "en": "If a man be pleased with these words, but does not unfold their aim, and assents to those, but does not reform his conduct, I can really do nothing with him.\""
        },
        {
          "ref": "9:51",
          "zh": "子曰：「主忠信，毋友不如己者，過則勿憚改。」",
          "en": "The Master said, \"Hold faithfulness and sincerity as first principles. Have no friends not equal to yourself. When you have faults, do not fear to abandon them.\""
        },
        {
          "ref": "9:52",
          "zh": "子曰：「三軍可奪帥也，匹夫不可奪志也。」",
          "en": "The Master said, \"The commander of the forces of a large state may be carried off, but the will of even a common man cannot be taken from him.\""
        },
        {
          "ref": "9:53",
          "zh": "子曰：「衣敝縕袍，與衣狐貉者立，而不恥者，其由也與？",
          "en": "The Master said, \"Dressed himself in a tattered robe quilted with hemp, yet standing by the side of men dressed in furs, and not ashamed - ah! it is You who is equal to this!"
        },
        {
          "ref": "9:54",
          "zh": "『不忮不求，何用不臧？』」",
          "en": "He dislikes none, he covets nothing - what can he do but what is good!\""
        },
        {
          "ref": "9:55",
          "zh": "子路終身誦之。",
          "en": "Zi Lu kept continually repeating these words of the ode,"
        },
        {
          "ref": "9:56",
          "zh": "子曰：「是道也，何足以臧？」",
          "en": "when the Master said, \"Those things are by no means sufficient to constitute perfect excellence.\""
        },
        {
          "ref": "9:57",
          "zh": "子曰：「歲寒，然後知松柏之後彫也。」",
          "en": "The Master said, \"When the year becomes cold, then we know how the pine and the cypress are the last to lose their leaves.\""
        },
        {
          "ref": "9:58",
          "zh": "子曰：「知者不惑，仁者不憂，勇者不懼。」",
          "en": "The Master said, \"The wise are free from perplexities; the virtuous from anxiety; and the bold from fear.\""
        },
        {
          "ref": "9:59",
          "zh": "子曰：「可與共學，未可與適道；",
          "en": "The Master said, \"There are some with whom we may study in common, but we shall find them unable to go along with us to principles."
        },
        {
          "ref": "9:60",
          "zh": "可與適道，未可與立；",
          "en": "Perhaps we may go on with them to principles, but we shall find them unable to get established in those along with us."
        },
        {
          "ref": "9:61",
          "zh": "可與立，未可與權。」",
          "en": "Or if we may get so established along with them, we shall find them unable to weigh occurring events along with us.\""
        },
        {
          "ref": "9:62",
          "zh": "「唐棣之華，偏其反而。豈不爾思？室是遠而。」",
          "en": "\"How the flowers of the aspen-plum flutter and turn! Do I not think of you? But your house is distant.\""
        },
        {
          "ref": "9:63",
          "zh": "子曰：「未之思也，夫何遠之有？」",
          "en": "The Master said, \"It is the want of thought about it. How is it distant?\""
        }
      ]
    },
    {
      "number": "10",
      "title": "Xiang Dang",
      "slug": "xiang-dang",
      "passages": [
        {
          "ref": "10:1",
          "zh": "孔子於鄉黨，恂恂如也，似不能言者。",
          "en": "Confucius, in his village, looked simple and sincere, and as if he were not able to speak."
        },
        {
          "ref": "10:2",
          "zh": "其在宗廟朝廷，便便言，唯謹爾。",
          "en": "When he was in the prince's ancestral temple, or in the court, he spoke minutely on every point, but cautiously."
        },
        {
          "ref": "10:3",
          "zh": "朝，與下大夫言，侃侃如也；",
          "en": "When he was waiting at court, in speaking with the great officers of the lower grade, he spoke freely, but in a straightforward manner;"
        },
        {
          "ref": "10:4",
          "zh": "與上大夫言，誾誾如也。",
          "en": "in speaking with those of the higher grade, he did so blandly, but precisely."
        },
        {
          "ref": "10:5",
          "zh": "君在，踧踖如也。與與如也。",
          "en": "When the ruler was present, his manner displayed respectful uneasiness; it was grave, but self-possessed."
        },
        {
          "ref": "10:6",
          "zh": "君召使擯，色勃如也，足躩如也。",
          "en": "When the prince called him to employ him in the reception of a visitor, his countenance appeared to change, and his legs to move forward with difficulty."
        },
        {
          "ref": "10:7",
          "zh": "揖所與立，左右手。衣前後，襜如也。",
          "en": "He inclined himself to the other officers among whom he stood, moving his left or right arm, as their position required, but keeping the skirts of his robe before and behind evenly adjusted."
        },
        {
          "ref": "10:8",
          "zh": "趨進，翼如也。",
          "en": "He hastened forward, with his arms like the wings of a bird."
        },
        {
          "ref": "10:9",
          "zh": "賓退，必復命曰：「賓不顧矣。」",
          "en": "When the guest had retired, he would report to the prince, \"The visitor is not turning round any more.\""
        },
        {
          "ref": "10:10",
          "zh": "入公門，鞠躬如也，如不容。",
          "en": "When he entered the palace gate, he seemed to bend his body, as if it were not sufficient to admit him."
        },
        {
          "ref": "10:11",
          "zh": "立不中門，行不履閾。",
          "en": "When he was standing, he did not occupy the middle of the gateway; when he passed in or out, he did not tread upon the threshold."
        },
        {
          "ref": "10:12",
          "zh": "過位，色勃如也，足躩如也，其言似不足者。",
          "en": "When he was passing the vacant place of the prince, his countenance appeared to change, and his legs to bend under him, and his words came as if he hardly had breath to utter them."
        },
        {
          "ref": "10:13",
          "zh": "攝齊升堂，鞠躬如也，屏氣似不息者。",
          "en": "He ascended the reception hall, holding up his robe with both his hands, and his body bent; holding in his breath also, as if he dared not breathe."
        },
        {
          "ref": "10:14",
          "zh": "出，降一等，逞顏色，怡怡如也。",
          "en": "When he came out from the audience, as soon as he had descended one step, he began to relax his countenance, and had a satisfied look."
        },
        {
          "ref": "10:15",
          "zh": "沒階趨進，翼如也。",
          "en": "When he had got the bottom of the steps, he advanced rapidly to his place, with his arms like wings,"
        },
        {
          "ref": "10:16",
          "zh": "復其位，踧踖如也。",
          "en": "and on occupying it, his manner still showed respectful uneasiness."
        },
        {
          "ref": "10:17",
          "zh": "執圭，鞠躬如也，如不勝。",
          "en": "When he was carrying the scepter of his ruler, he seemed to bend his body, as if he were not able to bear its weight."
        },
        {
          "ref": "10:18",
          "zh": "上如揖，下如授。",
          "en": "He did not hold it higher than the position of the hands in making a bow, nor lower than their position in giving anything to another."
        },
        {
          "ref": "10:19",
          "zh": "勃如戰色，足蹜蹜，如有循。",
          "en": "His countenance seemed to change, and look apprehensive, and he dragged his feet along as if they were held by something to the ground."
        },
        {
          "ref": "10:20",
          "zh": "享禮，有容色。",
          "en": "In presenting the presents with which he was charged, he wore a placid appearance."
        },
        {
          "ref": "10:21",
          "zh": "私覿，愉愉如也。",
          "en": "At his private audience, he looked highly pleased."
        },
        {
          "ref": "10:22",
          "zh": "君子不以紺緅飾。紅紫不以為褻服。",
          "en": "The superior man did not use a deep purple, or a puce color, in the ornaments of his dress. Even in his undress, he did not wear anything of a red or reddish color."
        },
        {
          "ref": "10:23",
          "zh": "當暑，袗絺綌，必表而出之。",
          "en": "In warm weather, he had a single garment either of coarse or fine texture, but he wore it displayed over an inner garment."
        },
        {
          "ref": "10:24",
          "zh": "緇衣羔裘，素衣麑裘，黃衣狐裘。",
          "en": "Over lamb's fur he wore a garment of black; over fawn's fur one of white; and over fox's fur one of yellow."
        },
        {
          "ref": "10:25",
          "zh": "褻裘長。短右袂。",
          "en": "The fur robe of his undress was long, with the right sleeve short."
        },
        {
          "ref": "10:26",
          "zh": "必有寢衣，長一身有半。",
          "en": "He required his sleeping dress to be half as long again as his body."
        },
        {
          "ref": "10:27",
          "zh": "狐貉之厚以居。",
          "en": "When staying at home, he used thick furs of the fox or the badger."
        },
        {
          "ref": "10:28",
          "zh": "去喪，無所不佩。",
          "en": "When he put off mourning, he wore all the appendages of the girdle."
        },
        {
          "ref": "10:29",
          "zh": "非帷裳，必殺之。",
          "en": "His undergarment, except when it was required to be of the curtain shape, was made of silk cut narrow above and wide below."
        },
        {
          "ref": "10:30",
          "zh": "羔裘玄冠不以弔。",
          "en": "He did not wear lamb's fur or a black cap on a visit of condolence."
        },
        {
          "ref": "10:31",
          "zh": "吉月，必朝服而朝。",
          "en": "On the first day of the month he put on his court robes, and presented himself at court."
        },
        {
          "ref": "10:32",
          "zh": "齊，必有明衣，布。",
          "en": "When fasting, he thought it necessary to have his clothes brightly clean and made of linen cloth."
        },
        {
          "ref": "10:33",
          "zh": "齊，必變食，居必遷坐。",
          "en": "When fasting, he thought it necessary to change his food, and also to change the place where he commonly sat in the apartment."
        },
        {
          "ref": "10:34",
          "zh": "食不厭精，膾不厭細。",
          "en": "He did not dislike to have his rice finely cleaned, nor to have his mince meat cut quite small."
        },
        {
          "ref": "10:35",
          "zh": "食饐而餲，魚餒而肉敗，不食。",
          "en": "He did not eat rice which had been injured by heat or damp and turned sour, nor fish or flesh which was gone."
        },
        {
          "ref": "10:36",
          "zh": "色惡，不食。臭惡，不食。失飪，不食。不時，不食。",
          "en": "He did not eat what was discolored, or what was of a bad flavor, nor anything which was ill-cooked, or was not in season."
        },
        {
          "ref": "10:37",
          "zh": "割不正，不食。不得其醬，不食。",
          "en": "He did not eat meat which was not cut properly, nor what was served without its proper sauce."
        },
        {
          "ref": "10:38",
          "zh": "肉雖多，不使勝食氣。",
          "en": "Though there might be a large quantity of meat, he would not allow what he took to exceed the due proportion for the rice."
        },
        {
          "ref": "10:39",
          "zh": "惟酒無量，不及亂。",
          "en": "It was only in wine that he laid down no limit for himself, but he did not allow himself to be confused by it."
        },
        {
          "ref": "10:40",
          "zh": "沽酒市脯不食。",
          "en": "He did not partake of wine and dried meat bought in the market."
        },
        {
          "ref": "10:41",
          "zh": "不撤薑食。不多食。",
          "en": "He was never without ginger when he ate. He did not eat much."
        },
        {
          "ref": "10:42",
          "zh": "祭於公，不宿肉。",
          "en": "When he had been assisting at the prince's sacrifice, he did not keep the flesh which he received overnight."
        },
        {
          "ref": "10:43",
          "zh": "祭肉不出三日。出三日，不食之矣。",
          "en": "The flesh of his family sacrifice he did not keep over three days. If kept over three days, people could not eat it."
        },
        {
          "ref": "10:44",
          "zh": "食不語，寢不言。",
          "en": "When eating, he did not converse. When in bed, he did not speak."
        },
        {
          "ref": "10:45",
          "zh": "雖疏食菜羹，瓜祭，必齊如也。",
          "en": "Although his food might be coarse rice and vegetable soup, he would offer a little of it in sacrifice with a grave, respectful air."
        },
        {
          "ref": "10:46",
          "zh": "席不正，不坐。",
          "en": "If his mat was not straight, he did not sit on it."
        },
        {
          "ref": "10:47",
          "zh": "鄉人飲酒，杖者出，斯出矣。",
          "en": "When the villagers were drinking together, upon those who carried staffs going out, he went out immediately after."
        },
        {
          "ref": "10:48",
          "zh": "鄉人儺，朝服而立於阼階。",
          "en": "When the villagers were going through their ceremonies to drive away pestilential influences, he put on his court robes and stood on the eastern steps."
        },
        {
          "ref": "10:49",
          "zh": "問人於他邦，再拜而送之。",
          "en": "When he was sending complimentary inquiries to any one in another state, he bowed twice as he escorted the messenger away."
        },
        {
          "ref": "10:50",
          "zh": "康子饋藥，拜而受之。",
          "en": "Ji Kang having sent him a present of physic, he bowed and received it,"
        },
        {
          "ref": "10:51",
          "zh": "曰：「丘未達，不敢嘗。」",
          "en": "saying, \"I do not know it. I dare not taste it.\""
        },
        {
          "ref": "10:52",
          "zh": "廄焚。子退朝，曰：「傷人乎？」不問馬。",
          "en": "The stable being burned down, when he was at court, on his return he said, \"Has any man been hurt?\" He did not ask about the horses."
        },
        {
          "ref": "10:53",
          "zh": "君賜食，必正席先嘗之；",
          "en": "When the prince sent him a gift of cooked meat, he would adjust his mat, first taste it, and then give it away to others."
        },
        {
          "ref": "10:54",
          "zh": "君賜腥，必熟而薦之；",
          "en": "When the prince sent him a gift of undressed meat, he would have it cooked, and offer it to the spirits of his ancestors."
        },
        {
          "ref": "10:55",
          "zh": "君賜生，必畜之。",
          "en": "When the prince sent him a gift of a living animal, he would keep it alive."
        },
        {
          "ref": "10:56",
          "zh": "侍食於君，君祭，先飯。",
          "en": "When he was in attendance on the prince and joining in the entertainment, the prince only sacrificed. He first tasted everything."
        },
        {
          "ref": "10:57",
          "zh": "疾，君視之，東首，加朝服，拖紳。",
          "en": "When he was ill and the prince came to visit him, he had his head to the east, made his court robes be spread over him, and drew his girdle across them."
        },
        {
          "ref": "10:58",
          "zh": "君命召，不俟駕行矣。",
          "en": "When the prince's order called him, without waiting for his carriage to be yoked, he went at once."
        },
        {
          "ref": "10:59",
          "zh": "入太廟，每事問。",
          "en": "When he entered the ancestral temple of the state, he asked about everything."
        },
        {
          "ref": "10:60",
          "zh": "朋友死，無所歸。曰：「於我殯。」",
          "en": "When any of his friends died, if he had no relations who could be depended on for the necessary offices, he would say, \"I will bury him.\""
        },
        {
          "ref": "10:61",
          "zh": "朋友之饋，雖車馬，非祭肉，不拜。",
          "en": "When a friend sent him a present, though it might be a carriage and horses, he did not bow. The only present for which he bowed was that of the flesh of sacrifice."
        },
        {
          "ref": "10:62",
          "zh": "寢不尸，居不容。",
          "en": "In bed, he did not lie like a corpse. At home, he did not put on any formal deportment."
        },
        {
          "ref": "10:63",
          "zh": "見齊衰者，雖狎，必變。",
          "en": "When he saw any one in a mourning dress, though it might be an acquaintance, he would change countenance;"
        },
        {
          "ref": "10:64",
          "zh": "見冕者與瞽者，雖褻，必以貌。",
          "en": "when he saw any one wearing the cap of full dress, or a blind person, though he might be in his undress, he would salute him in a ceremonious manner."
        },
        {
          "ref": "10:65",
          "zh": "凶服者式之。式負版者。",
          "en": "To any person in mourning he bowed forward to the crossbar of his carriage; he bowed in the same way to any one bearing the tables of population."
        },
        {
          "ref": "10:66",
          "zh": "有盛饌，必變色而作。",
          "en": "When he was at an entertainment where there was an abundance of provisions set before him, he would change countenance and rise up."
        },
        {
          "ref": "10:67",
          "zh": "迅雷風烈，必變。",
          "en": "On a sudden clap of thunder, or a violent wind, he would change countenance."
        },
        {
          "ref": "10:68",
          "zh": "升車，必正立執綏。",
          "en": "When he was about to mount his carriage, he would stand straight, holding the cord."
        },
        {
          "ref": "10:69",
          "zh": "車中，不內顧，不疾言，不親指。",
          "en": "When he was in the carriage, he did not turn his head quite round, he did not talk hastily, he did not point with his hands."
        },
        {
          "ref": "10:70",
          "zh": "色斯舉矣，翔而後集。",
          "en": "Seeing the countenance, it instantly rises. It flies round, and by and by settles."
        },
        {
          "ref": "10:71",
          "zh": "曰：「山梁雌雉，時哉！時哉！」",
          "en": "The Master said, \"There is the hen-pheasant on the hill bridge. At its season! At its season!\""
        },
        {
          "ref": "10:72",
          "zh": "子路共之，三嗅而作。",
          "en": "Zi Lu made a motion to it. Thrice it smelled him and then rose."
        }
      ]
    },
    {
      "number": "11",
      "title": "Xian Jin",
      "slug": "xian-jin",
      "passages": [
        {
          "ref": "11:1",
          "zh": "子曰：「先進於禮樂，野人也；",
          "en": "The Master said, \"The men of former times in the matters of ceremonies and music were rustics, it is said,"
        },
        {
          "ref": "11:2",
          "zh": "後進於禮樂，君子也。",
          "en": "while the men of these latter times, in ceremonies and music, are accomplished gentlemen."
        },
        {
          "ref": "11:3",
          "zh": "如用之，則吾從先進。」",
          "en": "If I have occasion to use those things, I follow the men of former times.\""
        },
        {
          "ref": "11:4",
          "zh": "子曰：「從我於陳、蔡者，皆不及門也。」",
          "en": "The Master said, \"Of those who were with me in Chen and Cai, there are none to be found to enter my door.\""
        },
        {
          "ref": "11:5",
          "zh": "德行：顏淵，閔子騫，冉伯牛，仲弓。言語：宰我，子貢。政事：冉有，季路。文學：子游，子夏。",
          "en": "Distinguished for their virtuous principles and practice, there were Yan Yuan, Min Zi Qian, Ran Bo Niu, and Zhong Gong; for their ability in speech, Zai Wo and Zi Gong; for their administrative talents, Ran You and Ji Lu; for their literary acquirements, Zi You and Zi Xia."
        },
        {
          "ref": "11:6",
          "zh": "子曰：「回也非助我者也，於吾言無所不說。」",
          "en": "The Master said, \"Hui gives me no assistance. There is nothing that I say in which he does not delight.\""
        },
        {
          "ref": "11:7",
          "zh": "子曰：「孝哉閔子騫！人不間於其父母昆弟之言。」",
          "en": "The Master said, \"Filial indeed is Min Zi Qian! Other people say nothing of him different from the report of his parents and brothers.\""
        },
        {
          "ref": "11:8",
          "zh": "南容三復白圭，孔子以其兄之子妻之。",
          "en": "Nan Rong was frequently repeating the lines about a white scepter stone. Confucius gave him the daughter of his elder brother to wife."
        },
        {
          "ref": "11:9",
          "zh": "季康子問：「弟子孰為好學？」",
          "en": "Ji Kang asked which of the disciples loved to learn."
        },
        {
          "ref": "11:10",
          "zh": "孔子對曰：「有顏回者好學，不幸短命死矣！今也則亡。」",
          "en": "Confucius replied to him, \"There was Yan Hui; he loved to learn. Unfortunately his appointed time was short, and he died. Now there is no one who loves to learn, as he did.\""
        },
        {
          "ref": "11:11",
          "zh": "顏淵死，顏路請子之車以為之椁。",
          "en": "When Yan Yuan died, Yan Lu begged the carriage of the Master to sell and get an outer shell for his son's coffin."
        },
        {
          "ref": "11:12",
          "zh": "子曰：「才不才，亦各言其子也。",
          "en": "The Master said, \"Whether he has talents or has not talents, everyone calls his son his son."
        },
        {
          "ref": "11:13",
          "zh": "鯉也死，有棺而無椁。",
          "en": "There was Li; when he died, he had a coffin but no outer shell."
        },
        {
          "ref": "11:14",
          "zh": "吾不徒行以為之椁。以吾從大夫之後，不可徒行也。」",
          "en": "I would not walk on foot to get a shell for him, because, having followed in the rear of the great officers, it was not proper that I should walk on foot.\""
        },
        {
          "ref": "11:15",
          "zh": "顏淵死。子曰：「噫！天喪予！天喪予！」",
          "en": "When Yan Yuan died, the Master said, \"Alas! Heaven is destroying me! Heaven is destroying me!\""
        },
        {
          "ref": "11:16",
          "zh": "顏淵死，子哭之慟。",
          "en": "When Yan Yuan died, the Master bewailed him exceedingly,"
        },
        {
          "ref": "11:17",
          "zh": "從者曰：「子慟矣。」",
          "en": "and the disciples who were with him said, \"Master, your grief is excessive!\""
        },
        {
          "ref": "11:18",
          "zh": "曰：「有慟乎？非夫人之為慟而誰為！」",
          "en": "\"Is it excessive?\" said he. \"If I am not to mourn bitterly for this man, for whom should I mourn?\""
        },
        {
          "ref": "11:19",
          "zh": "顏淵死，門人欲厚葬之，子曰：「不可。」",
          "en": "When Yan Yuan died, the disciples wished to give him a great funeral, and the Master said, \"You may not do so.\""
        },
        {
          "ref": "11:20",
          "zh": "門人厚葬之。",
          "en": "The disciples did bury him in great style."
        },
        {
          "ref": "11:21",
          "zh": "子曰：「回也視予猶父也，予不得視猶子也。非我也，夫二三子也。」",
          "en": "The Master said, \"Hui behaved towards me as his father. I have not been able to treat him as my son. The fault is not mine; it belongs to you, O disciples.\""
        },
        {
          "ref": "11:22",
          "zh": "季路問事鬼神。",
          "en": "Ji Lu asked about serving the spirits of the dead."
        },
        {
          "ref": "11:23",
          "zh": "子曰：「未能事人，焉能事鬼？」",
          "en": "The Master said, \"While you are not able to serve men, how can you serve their spirits?\""
        },
        {
          "ref": "11:24",
          "zh": "敢問死。曰：「未知生，焉知死？」",
          "en": "Ji Lu added, \"I venture to ask about death?\" He was answered, \"While you do not know life, how can you know about death?\""
        },
        {
          "ref": "11:25",
          "zh": "閔子侍側，誾誾如也；",
          "en": "The disciple Min was standing by his side, looking bland and precise;"
        },
        {
          "ref": "11:26",
          "zh": "子路，行行如也；",
          "en": "Zi Lu, looking bold and soldierly;"
        },
        {
          "ref": "11:27",
          "zh": "冉有、子貢，侃侃如也。子樂。",
          "en": "Ran You and Zi Gong, with a free and straightforward manner. The Master was pleased."
        },
        {
          "ref": "11:28",
          "zh": "「若由也，不得其死然。」",
          "en": "He said, \"You there - he will not die a natural death.\""
        },
        {
          "ref": "11:29",
          "zh": "魯人為長府。",
          "en": "Some parties in Lu were going to take down and rebuild the Long Treasury."
        },
        {
          "ref": "11:30",
          "zh": "閔子騫曰：「仍舊貫，如之何？何必改作？」",
          "en": "Min Zi Qian said, \"Suppose it were to be repaired after its old style; why must it be altered and made anew?\""
        },
        {
          "ref": "11:31",
          "zh": "子曰：「夫人不言，言必有中。」",
          "en": "The Master said, \"This man seldom speaks; when he does, he is sure to hit the point.\""
        },
        {
          "ref": "11:32",
          "zh": "子曰：「由之瑟奚為於丘之門？」",
          "en": "The Master said, \"What has the lute of You to do in my door?\""
        },
        {
          "ref": "11:33",
          "zh": "門人不敬子路。",
          "en": "The other disciples began not to respect Zi Lu."
        },
        {
          "ref": "11:34",
          "zh": "子曰：「由也升堂矣，未入於室也。」",
          "en": "The Master said, \"You has ascended to the hall, though he has not yet passed into the inner apartments.\""
        },
        {
          "ref": "11:35",
          "zh": "子貢問：「師與商也孰賢？」",
          "en": "Zi Gong asked which of the two, Shi or Shang, was the superior."
        },
        {
          "ref": "11:36",
          "zh": "子曰：「師也過，商也不及。」",
          "en": "The Master said, \"Shi goes beyond the due mean, and Shang does not come up to it.\""
        },
        {
          "ref": "11:37",
          "zh": "曰：「然則師愈與？」",
          "en": "\"Then,\" said Zi Gong, \"the superiority is with Shi, I suppose.\""
        },
        {
          "ref": "11:38",
          "zh": "子曰：「過猶不及。」",
          "en": "The Master said, \"To go beyond is as wrong as to fall short.\""
        },
        {
          "ref": "11:39",
          "zh": "季氏富於周公，而求也為之聚斂而附益之。",
          "en": "The head of the Ji family was richer than the duke of Zhou had been, and yet Qiu collected his imposts for him, and increased his wealth."
        },
        {
          "ref": "11:40",
          "zh": "子曰：「非吾徒也。小子鳴鼓而攻之，可也。」",
          "en": "The Master said, \"He is no disciple of mine. My little children, beat the drum and assail him.\""
        },
        {
          "ref": "11:41",
          "zh": "柴也愚，參也魯，師也辟，由也喭。",
          "en": "Chai is simple. Shen is dull. Shi is specious. You is coarse."
        },
        {
          "ref": "11:42",
          "zh": "子曰：「回也其庶乎，屢空。",
          "en": "The Master said, \"There is Hui! He has nearly attained to perfect virtue. He is often in want."
        },
        {
          "ref": "11:43",
          "zh": "賜不受命，而貨殖焉，億則屢中。」",
          "en": "Ci does not acquiesce in the appointments of Heaven, and his goods are increased by him. Yet his judgments are often correct.\""
        },
        {
          "ref": "11:44",
          "zh": "子張問善人之道。",
          "en": "Zi Zhang asked what were the characteristics of the good man."
        },
        {
          "ref": "11:45",
          "zh": "子曰：「不踐跡，亦不入於室。」",
          "en": "The Master said, \"He does not tread in the footsteps of others, but moreover, he does not enter the chamber of the sage.\""
        },
        {
          "ref": "11:46",
          "zh": "子曰：「論篤是與，君子者乎？色莊者乎？」",
          "en": "The Master said, \"If, because a man's discourse appears solid and sincere, we allow him to be a good man, is he really a superior man? or is his gravity only in appearance?\""
        },
        {
          "ref": "11:47",
          "zh": "子路問：「聞斯行諸？」",
          "en": "Zi Lu asked whether he should immediately carry into practice what he heard."
        },
        {
          "ref": "11:48",
          "zh": "子曰：「有父兄在，如之何其聞斯行之？」",
          "en": "The Master said, \"There are your father and elder brothers to be consulted - why should you act on that principle of immediately carrying into practice what you hear?\""
        },
        {
          "ref": "11:49",
          "zh": "冉有問：「聞斯行諸？」子曰：「聞斯行之。」",
          "en": "Ran You asked the same, whether he should immediately carry into practice what he heard, and the Master answered, \"Immediately carry into practice what you hear.\""
        },
        {
          "ref": "11:50",
          "zh": "公西華曰：「由也問聞斯行諸，子曰『有父兄在』；求也問聞斯行諸，子曰『聞斯行之』。赤也惑，敢問。」",
          "en": "Gong Xi Hua said, \"You asked whether he should carry immediately into practice what he heard, and you said, 'There are your father and elder brothers to be consulted.' Qiu asked whether he should immediately carry into practice what he heard, and you said, 'Carry it immediately into practice.' I, Chi, am perplexed, and venture to ask you for an explanation.\""
        },
        {
          "ref": "11:51",
          "zh": "子曰：「求也退，故進之；由也兼人，故退之。」",
          "en": "The Master said, \"Qiu is retiring and slow; therefore I urged him forward. You has more than his own share of energy; therefore I kept him back.\""
        },
        {
          "ref": "11:52",
          "zh": "子畏於匡，顏淵後。",
          "en": "The Master was put in fear in Kuang and Yan Yuan fell behind."
        },
        {
          "ref": "11:53",
          "zh": "子曰：「吾以女為死矣。」",
          "en": "The Master, on his rejoining him, said, \"I thought you had died.\""
        },
        {
          "ref": "11:54",
          "zh": "曰：「子在，回何敢死？」",
          "en": "Hui replied, \"While you were alive, how should I presume to die?\""
        },
        {
          "ref": "11:55",
          "zh": "季子然問：「仲由、冉求可謂大臣與？」",
          "en": "Ji Zi Ran asked whether Zhong You and Ran Qiu could be called great ministers."
        },
        {
          "ref": "11:56",
          "zh": "子曰：「吾以子為異之問，曾由與求之問。",
          "en": "The Master said, \"I thought you would ask about some extraordinary individuals, and you only ask about You and Qiu!"
        },
        {
          "ref": "11:57",
          "zh": "所謂大臣者：以道事君，不可則止。",
          "en": "What is called a great minister, is one who serves his prince according to what is right, and when he finds he cannot do so, retires."
        },
        {
          "ref": "11:58",
          "zh": "今由與求也，可謂具臣矣。」",
          "en": "Now, as to You and Qiu, they may be called ordinary ministers.\""
        },
        {
          "ref": "11:59",
          "zh": "曰：「然則從之者與？」",
          "en": "Zi Ran said, \"Then they will always follow their chief - will they?\""
        },
        {
          "ref": "11:60",
          "zh": "子曰：「弒父與君，亦不從也。」",
          "en": "The Master said, \"In an act of parricide or regicide, they would not follow him.\""
        },
        {
          "ref": "11:61",
          "zh": "子路使子羔為費宰。",
          "en": "Zi Lu got Zi Gao appointed governor of Fei."
        },
        {
          "ref": "11:62",
          "zh": "子曰：「賊夫人之子。」",
          "en": "The Master said, \"You are injuring a man's son.\""
        },
        {
          "ref": "11:63",
          "zh": "子路曰：「有民人焉，有社稷焉。何必讀書，然後為學？」",
          "en": "Zi Lu said, \"There are (there) common people and officers; there are the altars of the spirits of the land and grain. Why must one read books before he can be considered to have learned?\""
        },
        {
          "ref": "11:64",
          "zh": "子曰：「是故惡夫佞者。」",
          "en": "The Master said, \"It is on this account that I hate your glib-tongued people.\""
        },
        {
          "ref": "11:65",
          "zh": "子路、曾皙、冉有、公西華侍坐。",
          "en": "Zi Lu, Zeng Xi, Ran You, and Gong Xi Hua were sitting by the Master."
        },
        {
          "ref": "11:66",
          "zh": "子曰：「以吾一日長乎爾，毋吾以也。",
          "en": "He said to them, \"Though I am a day or so older than you, do not think of that."
        },
        {
          "ref": "11:67",
          "zh": "居則曰：「不吾知也！』如或知爾，則何以哉？」",
          "en": "From day to day you are saying, 'We are not known.' If some ruler were to know you, what would you like to do?\""
        },
        {
          "ref": "11:68",
          "zh": "子路率爾而對曰：「千乘之國，攝乎大國之間，加之以師旅，因之以饑饉；",
          "en": "Zi Lu hastily and lightly replied, \"Suppose the case of a state of ten thousand chariots; let it be straitened between other large states; let it be suffering from invading armies; and to this let there be added a famine in corn and in all vegetables -"
        },
        {
          "ref": "11:69",
          "zh": "由也為之，比及三年，可使有勇，且知方也。」",
          "en": "if I were intrusted with the government of it, in three years' time I could make the people to be bold, and to recognize the rules of righteous conduct.\""
        },
        {
          "ref": "11:70",
          "zh": "夫子哂之。",
          "en": "The Master smiled at him."
        },
        {
          "ref": "11:71",
          "zh": "「求！爾何如？」",
          "en": "Turning to Ran You, he said, \"Qiu, what are your wishes?\""
        },
        {
          "ref": "11:72",
          "zh": "對曰：「方六七十，如五六十，求也為之，比及三年，可使足民。",
          "en": "Qiu replied, \"Suppose a state of sixty or seventy li square, or one of fifty or sixty, and let me have the government of it - in three years' time, I could make plenty to abound among the people."
        },
        {
          "ref": "11:73",
          "zh": "如其禮樂，以俟君子。」",
          "en": "As to teaching them the principles of propriety, and music, I must wait for the rise of a superior man to do that.\""
        },
        {
          "ref": "11:74",
          "zh": "「赤！爾何如？」",
          "en": "\"What are your wishes, Chi,\" said the Master next to Gong Xi Hua."
        },
        {
          "ref": "11:75",
          "zh": "對曰：「非曰能之，願學焉。宗廟之事，如會同，端章甫，願為小相焉。」",
          "en": "Chi replied, \"I do not say that my ability extends to these things, but I should wish to learn them. At the services of the ancestral temple, and at the audiences of the princes with the sovereign, I should like, dressed in the dark square-made robe and the black linen cap, to act as a small assistant.\""
        },
        {
          "ref": "11:76",
          "zh": "「點！爾何如？」",
          "en": "Last of all, the Master asked Zeng Xi, \"Dian, what are your wishes?\""
        },
        {
          "ref": "11:77",
          "zh": "鼓瑟希，鏗爾，舍瑟而作。",
          "en": "Dian, pausing as he was playing on his lute, while it was yet twanging, laid the instrument aside, and rose."
        },
        {
          "ref": "11:78",
          "zh": "對曰：「異乎三子者之撰。」",
          "en": "He said, \"My wishes are different from the cherished purposes of these three gentlemen.\""
        },
        {
          "ref": "11:79",
          "zh": "子曰：「何傷乎？亦各言其志也。」",
          "en": "Said the Master, \"What harm is there in that? Do you also, as well as they, speak out your wishes.\""
        },
        {
          "ref": "11:80",
          "zh": "曰：「莫春者，春服既成。冠者五六人，童子六七人，浴乎沂，風乎舞雩，詠而歸。」",
          "en": "Dian then said, \"In this, the last month of spring, with the dress of the season all complete, along with five or six young men who have assumed the cap, and six or seven boys, I would wash in the Yi, enjoy the breeze among the rain altars, and return home singing.\""
        },
        {
          "ref": "11:81",
          "zh": "夫子喟然歎曰：「吾與點也！」",
          "en": "The Master heaved a sigh and said, \"I give my approval to Dian.\""
        },
        {
          "ref": "11:82",
          "zh": "三子者出，曾皙後。",
          "en": "The three others having gone out, Zeng Xi remained behind,"
        },
        {
          "ref": "11:83",
          "zh": "曾皙曰：「夫三子者之言何如？」",
          "en": "and said, \"What do you think of the words of these three friends?\""
        },
        {
          "ref": "11:84",
          "zh": "子曰：「亦各言其志也已矣。」",
          "en": "The Master replied, \"They simply told each one his wishes.\""
        },
        {
          "ref": "11:85",
          "zh": "曰：「夫子何哂由也？」",
          "en": "Xi pursued, \"Master, why did you smile at You?\""
        },
        {
          "ref": "11:86",
          "zh": "曰：「為國以禮，其言不讓，是故哂之。」",
          "en": "He was answered, \"The management of a state demands the rules of propriety. His words were not humble; therefore I smiled at him.\""
        },
        {
          "ref": "11:87",
          "zh": "「唯求則非邦也與？」",
          "en": "Xi again said, \"But was it not a state which Qiu proposed for himself?\""
        },
        {
          "ref": "11:88",
          "zh": "「安見方六七十如五六十而非邦也者？」",
          "en": "The reply was, \"Yes; did you ever see a territory of sixty or seventy li or one of fifty or sixty, which was not a state?\""
        },
        {
          "ref": "11:89",
          "zh": "「唯赤則非邦也與？」",
          "en": "Once more, Xi inquired, \"And was it not a state which Chi proposed for himself?\""
        },
        {
          "ref": "11:90",
          "zh": "「宗廟會同，非諸侯而何？赤也為之小，孰能為之大？」",
          "en": "The Master again replied, \"Yes; who but princes have to do with ancestral temples, and with audiences but the sovereign? If Chi were to be a small assistant in these services, who could be a great one?\""
        }
      ]
    },
    {
      "number": "12",
      "title": "Yan Yuan",
      "slug": "yan-yuan",
      "passages": [
        {
          "ref": "12:1",
          "zh": "顏淵問仁。",
          "en": "Yan Yuan asked about perfect virtue."
        },
        {
          "ref": "12:2",
          "zh": "子曰：「克己復禮為仁。",
          "en": "The Master said, \"To subdue one's self and return to propriety, is perfect virtue."
        },
        {
          "ref": "12:3",
          "zh": "一日克己復禮，天下歸仁焉。",
          "en": "If a man can for one day subdue himself and return to propriety, all under heaven will ascribe perfect virtue to him."
        },
        {
          "ref": "12:4",
          "zh": "為仁由己，而由人乎哉？」",
          "en": "Is the practice of perfect virtue from a man himself, or is it from others?\""
        },
        {
          "ref": "12:5",
          "zh": "顏淵曰：「請問其目。」",
          "en": "Yan Yuan said, \"I beg to ask the steps of that process.\""
        },
        {
          "ref": "12:6",
          "zh": "子曰：「非禮勿視，非禮勿聽，非禮勿言，非禮勿動。」",
          "en": "The Master replied, \"Look not at what is contrary to propriety; listen not to what is contrary to propriety; speak not what is contrary to propriety; make no movement which is contrary to propriety.\""
        },
        {
          "ref": "12:7",
          "zh": "顏淵曰：「回雖不敏，請事斯語矣。」",
          "en": "Yan Yuan then said, \"Though I am deficient in intelligence and vigor, I will make it my business to practice this lesson.\""
        },
        {
          "ref": "12:8",
          "zh": "仲弓問仁。",
          "en": "Zhong Gong asked about perfect virtue."
        },
        {
          "ref": "12:9",
          "zh": "子曰：「出門如見大賓，使民如承大祭。",
          "en": "The Master said, \"It is, when you go abroad, to behave to every one as if you were receiving a great guest; to employ the people as if you were assisting at a great sacrifice;"
        },
        {
          "ref": "12:10",
          "zh": "己所不欲，勿施於人。",
          "en": "not to do to others as you would not wish done to yourself;"
        },
        {
          "ref": "12:11",
          "zh": "在邦無怨，在家無怨。」",
          "en": "to have no murmuring against you in the country, and none in the family.\""
        },
        {
          "ref": "12:12",
          "zh": "仲弓曰：「雍雖不敏，請事斯語矣。」",
          "en": "Zhong Gong said, \"Though I am deficient in intelligence and vigor, I will make it my business to practice this lesson.\""
        },
        {
          "ref": "12:13",
          "zh": "司馬牛問仁。",
          "en": "Si Ma Niu asked about perfect virtue."
        },
        {
          "ref": "12:14",
          "zh": "子曰：「仁者其言也訒。」",
          "en": "The Master said, \"The man of perfect virtue is cautious and slow in his speech.\""
        },
        {
          "ref": "12:15",
          "zh": "曰：「其言也訒，斯謂之仁已乎？」",
          "en": "Niu replied, \"Cautious and slow in his speech! Is this what is meant by perfect virtue?\""
        },
        {
          "ref": "12:16",
          "zh": "子曰：「為之難，言之得無訒乎？」",
          "en": "The Master said, \"When a man feels the difficulty of doing, can he be other than cautious and slow in speaking?\""
        },
        {
          "ref": "12:17",
          "zh": "司馬牛問君子。",
          "en": "Si Ma Niu asked about the superior man."
        },
        {
          "ref": "12:18",
          "zh": "子曰：「君子不憂不懼。」",
          "en": "The Master said, \"The superior man has neither anxiety nor fear.\""
        },
        {
          "ref": "12:19",
          "zh": "曰：「不憂不懼，斯謂之君子已乎？」",
          "en": "Niu said, \"Being without anxiety or fear! Does this constitute what we call the superior man?\""
        },
        {
          "ref": "12:20",
          "zh": "子曰：「內省不疚，夫何憂何懼？」",
          "en": "The Master said, \"When internal examination discovers nothing wrong, what is there to be anxious about, what is there to fear?\""
        },
        {
          "ref": "12:21",
          "zh": "司馬牛憂曰：「人皆有兄弟，我獨亡。」",
          "en": "Si Ma Niu, full of anxiety, said, \"Other men all have their brothers, I only have not.\""
        },
        {
          "ref": "12:22",
          "zh": "子夏曰：「商聞之矣：死生有命，富貴在天。",
          "en": "Zi Xia said to him, \"There is the following saying which I have heard - 'Death and life have their determined appointment; riches and honors depend upon Heaven.'"
        },
        {
          "ref": "12:23",
          "zh": "君子敬而無失，與人恭而有禮。",
          "en": "Let the superior man never fail reverentially to order his own conduct, and let him be respectful to others and observant of propriety -"
        },
        {
          "ref": "12:24",
          "zh": "四海之內，皆兄弟也。君子何患乎無兄弟也？」",
          "en": "then all within the four seas will be his brothers. What has the superior man to do with being distressed because he has no brothers?\""
        },
        {
          "ref": "12:25",
          "zh": "子張問明。",
          "en": "Zi Zhang asked what constituted intelligence."
        },
        {
          "ref": "12:26",
          "zh": "子曰：「浸潤之譖，膚受之愬，不行焉。可謂明也已矣。",
          "en": "The Master said, \"He with whom neither slander that gradually soaks into the mind, nor statements that startle like a wound in the flesh, are successful, may be called intelligent indeed."
        },
        {
          "ref": "12:27",
          "zh": "浸潤之譖膚受之愬不行焉，可謂遠也已矣。」",
          "en": "Yea, he with whom neither soaking slander, nor startling statements, are successful, may be called farseeing.\""
        },
        {
          "ref": "12:28",
          "zh": "子貢問政。",
          "en": "Zi Gong asked about government."
        },
        {
          "ref": "12:29",
          "zh": "子曰：「足食。足兵。民信之矣。」",
          "en": "The Master said, \"The requisites of government are that there be sufficiency of food, sufficiency of military equipment, and the confidence of the people in their ruler.\""
        },
        {
          "ref": "12:30",
          "zh": "子貢曰：「必不得已而去，於斯三者何先？」曰：「去兵。」",
          "en": "Zi Gong said, \"If it cannot be helped, and one of these must be dispensed with, which of the three should be foregone first?\" \"The military equipment,\" said the Master."
        },
        {
          "ref": "12:31",
          "zh": "子貢曰：「必不得已而去，於斯二者何先？」",
          "en": "Zi Gong again asked, \"If it cannot be helped, and one of the remaining two must be dispensed with, which of them should be foregone?\""
        },
        {
          "ref": "12:32",
          "zh": "曰：「去食。自古皆有死，民無信不立。」",
          "en": "The Master answered, \"Part with the food. From of old, death has been the lot of all men; but if the people have no faith in their rulers, there is no standing for the state.\""
        },
        {
          "ref": "12:33",
          "zh": "棘子成曰：「君子質而已矣，何以文為？」",
          "en": "Ji Zi Cheng said, \"In a superior man it is only the substantial qualities which are wanted; why should we seek for ornamental accomplishments?\""
        },
        {
          "ref": "12:34",
          "zh": "子貢曰：「惜乎！夫子之說，君子也。駟不及舌。",
          "en": "Zi Gong said, \"Alas! Your words, sir, show you to be a superior man, but four horses cannot overtake the tongue."
        },
        {
          "ref": "12:35",
          "zh": "文猶質也，質猶文也。虎豹之鞟，猶犬羊之鞟。」",
          "en": "Ornament is as substance; substance is as ornament. The hide of a tiger or a leopard stripped of its hair, is like the hide of a dog or a goat stripped of its hair.\""
        },
        {
          "ref": "12:36",
          "zh": "哀公問於有若曰：「年饑，用不足，如之何？」",
          "en": "The duke Ai inquired of You Ruo, saying, \"The year is one of scarcity, and the returns for expenditure are not sufficient - what is to be done?\""
        },
        {
          "ref": "12:37",
          "zh": "有若對曰：「盍徹乎？」",
          "en": "You Ruo replied to him, \"Why not simply tithe the people?\""
        },
        {
          "ref": "12:38",
          "zh": "曰：「二，吾猶不足，如之何其徹也？」",
          "en": "The duke replied, \"With two tenths I find it not enough - how could I do with that system of one tenth?\""
        },
        {
          "ref": "12:39",
          "zh": "對曰：「百姓足，君孰與不足？百姓不足，君孰與足？」",
          "en": "You Ruo answered, \"If the people have plenty, their prince will not be left to want alone. If the people are in want, their prince cannot enjoy plenty alone.\""
        },
        {
          "ref": "12:40",
          "zh": "子張問崇德、辨惑。",
          "en": "Zi Zhang asked how virtue was to be exalted, and delusions to be discovered."
        },
        {
          "ref": "12:41",
          "zh": "子曰：「主忠信，徙義，崇德也。",
          "en": "The Master said, \"Hold faithfulness and sincerity as first principles, and be moving continually to what is right - this is the way to exalt one's virtue."
        },
        {
          "ref": "12:42",
          "zh": "愛之欲其生，惡之欲其死。既欲其生，又欲其死，是惑也。",
          "en": "You love a man and wish him to live; you hate him and wish him to die. Having wished him to live, you also wish him to die. This is a case of delusion."
        },
        {
          "ref": "12:43",
          "zh": "『誠不以富，亦祗以異。』」",
          "en": "'It may not be on account of her being rich, yet you come to make a difference.'\""
        },
        {
          "ref": "12:44",
          "zh": "齊景公問政於孔子。",
          "en": "The duke Jing, of Qi, asked Confucius about government."
        },
        {
          "ref": "12:45",
          "zh": "孔子對曰：「君君，臣臣，父父，子子。」",
          "en": "Confucius replied, \"There is government, when the prince is prince, and the minister is minister; when the father is father, and the son is son.\""
        },
        {
          "ref": "12:46",
          "zh": "公曰：「善哉！信如君不君，臣不臣，父不父，子不子，雖有粟，吾得而食諸？」",
          "en": "\"Good!\" said the duke; \"if, indeed, the prince be not prince, the minister not minister, the father not father, and the son not son, although I have my revenue, can I enjoy it?\""
        },
        {
          "ref": "12:47",
          "zh": "子曰：「片言可以折獄者，其由也與？」",
          "en": "The Master said, \"Ah! it is You, who could with half a word settle litigations!\""
        },
        {
          "ref": "12:48",
          "zh": "子路無宿諾。",
          "en": "Zi Lu never slept over a promise."
        },
        {
          "ref": "12:49",
          "zh": "子曰：「聽訟，吾猶人也，必也使無訟乎！」",
          "en": "The Master said, \"In hearing litigations, I am like any other body. What is necessary, however, is to cause the people to have no litigations.\""
        },
        {
          "ref": "12:50",
          "zh": "子張問政。",
          "en": "Zi Zhang asked about government."
        },
        {
          "ref": "12:51",
          "zh": "子曰：「居之無倦，行之以忠。」",
          "en": "The Master said, \"The art of governing is to keep its affairs before the mind without weariness, and to practice them with undeviating consistency.\""
        },
        {
          "ref": "12:52",
          "zh": "子曰：「君子博學於文，約之以禮，亦可以弗畔矣夫！」",
          "en": "The Master said, \"By extensively studying all learning, and keeping himself under the restraint of the rules of propriety, one may thus likewise not err from what is right.\""
        },
        {
          "ref": "12:53",
          "zh": "子曰：「君子成人之美，不成人之惡。小人反是。」",
          "en": "The Master said, \"The superior man seeks to perfect the admirable qualities of men, and does not seek to perfect their bad qualities. The mean man does the opposite of this.\""
        },
        {
          "ref": "12:54",
          "zh": "季康子問政於孔子。",
          "en": "Ji Kang asked Confucius about government."
        },
        {
          "ref": "12:55",
          "zh": "孔子對曰：「政者，正也。子帥以正，孰敢不正？」",
          "en": "Confucius replied, \"To govern means to rectify. If you lead on the people with correctness, who will dare not to be correct?\""
        },
        {
          "ref": "12:56",
          "zh": "季康子患盜，問於孔子。",
          "en": "Ji Kang, distressed about the number of thieves in the state, inquired of Confucius how to do away with them."
        },
        {
          "ref": "12:57",
          "zh": "孔子對曰：「苟子之不欲，雖賞之不竊。」",
          "en": "Confucius said, \"If you, sir, were not covetous, although you should reward them to do it, they would not steal.\""
        },
        {
          "ref": "12:58",
          "zh": "季康子問政於孔子曰：「如殺無道，以就有道，何如？」",
          "en": "Ji Kang asked Confucius about government, saying, \"What do you say to killing the unprincipled for the good of the principled?\""
        },
        {
          "ref": "12:59",
          "zh": "孔子對曰：「子為政，焉用殺？",
          "en": "Confucius replied, \"Sir, in carrying on your government, why should you use killing at all?"
        },
        {
          "ref": "12:60",
          "zh": "子欲善，而民善矣。",
          "en": "Let your evinced desires be for what is good, and the people will be good."
        },
        {
          "ref": "12:61",
          "zh": "君子之德風，小人之德草。草上之風，必偃。」",
          "en": "The relation between superiors and inferiors is like that between the wind and the grass. The grass must bend, when the wind blows across it.\""
        },
        {
          "ref": "12:62",
          "zh": "子張問：「士何如斯可謂之達矣？」",
          "en": "Zi Zhang asked, \"What must the officer be, who may be said to be distinguished?\""
        },
        {
          "ref": "12:63",
          "zh": "子曰：「何哉，爾所謂達者？」",
          "en": "The Master said, \"What is it you call being distinguished?\""
        },
        {
          "ref": "12:64",
          "zh": "子張對曰：「在邦必聞，在家必聞。」",
          "en": "Zi Zhang replied, \"It is to be heard of through the state, to be heard of throughout his clan.\""
        },
        {
          "ref": "12:65",
          "zh": "子曰：「是聞也，非達也。",
          "en": "The Master said, \"That is notoriety, not distinction."
        },
        {
          "ref": "12:66",
          "zh": "夫達也者，質直而好義，察言而觀色，慮以下人。在邦必達，在家必達。",
          "en": "Now the man of distinction is solid and straightforward, and loves righteousness. He examines people's words, and looks at their countenances. He is anxious to humble himself to others. Such a man will be distinguished in the country; he will be distinguished in his clan."
        },
        {
          "ref": "12:67",
          "zh": "夫聞也者，色取仁而行違，居之不疑。在邦必聞，在家必聞。」",
          "en": "As to the man of notoriety, he assumes the appearance of virtue, but his actions are opposed to it, and he rests in this character without any doubts about himself. Such a man will be heard of in the country; he will be heard of in the clan.\""
        },
        {
          "ref": "12:68",
          "zh": "樊遲從遊於舞雩之下，曰：「敢問崇德、脩慝、辨惑。」",
          "en": "Fan Chi rambling with the Master under the trees about the rain altars, said, \"I venture to ask how to exalt virtue, to correct cherished evil, and to discover delusions.\""
        },
        {
          "ref": "12:69",
          "zh": "子曰：「善哉問！",
          "en": "The Master said, \"Truly a good question!"
        },
        {
          "ref": "12:70",
          "zh": "先事後得，非崇德與？",
          "en": "If doing what is to be done be made the first business, and success a secondary consideration - is not this the way to exalt virtue?"
        },
        {
          "ref": "12:71",
          "zh": "攻其惡，無攻人之惡，非脩慝與？",
          "en": "To assail one's own wickedness and not assail that of others - is not this the way to correct cherished evil?"
        },
        {
          "ref": "12:72",
          "zh": "一朝之忿，忘其身，以及其親，非惑與？」",
          "en": "For a morning's anger to disregard one's own life, and involve that of his parents - is not this a case of delusion?\""
        },
        {
          "ref": "12:73",
          "zh": "樊遲問仁。子曰：「愛人。」",
          "en": "Fan Chi asked about benevolence. The Master said, \"It is to love all men.\""
        },
        {
          "ref": "12:74",
          "zh": "問知。子曰：「知人。」",
          "en": "He asked about knowledge. The Master said, \"It is to know all men.\""
        },
        {
          "ref": "12:75",
          "zh": "樊遲未達。",
          "en": "Fan Chi did not immediately understand these answers."
        },
        {
          "ref": "12:76",
          "zh": "子曰：「舉直錯諸枉，能使枉者直。」",
          "en": "The Master said, \"Employ the upright and put aside all the crooked; in this way the crooked can be made to be upright.\""
        },
        {
          "ref": "12:77",
          "zh": "樊遲退，見子夏。",
          "en": "Fan Chi retired, and, seeing Zi Xia, he said to him,"
        },
        {
          "ref": "12:78",
          "zh": "曰：「鄉也吾見於夫子而問知，子曰，『舉直錯諸枉，能使枉者直』，何謂也？」",
          "en": "\"A little while ago, I had an interview with our Master, and asked him about knowledge. He said, 'Employ the upright, and put aside all the crooked; in this way, the crooked will be made to be upright.' What did he mean?\""
        },
        {
          "ref": "12:79",
          "zh": "子夏曰：「富哉言乎！舜有天下，選於眾，舉皋陶，不仁者遠矣。湯有天下，選於眾，舉伊尹，不仁者遠矣。」",
          "en": "Zi Xia said, \"Truly rich is his saying! Shun, being in possession of the kingdom, selected from among all the people, and employed Gao Yao, on which all who were devoid of virtue disappeared. Tang, being in possession of the kingdom, selected from among all the people, and employed Yi Yin, and all who were devoid of virtue disappeared.\""
        },
        {
          "ref": "12:80",
          "zh": "子貢問友。",
          "en": "Zi Gong asked about friendship."
        },
        {
          "ref": "12:81",
          "zh": "子曰：「忠告而善道之，不可則止，無自辱焉。」",
          "en": "The Master said, \"Faithfully admonish your friend, and skillfully lead him on. If you find him impracticable, stop. Do not disgrace yourself.\""
        },
        {
          "ref": "12:82",
          "zh": "曾子曰：「君子以文會友，以友輔仁。」",
          "en": "The philosopher Zeng said, \"The superior man on grounds of culture meets with his friends, and by friendship helps his virtue.\""
        }
      ]
    },
    {
      "number": "13",
      "title": "Zi Lu",
      "slug": "zi-lu",
      "passages": [
        {
          "ref": "13:1",
          "zh": "子路問政。",
          "en": "Zi Lu asked about government."
        },
        {
          "ref": "13:2",
          "zh": "子曰：「先之，勞之。」",
          "en": "The Master said, \"Go before the people with your example, and be laborious in their affairs.\""
        },
        {
          "ref": "13:3",
          "zh": "請益。曰：「無倦。」",
          "en": "He requested further instruction, and was answered, \"Be not weary (in these things).\""
        },
        {
          "ref": "13:4",
          "zh": "仲弓為季氏宰，問政。",
          "en": "Zhong Gong, being chief minister to the head of the Ji family, asked about government."
        },
        {
          "ref": "13:5",
          "zh": "子曰：「先有司，赦小過，舉賢才。」",
          "en": "The Master said, \"Employ first the services of your various officers, pardon small faults, and raise to office men of virtue and talents.\""
        },
        {
          "ref": "13:6",
          "zh": "曰：「焉知賢才而舉之？」",
          "en": "Zhong Gong said, \"How shall I know the men of virtue and talent, so that I may raise them to office?\""
        },
        {
          "ref": "13:7",
          "zh": "曰：「舉爾所知。爾所不知，人其舍諸？」",
          "en": "He was answered, \"Raise to office those whom you know. As to those whom you do not know, will others neglect them?\""
        },
        {
          "ref": "13:8",
          "zh": "子路曰：「衛君待子而為政，子將奚先？」",
          "en": "Zi Lu said, \"The ruler of Wei has been waiting for you, in order with you to administer the government. What will you consider the first thing to be done?\""
        },
        {
          "ref": "13:9",
          "zh": "子曰：「必也正名乎！」",
          "en": "The Master replied, \"What is necessary is to rectify names.\""
        },
        {
          "ref": "13:10",
          "zh": "子路曰：「有是哉，子之迂也！奚其正？」",
          "en": "\"So! indeed!\" said Zi Lu. \"You are wide of the mark! Why must there be such rectification?\""
        },
        {
          "ref": "13:11",
          "zh": "子曰：「野哉由也！君子於其所不知，蓋闕如也。",
          "en": "The Master said, \"How uncultivated you are, You! A superior man, in regard to what he does not know, shows a cautious reserve."
        },
        {
          "ref": "13:12",
          "zh": "名不正，則言不順；",
          "en": "If names be not correct, language is not in accordance with the truth of things."
        },
        {
          "ref": "13:13",
          "zh": "言不順，則事不成；",
          "en": "If language be not in accordance with the truth of things, affairs cannot be carried on to success."
        },
        {
          "ref": "13:14",
          "zh": "事不成，則禮樂不興；",
          "en": "When affairs cannot be carried on to success, proprieties and music will not flourish."
        },
        {
          "ref": "13:15",
          "zh": "禮樂不興，則刑罰不中；",
          "en": "When proprieties and music do not flourish, punishments will not be properly awarded."
        },
        {
          "ref": "13:16",
          "zh": "刑罰不中，則民無所措手足。",
          "en": "When punishments are not properly awarded, the people do not know how to move hand or foot."
        },
        {
          "ref": "13:17",
          "zh": "故君子名之必可言也，言之必可行也。",
          "en": "Therefore a superior man considers it necessary that the names he uses may be spoken appropriately, and also that what he speaks may be carried out appropriately."
        },
        {
          "ref": "13:18",
          "zh": "君子於其言，無所苟而已矣。」",
          "en": "What the superior man requires is just that in his words there may be nothing incorrect.\""
        },
        {
          "ref": "13:19",
          "zh": "樊遲請學稼，子曰：「吾不如老農。」",
          "en": "Fan Chi requested to be taught husbandry. The Master said, \"I am not so good for that as an old husbandman.\""
        },
        {
          "ref": "13:20",
          "zh": "請學為圃。曰：「吾不如老圃。」",
          "en": "He requested also to be taught gardening, and was answered, \"I am not so good for that as an old gardener.\""
        },
        {
          "ref": "13:21",
          "zh": "樊遲出。",
          "en": "Fan Chi having gone out,"
        },
        {
          "ref": "13:22",
          "zh": "子曰：「小人哉，樊須也！",
          "en": "the Master said, \"A small man, indeed, is Fan Xu!"
        },
        {
          "ref": "13:23",
          "zh": "上好禮，則民莫敢不敬；",
          "en": "If a superior man love propriety, the people will not dare not to be reverent."
        },
        {
          "ref": "13:24",
          "zh": "上好義，則民莫敢不服；",
          "en": "If he love righteousness, the people will not dare not to submit to his example."
        },
        {
          "ref": "13:25",
          "zh": "上好信，則民莫敢不用情。",
          "en": "If he love good faith, the people will not dare not to be sincere."
        },
        {
          "ref": "13:26",
          "zh": "夫如是，則四方之民襁負其子而至矣，焉用稼？」",
          "en": "Now, when these things obtain, the people from all quarters will come to him, bearing their children on their backs - what need has he of a knowledge of husbandry?\""
        },
        {
          "ref": "13:27",
          "zh": "子曰：「誦詩三百，授之以政，不達；",
          "en": "The Master said, \"Though a man may be able to recite the three hundred odes, yet if, when intrusted with a governmental charge, he knows not how to act,"
        },
        {
          "ref": "13:28",
          "zh": "使於四方，不能專對；",
          "en": "or if, when sent to any quarter on a mission, he cannot give his replies unassisted,"
        },
        {
          "ref": "13:29",
          "zh": "雖多，亦奚以為？」",
          "en": "notwithstanding the extent of his learning, of what practical use is it?\""
        },
        {
          "ref": "13:30",
          "zh": "子曰：「其身正，不令而行；",
          "en": "The Master said, \"When a prince's personal conduct is correct, his government is effective without the issuing of orders."
        },
        {
          "ref": "13:31",
          "zh": "其身不正，雖令不從。」",
          "en": "If his personal conduct is not correct, he may issue orders, but they will not be followed.\""
        },
        {
          "ref": "13:32",
          "zh": "子曰：「魯衛之政，兄弟也。」",
          "en": "The Master said, \"The governments of Lu and Wei are brothers.\""
        },
        {
          "ref": "13:33",
          "zh": "子謂衛公子荊，「善居室。",
          "en": "The Master said of Jing, a scion of the ducal family of Wei, that he knew the economy of a family well."
        },
        {
          "ref": "13:34",
          "zh": "始有，曰：『苟合矣。』",
          "en": "When he began to have means, he said, \"Ha! here is a collection!\""
        },
        {
          "ref": "13:35",
          "zh": "少有，曰：『苟完矣。』",
          "en": "When they were a little increased, he said, \"Ha! this is complete!\""
        },
        {
          "ref": "13:36",
          "zh": "富有，曰：『苟美矣。』」",
          "en": "When he had become rich, he said, \"Ha! this is admirable!\""
        },
        {
          "ref": "13:37",
          "zh": "子適衛，冉有僕。",
          "en": "When the Master went to Wei, Ran You acted as driver of his carriage."
        },
        {
          "ref": "13:38",
          "zh": "子曰：「庶矣哉！」",
          "en": "The Master observed, \"How numerous are the people!\""
        },
        {
          "ref": "13:39",
          "zh": "冉有曰：「既庶矣。又何加焉？」曰：「富之。」",
          "en": "You said, \"Since they are thus numerous, what more shall be done for them?\" \"Enrich them,\" was the reply."
        },
        {
          "ref": "13:40",
          "zh": "曰：「既富矣，又何加焉？」子曰：「教之。」",
          "en": "\"And when they have been enriched, what more shall be done?\" The Master said, \"Teach them.\""
        },
        {
          "ref": "13:41",
          "zh": "子曰：「苟有用我者。期月而已可也，三年有成。」",
          "en": "The Master said, \"If there were (any of the princes) who would employ me, in the course of twelve months, I should have done something considerable. In three years, the government would be perfected.\""
        },
        {
          "ref": "13:42",
          "zh": "子曰：「善人為邦百年，亦可以勝殘去殺矣。誠哉是言也！」",
          "en": "The Master said, \"'If good men were to govern a country in succession for a hundred years, they would be able to transform the violently bad, and dispense with capital punishments.' True indeed is this saying!\""
        },
        {
          "ref": "13:43",
          "zh": "子曰：「如有王者，必世而後仁。」",
          "en": "The Master said, \"If a truly royal ruler were to arise, it would still require a generation, and then virtue would prevail.\""
        },
        {
          "ref": "13:44",
          "zh": "子曰：「苟正其身矣，於從政乎何有？",
          "en": "The Master said, \"If a minister make his own conduct correct, what difficulty will he have in assisting in government?"
        },
        {
          "ref": "13:45",
          "zh": "不能正其身，如正人何？」",
          "en": "If he cannot rectify himself, what has he to do with rectifying others?\""
        },
        {
          "ref": "13:46",
          "zh": "冉子退朝。子曰：「何晏也？」",
          "en": "The disciple Ran returning from the court, the Master said to him, \"How are you so late?\""
        },
        {
          "ref": "13:47",
          "zh": "對曰：「有政。」",
          "en": "He replied, \"We had government business.\""
        },
        {
          "ref": "13:48",
          "zh": "子曰：「其事也。如有政，雖不吾以，吾其與聞之。」",
          "en": "The Master said, \"It must have been family affairs. If there had been government business, though I am not now in office, I should have been consulted about it.\""
        },
        {
          "ref": "13:49",
          "zh": "定公問：「一言而可以興邦，有諸？」",
          "en": "The Duke Ding asked whether there was a single sentence which could make a country prosperous."
        },
        {
          "ref": "13:50",
          "zh": "孔子對曰：「言不可以若是其幾也。",
          "en": "Confucius replied, \"Such an effect cannot be expected from one sentence."
        },
        {
          "ref": "13:51",
          "zh": "人之言曰：『為君難，為臣不易。』",
          "en": "There is a saying, however, which people have - 'To be a prince is difficult; to be a minister is not easy.'"
        },
        {
          "ref": "13:52",
          "zh": "如知為君之難也，不幾乎一言而興邦乎？」",
          "en": "If a ruler knows this - the difficulty of being a prince - may there not be expected from this one sentence the prosperity of his country?\""
        },
        {
          "ref": "13:53",
          "zh": "曰：「一言而喪邦，有諸？」",
          "en": "The duke then said, \"Is there a single sentence which can ruin a country?\""
        },
        {
          "ref": "13:54",
          "zh": "孔子對曰：「言不可以若是其幾也。",
          "en": "Confucius replied, \"Such an effect as that cannot be expected from one sentence."
        },
        {
          "ref": "13:55",
          "zh": "人之言曰：『予無樂乎為君，唯其言而莫予違也。』",
          "en": "There is, however, the saying which people have - 'I have no pleasure in being a prince, but only in that no one can offer any opposition to what I say!'"
        },
        {
          "ref": "13:56",
          "zh": "如其善而莫之違也，不亦善乎？",
          "en": "If a ruler's words be good, is it not also good that no one oppose them?"
        },
        {
          "ref": "13:57",
          "zh": "如不善而莫之違也，不幾乎一言而喪邦乎？」",
          "en": "But if they are not good, and no one opposes them, may there not be expected from this one sentence the ruin of his country?\""
        },
        {
          "ref": "13:58",
          "zh": "葉公問政。",
          "en": "The duke of She asked about government."
        },
        {
          "ref": "13:59",
          "zh": "子曰：「近者說，遠者來。」",
          "en": "The Master said, \"Good government obtains, when those who are near are made happy, and those who are far off are attracted.\""
        },
        {
          "ref": "13:60",
          "zh": "子夏為莒父宰，問政。",
          "en": "Zi Xia, being governor of Ju Fu, asked about government."
        },
        {
          "ref": "13:61",
          "zh": "子曰：「無欲速，無見小利。",
          "en": "The Master said, \"Do not be desirous to have things done quickly; do not look at small advantages."
        },
        {
          "ref": "13:62",
          "zh": "欲速，則不達；見小利，則大事不成。」",
          "en": "Desire to have things done quickly prevents their being done thoroughly. Looking at small advantages prevents great affairs from being accomplished.\""
        },
        {
          "ref": "13:63",
          "zh": "葉公語孔子曰：「吾黨有直躬者，其父攘羊，而子證之。」",
          "en": "The Duke of She informed Confucius, saying, \"Among us here there are those who may be styled upright in their conduct. If their father have stolen a sheep, they will bear witness to the fact.\""
        },
        {
          "ref": "13:64",
          "zh": "孔子曰：「吾黨之直者異於是。父為子隱，子為父隱，直在其中矣。」",
          "en": "Confucius said, \"Among us, in our part of the country, those who are upright are different from this. The father conceals the misconduct of the son, and the son conceals the misconduct of the father. Uprightness is to be found in this.\""
        },
        {
          "ref": "13:65",
          "zh": "樊遲問仁。",
          "en": "Fan Chi asked about perfect virtue."
        },
        {
          "ref": "13:66",
          "zh": "子曰：「居處恭，執事敬，與人忠。雖之夷狄，不可棄也。」",
          "en": "The Master said, \"It is, in retirement, to be sedately grave; in the management of business, to be reverently attentive; in intercourse with others, to be strictly sincere. Though a man go among rude, uncultivated tribes, these qualities may not be neglected.\""
        },
        {
          "ref": "13:67",
          "zh": "子貢問曰：「何如斯可謂之士矣？」",
          "en": "Zi Gong asked, saying, \"What qualities must a man possess to entitle him to be called an officer?\""
        },
        {
          "ref": "13:68",
          "zh": "子曰：「行己有恥，使於四方，不辱君命，可謂士矣。」",
          "en": "The Master said, \"He who in his conduct of himself maintains a sense of shame, and when sent to any quarter will not disgrace his prince's commission, deserves to be called an officer.\""
        },
        {
          "ref": "13:69",
          "zh": "曰：「敢問其次。」",
          "en": "Zi Gong pursued, \"I venture to ask who may be placed in the next lower rank?\""
        },
        {
          "ref": "13:70",
          "zh": "曰：「宗族稱孝焉，鄉黨稱弟焉。」",
          "en": "And he was told, \"He whom the circle of his relatives pronounce to be filial, whom his fellow villagers and neighbors pronounce to be fraternal.\""
        },
        {
          "ref": "13:71",
          "zh": "曰：「敢問其次。」",
          "en": "Again the disciple asked, \"I venture to ask about the class still next in order.\""
        },
        {
          "ref": "13:72",
          "zh": "曰：「言必信，行必果，硜硜然小人哉！抑亦可以為次矣。」",
          "en": "The Master said, \"They are determined to be sincere in what they say, and to carry out what they do. They are obstinate little men. Yet perhaps they may make the next class.\""
        },
        {
          "ref": "13:73",
          "zh": "曰：「今之從政者何如？」",
          "en": "Zi Gong finally inquired, \"Of what sort are those of the present day, who engage in government?\""
        },
        {
          "ref": "13:74",
          "zh": "子曰：「噫！斗筲之人，何足算也。」",
          "en": "The Master said \"Pooh! they are so many pecks and hampers, not worth being taken into account.\""
        },
        {
          "ref": "13:75",
          "zh": "子曰：「不得中行而與之，必也狂狷乎！",
          "en": "The Master said, \"Since I cannot get men pursuing the due medium, to whom I might communicate my instructions, I must find the ardent and the cautiously-decided."
        },
        {
          "ref": "13:76",
          "zh": "狂者進取，狷者有所不為也。」",
          "en": "The ardent will advance and lay hold of truth; the cautiously-decided will keep themselves from what is wrong.\""
        },
        {
          "ref": "13:77",
          "zh": "子曰：「南人有言曰：『人而無恆，不可以作巫醫。』善夫！」",
          "en": "The Master said, \"The people of the south have a saying - 'A man without constancy cannot be either a wizard or a doctor.' Good!"
        },
        {
          "ref": "13:78",
          "zh": "「不恆其德，或承之羞。」",
          "en": "Inconstant in his virtue, he will be visited with disgrace.\""
        },
        {
          "ref": "13:79",
          "zh": "子曰：「不占而已矣。」",
          "en": "The Master said, \"This arises simply from not attending to the prognostication.\""
        },
        {
          "ref": "13:80",
          "zh": "子曰：「君子和而不同，小人同而不和。」",
          "en": "The Master said, \"The superior man is affable, but not adulatory; the mean man is adulatory, but not affable.\""
        },
        {
          "ref": "13:81",
          "zh": "子貢問曰：「鄉人皆好之，何如？」",
          "en": "Zi Gong asked, saying, \"What do you say of a man who is loved by all the people of his neighborhood?\""
        },
        {
          "ref": "13:82",
          "zh": "子曰：「未可也。」",
          "en": "The Master replied, \"We may not for that accord our approval of him.\""
        },
        {
          "ref": "13:83",
          "zh": "「鄉人皆惡之，何如？」",
          "en": "\"And what do you say of him who is hated by all the people of his neighborhood?\""
        },
        {
          "ref": "13:84",
          "zh": "子曰：「未可也。不如鄉人之善者好之，其不善者惡之。」",
          "en": "The Master said, \"We may not for that conclude that he is bad. It is better than either of these cases that the good in the neighborhood love him, and the bad hate him.\""
        },
        {
          "ref": "13:85",
          "zh": "子曰：「君子易事而難說也：說之不以道，不說也；",
          "en": "The Master said, \"The superior man is easy to serve and difficult to please. If you try to please him in any way which is not accordant with right, he will not be pleased."
        },
        {
          "ref": "13:86",
          "zh": "及其使人也，器之。",
          "en": "But in his employment of men, he uses them according to their capacity."
        },
        {
          "ref": "13:87",
          "zh": "小人難事而易說也：說之雖不以道，說也；",
          "en": "The mean man is difficult to serve, and easy to please. If you try to please him, though it be in a way which is not accordant with right, he may be pleased."
        },
        {
          "ref": "13:88",
          "zh": "及其使人也，求備焉。」",
          "en": "But in his employment of men, he wishes them to be equal to everything.\""
        },
        {
          "ref": "13:89",
          "zh": "子曰：「君子泰而不驕，小人驕而不泰。」",
          "en": "The Master said, \"The superior man has a dignified ease without pride. The mean man has pride without a dignified ease.\""
        },
        {
          "ref": "13:90",
          "zh": "子曰：「剛毅、木訥，近仁。」",
          "en": "The Master said, \"The firm, the enduring, the simple, and the modest are near to virtue.\""
        },
        {
          "ref": "13:91",
          "zh": "子路問曰：「何如斯可謂之士矣？」",
          "en": "Zi Lu asked, saying, \"What qualities must a man possess to entitle him to be called a scholar?\""
        },
        {
          "ref": "13:92",
          "zh": "子曰：「切切、偲偲、怡怡如也，可謂士矣。",
          "en": "The Master said, \"He must be thus: earnest, urgent, and bland - among his friends, earnest and urgent; among his brethren, bland.\""
        },
        {
          "ref": "13:93",
          "zh": "朋友切切、偲偲，兄弟怡怡。」",
          "en": "Among his friends, earnest and urgent; among his brethren, bland."
        },
        {
          "ref": "13:94",
          "zh": "子曰：「善人教民七年，亦可以即戎矣。」",
          "en": "The Master said, \"Let a good man teach the people seven years, and they may then likewise be employed in war.\""
        },
        {
          "ref": "13:95",
          "zh": "子曰：「以不教民戰，是謂棄之。」",
          "en": "The Master said, \"To lead an uninstructed people to war, is to throw them away.\""
        }
      ]
    },
    {
      "number": "14",
      "title": "Xian Wen",
      "slug": "xian-wen",
      "passages": [
        {
          "ref": "14:1",
          "zh": "憲問恥。",
          "en": "Xian asked what was shameful."
        },
        {
          "ref": "14:2",
          "zh": "子曰：「邦有道，穀；邦無道，穀，恥也。」",
          "en": "The Master said, \"When good government prevails in a state, to be thinking only of salary; and, when bad government prevails, to be thinking, in the same way, only of salary - this is shameful.\""
        },
        {
          "ref": "14:3",
          "zh": "「克、伐、怨、欲不行焉，可以為仁矣？」",
          "en": "\"When the love of superiority, boasting, resentments, and covetousness are repressed, this may be deemed perfect virtue.\""
        },
        {
          "ref": "14:4",
          "zh": "子曰：「可以為難矣，仁則吾不知也。」",
          "en": "The Master said, \"This may be regarded as the achievement of what is difficult. But I do not know that it is to be deemed perfect virtue.\""
        },
        {
          "ref": "14:5",
          "zh": "子曰：「士而懷居，不足以為士矣。」",
          "en": "The Master said, \"The scholar who cherishes the love of comfort is not fit to be deemed a scholar.\""
        },
        {
          "ref": "14:6",
          "zh": "子曰：「邦有道，危言危行；",
          "en": "The Master said, \"When good government prevails in a state, language may be lofty and bold, and actions the same."
        },
        {
          "ref": "14:7",
          "zh": "邦無道，危行言孫。」",
          "en": "When bad government prevails, the actions may be lofty and bold, but the language may be with some reserve.\""
        },
        {
          "ref": "14:8",
          "zh": "子曰：「有德者，必有言。有言者，不必有德。",
          "en": "The Master said, \"The virtuous will be sure to speak correctly, but those whose speech is good may not always be virtuous."
        },
        {
          "ref": "14:9",
          "zh": "仁者，必有勇。勇者，不必有仁。」",
          "en": "Men of principle are sure to be bold, but those who are bold may not always be men of principle.\""
        },
        {
          "ref": "14:10",
          "zh": "南宮适問於孔子曰：「羿善射，奡盪舟，俱不得其死然；",
          "en": "Nan Gong Kuo, submitting an inquiry to Confucius, said, \"Yi was skillful at archery, and Ao could move a boat along upon the land, but neither of them died a natural death."
        },
        {
          "ref": "14:11",
          "zh": "禹稷躬稼，而有天下。」",
          "en": "Yu and Ji personally wrought at the toils of husbandry, and they became possessors of the kingdom.\""
        },
        {
          "ref": "14:12",
          "zh": "夫子不答，南宮适出。",
          "en": "The Master made no reply; but when Nan Gong Kuo went out,"
        },
        {
          "ref": "14:13",
          "zh": "子曰：「君子哉若人！尚德哉若人！」",
          "en": "he said, \"A superior man indeed is this! An esteemer of virtue indeed is this!\""
        },
        {
          "ref": "14:14",
          "zh": "子曰：「君子而不仁者有矣夫，未有小人而仁者也。」",
          "en": "The Master said, \"Superior men, and yet not always virtuous, there have been, alas! But there never has been a mean man, and, at the same time, virtuous.\""
        },
        {
          "ref": "14:15",
          "zh": "子曰：「愛之，能勿勞乎？忠焉，能勿誨乎？」",
          "en": "The Master said, \"Can there be love which does not lead to strictness with its object? Can there be loyalty which does not lead to the instruction of its object?\""
        },
        {
          "ref": "14:16",
          "zh": "子曰：「為命：裨諶草創之，世叔討論之，行人子羽脩飾之，東里子產潤色之。」",
          "en": "The Master said, \"In preparing the governmental notifications, Pi Shen first made the rough draft; Shi Shu examined and discussed its contents; Zi Yu, the manager of foreign intercourse, then polished the style; and, finally, Zi Chan of Dong Li gave it the proper elegance and finish.\""
        },
        {
          "ref": "14:17",
          "zh": "或問子產。子曰：「惠人也。」",
          "en": "Some one asked about Zi Chan. The Master said, \"He was a kind man.\""
        },
        {
          "ref": "14:18",
          "zh": "問子西。曰：「彼哉！彼哉！」",
          "en": "He asked about Zi Xi. The Master said, \"That man! That man!\""
        },
        {
          "ref": "14:19",
          "zh": "問管仲。曰：「人也。奪伯氏駢邑三百，飯疏食，沒齒，無怨言。」",
          "en": "He asked about Guan Zhong. \"For him,\" said the Master, \"the city of Pian, with three hundred families, was taken from the chief of the Bo family, who though to the end of his life he had only coarse rice to eat did not utter a murmuring word.\""
        },
        {
          "ref": "14:20",
          "zh": "子曰：「貧而無怨難，富而無驕易。」",
          "en": "The Master said, \"To be poor without murmuring is difficult. To be rich without being proud is easy.\""
        },
        {
          "ref": "14:21",
          "zh": "子曰：「孟公綽，為趙魏老則優，不可以為滕薛大夫。」",
          "en": "The Master said, \"Meng Gong Chuo is more than fit to be chief officer in the families of Zhao and Wei, but he is not fit to be great officer to either of the States Teng or Xue.\""
        },
        {
          "ref": "14:22",
          "zh": "子路問成人。",
          "en": "Zi Lu asked what constituted a COMPLETE man."
        },
        {
          "ref": "14:23",
          "zh": "子曰：「若臧武仲之知，公綽之不欲，卞莊子之勇，冉求之藝，文之以禮樂，亦可以為成人矣。」",
          "en": "The Master said, \"Suppose a man with the knowledge of Zang Wu Zhong, the freedom from covetousness of Gong Chuo, the bravery of Zhuang of Bian, and the varied talents of Ran Qiu; add to these the accomplishments of the rules of propriety and music - such a one might be reckoned a COMPLETE man.\""
        },
        {
          "ref": "14:24",
          "zh": "曰：「今之成人者何必然？",
          "en": "He then added, \"But what is the necessity for a complete man of the present day to have all these things?"
        },
        {
          "ref": "14:25",
          "zh": "見利思義，見危授命，久要不忘平生之言，亦可以為成人矣。」",
          "en": "The man, who in the view of gain, thinks of righteousness; who in the view of danger is prepared to give up his life; and who does not forget an old agreement however far back it extends - such a man may be reckoned a COMPLETE man.\""
        },
        {
          "ref": "14:26",
          "zh": "子問公叔文子於公明賈曰：「信乎夫子不言、不笑、不取乎？」",
          "en": "The Master asked Gong Ming Jia about Gong Ming Wen, saying, \"Is it true that your master speaks not, laughs not, and takes not?\""
        },
        {
          "ref": "14:27",
          "zh": "公明賈對曰：「以告者過也。",
          "en": "Gong Ming Jia replied, \"This has arisen from the reporters going beyond the truth."
        },
        {
          "ref": "14:28",
          "zh": "夫子時然後言，人不厭其言；",
          "en": "My master speaks when it is the time to speak, and so men do not get tired of his speaking."
        },
        {
          "ref": "14:29",
          "zh": "樂然後笑，人不厭其笑；",
          "en": "He laughs when there is occasion to be joyful, and so men do not get tired of his laughing."
        },
        {
          "ref": "14:30",
          "zh": "義然後取，人不厭其取。」",
          "en": "He takes when it is consistent with righteousness to do so, and so men do not get tired of his taking.\""
        },
        {
          "ref": "14:31",
          "zh": "子曰：「其然，豈其然乎？」",
          "en": "The Master said, \"So! But is it so with him?\""
        },
        {
          "ref": "14:32",
          "zh": "子曰：「臧武仲以防求為後於魯，雖曰不要君，吾不信也。」",
          "en": "The Master said, \"Zang Wu Zhong, keeping possession of Fang, asked of the duke of Lu to appoint a successor to him in his family. Although it may be said that he was not using force with his sovereign, I believe he was.\""
        },
        {
          "ref": "14:33",
          "zh": "子曰：「晉文公譎而不正，齊桓公正而不譎。」",
          "en": "The Master said, \"The duke Wen of Jin was crafty and not upright. The duke Huan of Qi was upright and not crafty.\""
        },
        {
          "ref": "14:34",
          "zh": "子路曰：「桓公殺公子糾，召忽死之，管仲不死。」曰：「未仁乎？」",
          "en": "Zi Lu said, \"The duke Huan caused his brother Jiu to be killed, when Shao Hu died with his master, but Guan Zhong did not die. May not I say that he was wanting in virtue?\""
        },
        {
          "ref": "14:35",
          "zh": "子曰：「桓公九合諸侯，不以兵車，管仲之力也。如其仁！如其仁！」",
          "en": "The Master said, \"The Duke Huan assembled all the princes together, and that not with weapons of war and chariots - it was all through the influence of Guan Zhong. Whose beneficence was like his? Whose beneficence was like his?\""
        },
        {
          "ref": "14:36",
          "zh": "子貢曰：「管仲非仁者與？桓公殺公子糾，不能死，又相之。」",
          "en": "Zi Gong said, \"Guan Zhong, I apprehend, was wanting in virtue. When the Duke Huan caused his brother Jiu to be killed, Guan Zhong was not able to die with him. Moreover, he became prime minister to Huan.\""
        },
        {
          "ref": "14:37",
          "zh": "子曰：「管仲相桓公，霸諸侯，一匡天下，民到于今受其賜。",
          "en": "The Master said, \"Guan Zhong acted as prime minister to the duke Huan, made him leader of all the princes, and united and rectified the whole kingdom. Down to the present day, the people enjoy the gifts which he conferred."
        },
        {
          "ref": "14:38",
          "zh": "微管仲，吾其被髮左衽矣。",
          "en": "But for Guan Zhong, we should now be wearing our hair unbound, and the lappets of our coats buttoning on the left side."
        },
        {
          "ref": "14:39",
          "zh": "豈若匹夫匹婦之為諒也，自經於溝瀆，而莫之知也。」",
          "en": "Will you require from him the small fidelity of common men and common women, who would commit suicide in a stream or ditch, no one knowing anything about them?\""
        },
        {
          "ref": "14:40",
          "zh": "公叔文子之臣大夫僎，與文子同升諸公。",
          "en": "The great officer, Xian, who had been family minister to Gong Ming Wen, ascended to the prince's court in company with Wen."
        },
        {
          "ref": "14:41",
          "zh": "子聞之曰：「可以為文矣。」",
          "en": "The Master, having heard of it, said, \"He deserved to be considered WEN (the accomplished).\""
        },
        {
          "ref": "14:42",
          "zh": "子言衛靈公之無道也，康子曰：「夫如是，奚而不喪？」",
          "en": "The Master was speaking about the unprincipled course of the duke Ling of Wei, when Qi Kang said, \"Since he is of such a character, how is it he does not lose his state?\""
        },
        {
          "ref": "14:43",
          "zh": "孔子曰：「仲叔圉治賓客，祝鮀治宗廟，王孫賈治軍旅。夫如是，奚其喪？」",
          "en": "Confucius said, \"The Zhong Shu Yu has the superintendence of his guests and of strangers; the litanist, Tuo, has the management of his ancestral temple; and Wang Sun Jia has the direction of the army and forces - with such officers as these, how should he lose his state?\""
        },
        {
          "ref": "14:44",
          "zh": "子曰：「其言之不怍，則為之也難。」",
          "en": "The Master said, \"He who speaks without modesty will find it difficult to make his words good.\""
        },
        {
          "ref": "14:45",
          "zh": "陳成子弒簡公。",
          "en": "Chen Cheng murdered the duke Jian of Qi."
        },
        {
          "ref": "14:46",
          "zh": "孔子沐浴而朝，告於哀公曰：「陳恆弒其君，請討之。」",
          "en": "Confucius bathed, went to court and informed the duke Ai, saying, \"Chen Heng has slain his sovereign. I beg that you will undertake to punish him.\""
        },
        {
          "ref": "14:47",
          "zh": "公曰：「告夫三子！」",
          "en": "The duke said, \"Inform the chiefs of the three families of it.\""
        },
        {
          "ref": "14:48",
          "zh": "孔子曰：「以吾從大夫之後，不敢不告也。君曰『告夫三子』者。」",
          "en": "Confucius retired, and said, \"Following in the rear of the great officers, I did not dare not to represent such a matter, and my prince says, 'Inform the chiefs of the three families of it.'\""
        },
        {
          "ref": "14:49",
          "zh": "之三子告，不可。",
          "en": "He went to the chiefs, and informed them, but they would not act."
        },
        {
          "ref": "14:50",
          "zh": "孔子曰：「以吾從大夫之後，不敢不告也。」",
          "en": "Confucius then said, \"Following in the rear of the great officers, I did not dare not to represent such a matter.\""
        },
        {
          "ref": "14:51",
          "zh": "子路問事君。",
          "en": "Zi Lu asked how a ruler should be served."
        },
        {
          "ref": "14:52",
          "zh": "子曰：「勿欺也，而犯之。」",
          "en": "The Master said, \"Do not impose on him, and, moreover, withstand him to his face.\""
        },
        {
          "ref": "14:53",
          "zh": "子曰：「君子上達，小人下達。」",
          "en": "The Master said, \"The progress of the superior man is upwards; the progress of the mean man is downwards.\""
        },
        {
          "ref": "14:54",
          "zh": "子曰：「古之學者為己，今之學者為人。」",
          "en": "The Master said, \"In ancient times, men learned with a view to their own improvement. Nowadays, men learn with a view to the approbation of others.\""
        },
        {
          "ref": "14:55",
          "zh": "蘧伯玉使人於孔子。",
          "en": "Qu Bo sent a messenger with friendly inquiries to Confucius."
        },
        {
          "ref": "14:56",
          "zh": "孔子與之坐而問焉，曰：「夫子何為？」",
          "en": "Confucius sat with him, and questioned him. \"What,\" said he! \"is your master engaged in?\""
        },
        {
          "ref": "14:57",
          "zh": "對曰：「夫子欲寡其過而未能也。」",
          "en": "The messenger replied, \"My master is anxious to make his faults few, but he has not yet succeeded.\""
        },
        {
          "ref": "14:58",
          "zh": "使者出。子曰：「使乎！使乎！」",
          "en": "He then went out, and the Master said, \"A messenger indeed! A messenger indeed!\""
        },
        {
          "ref": "14:59",
          "zh": "子曰：「不在其位，不謀其政。」",
          "en": "The Master said, \"He who is not in any particular office has nothing to do with plans for the administration of its duties.\""
        },
        {
          "ref": "14:60",
          "zh": "曾子曰：「君子思不出其位。」",
          "en": "The philosopher Zeng said, \"The superior man, in his thoughts, does not go out of his place.\""
        },
        {
          "ref": "14:61",
          "zh": "子曰：「君子恥其言而過其行。」",
          "en": "The Master said, \"The superior man is modest in his speech, but exceeds in his actions.\""
        },
        {
          "ref": "14:62",
          "zh": "子曰：「君子道者三，我無能焉：仁者不憂，知者不惑，勇者不懼。」",
          "en": "The Master said, \"The way of the superior man is threefold, but I am not equal to it. Virtuous, he is free from anxieties; wise, he is free from perplexities; bold, he is free from fear.\""
        },
        {
          "ref": "14:63",
          "zh": "子貢曰：「夫子自道也。」",
          "en": "Zi Gong said, \"Master, that is what you yourself say.\""
        },
        {
          "ref": "14:64",
          "zh": "子貢方人。",
          "en": "Zi Gong was in the habit of comparing men together."
        },
        {
          "ref": "14:65",
          "zh": "子曰：「賜也賢乎哉？夫我則不暇。」",
          "en": "The Master said, \"Ci must have reached a high pitch of excellence! Now, I have not leisure for this.\""
        },
        {
          "ref": "14:66",
          "zh": "子曰：「不患人之不己知，患其不能也。」",
          "en": "The Master said, \"I will not be concerned at men's not knowing me; I will be concerned at my own want of ability.\""
        },
        {
          "ref": "14:67",
          "zh": "子曰：「不逆詐，不億不信。抑亦先覺者，是賢乎！」",
          "en": "The Master said, \"He who does not anticipate attempts to deceive him, nor think beforehand of his not being believed, and yet apprehends these things readily (when they occur) - is he not a man of superior worth?\""
        },
        {
          "ref": "14:68",
          "zh": "微生畝謂孔子曰：「丘何為是栖栖者與？無乃為佞乎？」",
          "en": "Wei Sheng Mu said to Confucius, \"Qiu, how is it that you keep roosting about? Is it not that you are an insinuating talker?\""
        },
        {
          "ref": "14:69",
          "zh": "孔子曰：「非敢為佞也，疾固也。」",
          "en": "Confucius said, \"I do not dare to play the part of such a talker, but I hate obstinacy.\""
        },
        {
          "ref": "14:70",
          "zh": "子曰：「驥不稱其力，稱其德也。」",
          "en": "The Master said, \"A horse is called a Ji, not because of its strength, but because of its other good qualities.\""
        },
        {
          "ref": "14:71",
          "zh": "或曰：「以德報怨，何如？」",
          "en": "Some one said, \"What do you say concerning the principle that injury should be recompensed with kindness?\""
        },
        {
          "ref": "14:72",
          "zh": "子曰：「何以報德？以直報怨，以德報德。」",
          "en": "The Master said, \"With what then will you recompense kindness? Recompense injury with justice, and recompense kindness with kindness.\""
        },
        {
          "ref": "14:73",
          "zh": "子曰：「莫我知也夫！」",
          "en": "The Master said, \"Alas! there is no one that knows me.\""
        },
        {
          "ref": "14:74",
          "zh": "子貢曰：「何為其莫知子也？」",
          "en": "Zi Gong said, \"What do you mean by thus saying - that no one knows you?\""
        },
        {
          "ref": "14:75",
          "zh": "子曰：「不怨天，不尤人。下學而上達。知我者，其天乎！」",
          "en": "The Master replied, \"I do not murmur against Heaven. I do not grumble against men. My studies lie low, and my penetration rises high. But there is Heaven - that knows me!\""
        },
        {
          "ref": "14:76",
          "zh": "公伯寮愬子路於季孫。",
          "en": "The Gong Bo Liao, having slandered Zi Lu to Ji Sun,"
        },
        {
          "ref": "14:77",
          "zh": "子服景伯以告，曰：「夫子固有惑志於公伯寮，吾力猶能肆諸市朝。」",
          "en": "Zi Fu Jing Bo informed Confucius of it, saying, \"Our master is certainly being led astray by the Gong Bo Liao, but I have still power enough left to cut Liao off, and expose his corpse in the market and in the court.\""
        },
        {
          "ref": "14:78",
          "zh": "子曰：「道之將行也與？命也。道之將廢也與？命也。公伯寮其如命何！」",
          "en": "The Master said, \"If my principles are to advance, it is so ordered. If they are to fall to the ground, it is so ordered. What can the Gong Bo Liao do where such ordering is concerned?\""
        },
        {
          "ref": "14:79",
          "zh": "子曰：「賢者辟世，其次辟地，其次辟色，其次辟言。」",
          "en": "The Master said, \"Some men of worth retire from the world. Some retire from particular states. Some retire because of disrespectful looks. Some retire because of contradictory language.\""
        },
        {
          "ref": "14:80",
          "zh": "子曰：「作者七人矣。」",
          "en": "The Master said, \"Those who have done this are seven men.\""
        },
        {
          "ref": "14:81",
          "zh": "子路宿於石門。",
          "en": "Zi Lu happening to pass the night in Shi Men,"
        },
        {
          "ref": "14:82",
          "zh": "晨門曰：「奚自？」子路曰：「自孔氏。」",
          "en": "the gatekeeper said to him, \"Whom do you come from?\" Zi Lu said, \"From Mr. Kong.\""
        },
        {
          "ref": "14:83",
          "zh": "曰：「是知其不可而為之者與？」",
          "en": "\"It is he, is it not?\" said the other, \"who knows the impracticable nature of the times and yet will be doing in them.\""
        },
        {
          "ref": "14:84",
          "zh": "子擊磬於衛。",
          "en": "The Master was playing, one day, on a musical stone in Wei,"
        },
        {
          "ref": "14:85",
          "zh": "有荷蕢而過孔氏之門者，曰：「有心哉！擊磬乎！」",
          "en": "when a man, carrying a straw basket, passed the door of the house where Confucius was, and said, \"His heart is full who so beats the musical stone.\""
        },
        {
          "ref": "14:86",
          "zh": "既而曰：「鄙哉！硜硜乎！莫己知也，斯己而已矣。",
          "en": "A little while after, he added, \"How contemptible is the one-ideaed obstinacy those sounds display! When one is taken no notice of, he has simply at once to give over his wish for public employment."
        },
        {
          "ref": "14:87",
          "zh": "深則厲，淺則揭。」",
          "en": "'Deep water must be crossed with the clothes on; shallow water may be crossed with the clothes held up.'\""
        },
        {
          "ref": "14:88",
          "zh": "子曰：「果哉！末之難矣。」",
          "en": "The Master said, \"How determined is he in his purpose! But this is not difficult!\""
        },
        {
          "ref": "14:89",
          "zh": "子張曰：「《書》云：『高宗諒陰，三年不言。』何謂也？」",
          "en": "Zi Zhang said, \"When the Shu says that Gao Zong, while observing the usual imperial mourning, was for three years without speaking, what is meant by this?\""
        },
        {
          "ref": "14:90",
          "zh": "子曰：「何必高宗，古之人皆然。君薨，百官總己以聽於冢宰，三年。」",
          "en": "The Master said, \"Why must Gao Zong be referred to as an example of this? The ancients all did so. When the sovereign died, the officers all attended to their several duties, taking instructions from the prime minister for three years.\""
        },
        {
          "ref": "14:91",
          "zh": "子曰：「上好禮，則民易使也。」",
          "en": "The Master said, \"When rulers love to observe the rules of propriety, the people respond readily to the calls on them for service.\""
        },
        {
          "ref": "14:92",
          "zh": "子路問君子。",
          "en": "Zi Lu asked what constituted the superior man."
        },
        {
          "ref": "14:93",
          "zh": "子曰：「脩己以敬。」",
          "en": "The Master said, \"The cultivation of himself in reverential carefulness.\""
        },
        {
          "ref": "14:94",
          "zh": "曰：「如斯而已乎？」",
          "en": "\"And is this all?\" said Zi Lu."
        },
        {
          "ref": "14:95",
          "zh": "曰：「脩己以安人。」",
          "en": "\"He cultivates himself so as to give rest to others,\" was the reply."
        },
        {
          "ref": "14:96",
          "zh": "曰：「如斯而已乎？」",
          "en": "\"And is this all?\" again asked Zi Lu."
        },
        {
          "ref": "14:97",
          "zh": "曰：「脩己以安百姓。脩己以安百姓，堯舜其猶病諸！」",
          "en": "The Master said, \"He cultivates himself so as to give rest to all the people. He cultivates himself so as to give rest to all the people - even Yao and Shun were still solicitous about this.\""
        },
        {
          "ref": "14:98",
          "zh": "原壤夷俟。",
          "en": "Yuan Rang was squatting on his heels, and so waited the approach of the Master,"
        },
        {
          "ref": "14:99",
          "zh": "子曰：「幼而不孫弟，長而無述焉，老而不死，是為賊！」",
          "en": "who said to him, \"In youth not humble as befits a junior; in manhood, doing nothing worthy of being handed down; and living on to old age - this is to be a pest.\""
        },
        {
          "ref": "14:100",
          "zh": "以杖叩其脛。",
          "en": "With this he hit him on the shank with his staff."
        },
        {
          "ref": "14:101",
          "zh": "闕黨童子將命。",
          "en": "A youth of the village of Que was employed by Confucius to carry the messages between him and his visitors."
        },
        {
          "ref": "14:102",
          "zh": "或問之曰：「益者與？」",
          "en": "Some one asked about him, saying, \"I suppose he has made great progress.\""
        },
        {
          "ref": "14:103",
          "zh": "子曰：「吾見其居於位也，見其與先生並行也。",
          "en": "The Master said, \"I observe that he is fond of occupying the seat of a full-grown man; I observe that he walks shoulder to shoulder with his elders."
        },
        {
          "ref": "14:104",
          "zh": "非求益者也，欲速成者也。」",
          "en": "He is not one who is seeking to make progress in learning. He wishes quickly to become a man.\""
        }
      ]
    },
    {
      "number": "15",
      "title": "Wei Ling Gong",
      "slug": "wei-ling-gong",
      "passages": [
        {
          "ref": "15:1",
          "zh": "衛靈公問陳於孔子。",
          "en": "The duke Ling of Wei asked Confucius about tactics."
        },
        {
          "ref": "15:2",
          "zh": "孔子對曰：「俎豆之事，則嘗聞之矣；軍旅之事，未之學也。」",
          "en": "Confucius replied, \"I have heard all about sacrificial vessels, but I have not learned military matters.\""
        },
        {
          "ref": "15:3",
          "zh": "明日遂行。",
          "en": "On this, he took his departure the next day."
        },
        {
          "ref": "15:4",
          "zh": "在陳絕糧，從者病，莫能興。",
          "en": "When he was in Chen, their provisions were exhausted, and his followers became so ill that they were unable to rise."
        },
        {
          "ref": "15:5",
          "zh": "子路慍見曰：「君子亦有窮乎？」",
          "en": "Zi Lu, with evident dissatisfaction, said, \"Has the superior man likewise to endure in this way?\""
        },
        {
          "ref": "15:6",
          "zh": "子曰：「君子固窮，小人窮斯濫矣。」",
          "en": "The Master said, \"The superior man may indeed have to endure want, but the mean man, when he is in want, gives way to unbridled license.\""
        },
        {
          "ref": "15:7",
          "zh": "子曰：「賜也，女以予為多學而識之者與？」",
          "en": "The Master said, \"Ci, you think, I suppose, that I am one who learns many things and keeps them in memory?\""
        },
        {
          "ref": "15:8",
          "zh": "對曰：「然，非與？」",
          "en": "Zi Gong replied, \"Yes - but perhaps it is not so?\""
        },
        {
          "ref": "15:9",
          "zh": "曰：「非也，予一以貫之。」",
          "en": "\"No,\" was the answer; \"I seek a unity all pervading.\""
        },
        {
          "ref": "15:10",
          "zh": "子曰：「由！知德者鮮矣。」",
          "en": "The Master said, \"You, those who know virtue are few.\""
        },
        {
          "ref": "15:11",
          "zh": "子曰：「無為而治者，其舜也與？",
          "en": "The Master said, \"May not Shun be instanced as having governed efficiently without exertion?"
        },
        {
          "ref": "15:12",
          "zh": "夫何為哉，恭己正南面而已矣。」",
          "en": "What did he do? He did nothing but gravely and reverently occupy his royal seat.\""
        },
        {
          "ref": "15:13",
          "zh": "子張問行。",
          "en": "Zi Zhang asked how a man should conduct himself, so as to be everywhere appreciated."
        },
        {
          "ref": "15:14",
          "zh": "子曰：「言忠信，行篤敬，雖蠻貊之邦行矣；言不忠信，行不篤敬，雖州里行乎哉？",
          "en": "The Master said, \"Let his words be sincere and truthful and his actions honorable and careful - such conduct may be practiced among the rude tribes of the South or the North. If his words be not sincere and truthful, and his actions not honorable and careful, will he, with such conduct, be appreciated, even in his neighborhood?"
        },
        {
          "ref": "15:15",
          "zh": "立，則見其參於前也；在輿，則見其倚於衡也。",
          "en": "When he is standing, let him see those two things, as it were, fronting him. When he is in a carriage, let him see them attached to the yoke."
        },
        {
          "ref": "15:16",
          "zh": "夫然後行。」",
          "en": "Then may he subsequently carry them into practice.\""
        },
        {
          "ref": "15:17",
          "zh": "子張書諸紳。",
          "en": "Zi Zhang wrote these counsels on the end of his sash."
        },
        {
          "ref": "15:18",
          "zh": "子曰：「直哉史魚！邦有道，如矢；邦無道，如矢。」",
          "en": "The Master said, \"Truly straightforward was the historiographer Yu. When good government prevailed in his state, he was like an arrow. When bad government prevailed, he was like an arrow."
        },
        {
          "ref": "15:19",
          "zh": "君子哉蘧伯玉！邦有道，則仕；邦無道，則可卷而懷之。」",
          "en": "A superior man indeed is Qu Bo Yu! When good government prevails in his state, he is to be found in office. When bad government prevails, he can roll his principles up, and keep them in his breast.\""
        },
        {
          "ref": "15:20",
          "zh": "子曰：「可與言而不與之言，失人；不可與言而與之言，失言。",
          "en": "The Master said, \"When a man may be spoken with, not to speak to him is to err in reference to the man. When a man may not be spoken with, to speak to him is to err in reference to our words."
        },
        {
          "ref": "15:21",
          "zh": "知者不失人，亦不失言。」",
          "en": "The wise err neither in regard to their man nor to their words.\""
        },
        {
          "ref": "15:22",
          "zh": "子曰：「志士仁人，無求生以害仁，有殺身以成仁。」",
          "en": "The Master said, \"The determined scholar and the man of virtue will not seek to live at the expense of injuring their virtue. They will even sacrifice their lives to preserve their virtue complete.\""
        },
        {
          "ref": "15:23",
          "zh": "子貢問為仁。",
          "en": "Zi Gong asked about the practice of virtue."
        },
        {
          "ref": "15:24",
          "zh": "子曰：「工欲善其事，必先利其器。",
          "en": "The Master said, \"The mechanic, who wishes to do his work well, must first sharpen his tools."
        },
        {
          "ref": "15:25",
          "zh": "居是邦也，事其大夫之賢者，友其士之仁者。」",
          "en": "When you are living in any state, take service with the most worthy among its great officers, and make friends of the most virtuous among its scholars.\""
        },
        {
          "ref": "15:26",
          "zh": "顏淵問為邦。",
          "en": "Yan Yuan asked how the government of a country should be administered."
        },
        {
          "ref": "15:27",
          "zh": "子曰：「行夏之時，乘殷之輅，服周之冕，樂則韶舞。",
          "en": "The Master said, \"Follow the seasons of Xia. Ride in the state carriage of Yin. Wear the ceremonial cap of Zhou. Let the music be the Shao with its pantomimes."
        },
        {
          "ref": "15:28",
          "zh": "放鄭聲，遠佞人。",
          "en": "Banish the songs of Zheng, and keep far from specious talkers."
        },
        {
          "ref": "15:29",
          "zh": "鄭聲淫，佞人殆。」",
          "en": "The songs of Zheng are licentious; specious talkers are dangerous.\""
        },
        {
          "ref": "15:30",
          "zh": "子曰：「人無遠慮，必有近憂。」",
          "en": "The Master said, \"If a man take no thought about what is distant, he will find sorrow near at hand.\""
        },
        {
          "ref": "15:31",
          "zh": "子曰：「已矣乎！吾未見好德如好色者也。」",
          "en": "The Master said, \"It is all over! I have not seen one who loves virtue as he loves beauty.\""
        },
        {
          "ref": "15:32",
          "zh": "子曰：「臧文仲其竊位者與？知柳下惠之賢，而不與立也。」",
          "en": "The Master said, \"Was not Zang Wen like one who had stolen his situation? He knew the virtue and the talents of Hui of Liu Xia, and yet did not procure that he should stand with him in court.\""
        },
        {
          "ref": "15:33",
          "zh": "子曰：「躬自厚而薄責於人，則遠怨矣。」",
          "en": "The Master said, \"He who requires much from himself and little from others, will keep himself from being the object of resentment.\""
        },
        {
          "ref": "15:34",
          "zh": "子曰：「不曰『如之何如之何』者，吾末如之何也已矣。」",
          "en": "The Master said, \"When a man is not in the habit of saying, 'What shall I think of this? What shall I think of this?' I can indeed do nothing with him!\""
        },
        {
          "ref": "15:35",
          "zh": "子曰：「群居終日，言不及義，好行小慧，難矣哉！」",
          "en": "The Master said, \"When a number of people are together, for a whole day, without their conversation turning on righteousness, and when they are fond of carrying out the suggestions of a small shrewdness; theirs is indeed a hard case.\""
        },
        {
          "ref": "15:36",
          "zh": "子曰：「君子義以為質，禮以行之，孫以出之，信以成之。",
          "en": "The Master said, \"The superior man in everything considers righteousness to be essential. He performs it according to the rules of propriety. He brings it forth in humility. He completes it with sincerity."
        },
        {
          "ref": "15:37",
          "zh": "君子哉！」",
          "en": "This is indeed a superior man.\""
        },
        {
          "ref": "15:38",
          "zh": "子曰：「君子病無能焉，不病人之不己知也。」",
          "en": "The Master said, \"The superior man is distressed by his want of ability. He is not distressed by men's not knowing him.\""
        },
        {
          "ref": "15:39",
          "zh": "子曰：「君子疾沒世而名不稱焉。」",
          "en": "The Master said, \"The superior man dislikes the thought of his name not being mentioned after his death.\""
        },
        {
          "ref": "15:40",
          "zh": "子曰：「君子求諸己，小人求諸人。」",
          "en": "The Master said, \"What the superior man seeks, is in himself. What the mean man seeks, is in others.\""
        },
        {
          "ref": "15:41",
          "zh": "子曰：「君子矜而不爭，群而不黨。」",
          "en": "The Master said, \"The superior man is dignified, but does not wrangle. He is sociable, but not a partisan.\""
        },
        {
          "ref": "15:42",
          "zh": "子曰：「君子不以言舉人，不以人廢言。」",
          "en": "The Master said, \"The superior man does not promote a man simply on account of his words, nor does he put aside good words because of the man.\""
        },
        {
          "ref": "15:43",
          "zh": "子貢問曰：「有一言而可以終身行之者乎？」",
          "en": "Zi Gong asked, saying, \"Is there one word which may serve as a rule of practice for all one's life?\""
        },
        {
          "ref": "15:44",
          "zh": "子曰：「其恕乎！己所不欲，勿施於人。」",
          "en": "The Master said, \"Is not RECIPROCITY such a word? What you do not want done to yourself, do not do to others.\""
        },
        {
          "ref": "15:45",
          "zh": "子曰：「吾之於人也，誰毀誰譽？",
          "en": "The Master said, \"In my dealings with men, whose evil do I blame, whose goodness do I praise, beyond what is proper?"
        },
        {
          "ref": "15:46",
          "zh": "如有所譽者，其有所試矣。",
          "en": "If I do sometimes exceed in praise, there must be ground for it in my examination of the individual."
        },
        {
          "ref": "15:47",
          "zh": "斯民也，三代之所以直道而行也。」",
          "en": "This people supplied the ground why the three dynasties pursued the path of straightforwardness.\""
        },
        {
          "ref": "15:48",
          "zh": "子曰：「吾猶及史之闕文也，有馬者借人乘之。",
          "en": "The Master said, \"Even in my early days, a historiographer would leave a blank in his text, and he who had a horse would lend him to another to ride."
        },
        {
          "ref": "15:49",
          "zh": "今亡矣夫！」",
          "en": "Now, alas! there are no such things.\""
        },
        {
          "ref": "15:50",
          "zh": "子曰：「巧言亂德，小不忍則亂大謀。」",
          "en": "The Master said, \"Specious words confound virtue. Want of forbearance in small matters confounds great plans.\""
        },
        {
          "ref": "15:51",
          "zh": "子曰：「眾惡之，必察焉；眾好之，必察焉。」",
          "en": "The Master said, \"When the multitude hate a man, it is necessary to examine into the case. When the multitude like a man, it is necessary to examine into the case.\""
        },
        {
          "ref": "15:52",
          "zh": "子曰：「人能弘道，非道弘人。」",
          "en": "The Master said, \"A man can enlarge the principles which he follows; those principles do not enlarge the man.\""
        },
        {
          "ref": "15:53",
          "zh": "子曰：「過而不改，是謂過矣。」",
          "en": "The Master said, \"To have faults and not to reform them - this, indeed, should be pronounced having faults.\""
        },
        {
          "ref": "15:54",
          "zh": "子曰：「吾嘗終日不食，終夜不寢，以思，無益，不如學也。」",
          "en": "The Master said, \"I have been the whole day without eating, and the whole night without sleeping; occupied with thinking. It was of no use. The better plan is to learn.\""
        },
        {
          "ref": "15:55",
          "zh": "子曰：「君子謀道不謀食。",
          "en": "The Master said, \"The object of the superior man is truth. Food is not his object."
        },
        {
          "ref": "15:56",
          "zh": "耕也，餒在其中矣；學也，祿在其中矣。",
          "en": "There is plowing - even in that there is sometimes want. So with learning - emolument may be found in it."
        },
        {
          "ref": "15:57",
          "zh": "君子憂道不憂貧。」",
          "en": "The superior man is anxious lest he should not get truth; he is not anxious lest poverty should come upon him.\""
        },
        {
          "ref": "15:58",
          "zh": "子曰：「知及之，仁不能守之；雖得之，必失之。",
          "en": "The Master said, \"When a man's knowledge is sufficient to attain, and his virtue is not sufficient to enable him to hold, whatever he may have gained, he will lose again."
        },
        {
          "ref": "15:59",
          "zh": "知及之，仁能守之。不莊以涖之，則民不敬。",
          "en": "When his knowledge is sufficient to attain, and he has virtue enough to hold fast, if he cannot govern with dignity, the people will not respect him."
        },
        {
          "ref": "15:60",
          "zh": "知及之，仁能守之，莊以涖之。動之不以禮，未善也。」",
          "en": "When his knowledge is sufficient to attain, and he has virtue enough to hold fast; when he governs also with dignity, yet if he try to move the people contrary to the rules of propriety - full excellence is not reached.\""
        },
        {
          "ref": "15:61",
          "zh": "子曰：「君子不可小知，而可大受也；小人不可大受，而可小知也。」",
          "en": "The Master said, \"The superior man cannot be known in little matters; but he may be intrusted with great concerns. The small man may not be intrusted with great concerns, but he may be known in little matters.\""
        },
        {
          "ref": "15:62",
          "zh": "子曰：「民之於仁也，甚於水火。",
          "en": "The Master said, \"Virtue is more to man than either water or fire."
        },
        {
          "ref": "15:63",
          "zh": "水火，吾見蹈而死者矣，未見蹈仁而死者也。」",
          "en": "I have seen men die from treading on water and fire, but I have never seen a man die from treading the course of virtue.\""
        },
        {
          "ref": "15:64",
          "zh": "子曰：「當仁不讓於師。」",
          "en": "The Master said, \"Let every man consider virtue as what devolves on himself. He may not yield the performance of it even to his teacher.\""
        },
        {
          "ref": "15:65",
          "zh": "子曰：「君子貞而不諒。」",
          "en": "The Master said, \"The superior man is correctly firm, and not firm merely.\""
        },
        {
          "ref": "15:66",
          "zh": "子曰：「事君，敬其事而後其食。」",
          "en": "The Master said, \"A minister, in serving his prince, reverently discharges his duties, and makes his emolument a secondary consideration.\""
        },
        {
          "ref": "15:67",
          "zh": "子曰：「有教無類。」",
          "en": "The Master said, \"In teaching there should be no distinction of classes.\""
        },
        {
          "ref": "15:68",
          "zh": "子曰：「道不同，不相為謀。」",
          "en": "The Master said, \"Those whose courses are different cannot lay plans for one another.\""
        },
        {
          "ref": "15:69",
          "zh": "子曰：「辭達而已矣。」",
          "en": "The Master said, \"In language it is simply required that it convey the meaning.\""
        },
        {
          "ref": "15:70",
          "zh": "師冕見，及階，子曰：「階也。」",
          "en": "The music master, Mian, having called upon him, when they came to the steps, the Master said, \"Here are the steps.\""
        },
        {
          "ref": "15:71",
          "zh": "及席，子曰：「席也。」",
          "en": "When they came to the mat for the guest to sit upon, he said, \"Here is the mat.\""
        },
        {
          "ref": "15:72",
          "zh": "皆坐，子告之曰：「某在斯，某在斯。」",
          "en": "When all were seated, the Master informed him, saying, \"So and so is here; so and so is here.\""
        },
        {
          "ref": "15:73",
          "zh": "師冕出。",
          "en": "The music master, Mian, having gone out,"
        },
        {
          "ref": "15:74",
          "zh": "子張問曰：「與師言之道與？」",
          "en": "Zi Zhang asked, saying. \"Is it the rule to tell those things to the music master?\""
        },
        {
          "ref": "15:75",
          "zh": "子曰：「然。固相師之道也。」",
          "en": "The Master said, \"Yes. This is certainly the rule for those who lead the blind.\""
        }
      ]
    },
    {
      "number": "16",
      "title": "Ji Shi",
      "slug": "ji-shi",
      "passages": [
        {
          "ref": "16:1",
          "zh": "季氏將伐顓臾。",
          "en": "The head of the Ji family was going to attack Zhuan Yu."
        },
        {
          "ref": "16:2",
          "zh": "冉有、季路見於孔子曰：「季氏將有事於顓臾。」",
          "en": "Ran You and Ji Lu had an interview with Confucius, and said, \"Our chief, Ji, is going to commence operations against Zhuan Yu.\""
        },
        {
          "ref": "16:3",
          "zh": "孔子曰：「求！無乃爾是過與？",
          "en": "Confucius said, \"Qiu, is it not you who are in fault here?"
        },
        {
          "ref": "16:4",
          "zh": "夫顓臾，昔者先王以為東蒙主，且在邦域之中矣，是社稷之臣也。",
          "en": "Now, in regard to Zhuan Yu, long ago, a former king appointed its ruler to preside over the sacrifices to the eastern Mang; moreover, it is in the midst of the territory of our state; and its ruler is a minister in direct connection with the sovereign -"
        },
        {
          "ref": "16:5",
          "zh": "何以伐為？」",
          "en": "What has your chief to do with attacking it?\""
        },
        {
          "ref": "16:6",
          "zh": "冉有曰：「夫子欲之，吾二臣者皆不欲也。」",
          "en": "Ran You said, \"Our master wishes the thing; neither of us two ministers wishes it.\""
        },
        {
          "ref": "16:7",
          "zh": "孔子曰：「求！周任有言曰：『陳力就列，不能者止。』",
          "en": "Confucius said, \"Qiu, there are the words of Zhou Ren, 'When he can put forth his ability, he takes his place in the ranks of office; when he finds himself unable to do so, he retires from it.'"
        },
        {
          "ref": "16:8",
          "zh": "危而不持，顛而不扶，則將焉用彼相矣？",
          "en": "How can he be used as a guide to a blind man, who does not support him when tottering, nor raise him up when fallen?'"
        },
        {
          "ref": "16:9",
          "zh": "且爾言過矣。",
          "en": "And further, you speak wrongly."
        },
        {
          "ref": "16:10",
          "zh": "虎兕出於柙，龜玉毀於櫝中，是誰之過與？」",
          "en": "When a tiger or rhinoceros escapes from his cage; when a tortoise or piece of jade is injured in its repository - whose is the fault?\""
        },
        {
          "ref": "16:11",
          "zh": "冉有曰：「今夫顓臾，固而近於費。",
          "en": "Ran You said, \"But at present, Zhuan Yu is strong and near to Fei;"
        },
        {
          "ref": "16:12",
          "zh": "今不取，後世必為子孫憂。」",
          "en": "if our chief do not now take it, it will hereafter be a sorrow to his descendants.\""
        },
        {
          "ref": "16:13",
          "zh": "孔子曰：「求！君子疾夫舍曰欲之，而必為之辭。",
          "en": "Confucius said. \"Qiu, the superior man hates those declining to say 'I want such and such a thing,' and framing explanations for their conduct."
        },
        {
          "ref": "16:14",
          "zh": "丘也聞有國有家者，不患寡而患不均，不患貧而患不安。",
          "en": "I have heard that rulers of states and chiefs of families are not troubled lest their people should be few, but are troubled lest they should not keep their several places; that they are not troubled with fears of poverty, but are troubled with fears of a want of contented repose among the people in their several places."
        },
        {
          "ref": "16:15",
          "zh": "蓋均無貧，和無寡，安無傾。",
          "en": "For when the people keep their several places, there will be no poverty; when harmony prevails, there will be no scarcity of people; and when there is such a contented repose, there will be no rebellious upsettings."
        },
        {
          "ref": "16:16",
          "zh": "夫如是，故遠人不服，則修文德以來之。",
          "en": "So it is. Therefore, if remoter people are not submissive, all the influences of civil culture and virtue are to be cultivated to attract them to be so;"
        },
        {
          "ref": "16:17",
          "zh": "既來之，則安之。",
          "en": "and when they have been so attracted, they must be made contented and tranquil."
        },
        {
          "ref": "16:18",
          "zh": "今由與求也，相夫子，遠人不服而不能來也；邦分崩離析而不能守也。",
          "en": "Now, here are you, You and Qiu, assisting your chief. Remoter people are not submissive, and, with your help, he cannot attract them to him. In his own territory there are divisions and downfalls, leavings and separations, and, with your help, he cannot preserve it."
        },
        {
          "ref": "16:19",
          "zh": "而謀動干戈於邦內。",
          "en": "And yet he is planning these hostile movements within the state."
        },
        {
          "ref": "16:20",
          "zh": "吾恐季孫之憂，不在顓臾，而在蕭牆之內也。」",
          "en": "I am afraid that the sorrow of the Ji Sun family will not be on account of Zhuan Yu, but will be found within the screen of their own court.\""
        },
        {
          "ref": "16:21",
          "zh": "孔子曰：「天下有道，則禮樂征伐自天子出；天下無道，則禮樂征伐自諸侯出。",
          "en": "Confucius said, \"When good government prevails in the empire, ceremonies, music, and punitive military expeditions proceed from the son of Heaven. When bad government prevails in the empire, ceremonies, music, and punitive military expeditions proceed from the princes."
        },
        {
          "ref": "16:22",
          "zh": "自諸侯出，蓋十世希不失矣；自大夫出，五世希不失矣；陪臣執國命，三世希不失矣。",
          "en": "When these things proceed from the princes, as a rule, the cases will be few in which they do not lose their power in ten generations. When they proceed from the great officers of the princes, as a rule, the case will be few in which they do not lose their power in five generations. When the subsidiary ministers of the great officers hold in their grasp the orders of the state, as a rule the cases will be few in which they do not lose their power in three generations."
        },
        {
          "ref": "16:23",
          "zh": "天下有道，則政不在大夫。",
          "en": "When right principles prevail in the kingdom, government will not be in the hands of the great officers."
        },
        {
          "ref": "16:24",
          "zh": "天下有道，則庶人不議。」",
          "en": "When right principles prevail in the kingdom, there will be no discussions among the common people.\""
        },
        {
          "ref": "16:25",
          "zh": "孔子曰：「祿之去公室，五世矣；政逮於大夫，四世矣；故夫三桓之子孫，微矣。」",
          "en": "Confucius said, \"The revenue of the state has left the ducal house now for five generations. The government has been in the hands of the great officers for four generations. On this account, the descendants of the three Huan are much reduced.\""
        },
        {
          "ref": "16:26",
          "zh": "孔子曰：「益者三友，損者三友。",
          "en": "Confucius said, \"There are three friendships which are advantageous, and three which are injurious."
        },
        {
          "ref": "16:27",
          "zh": "友直，友諒，友多聞，益矣。",
          "en": "Friendship with the uplight; friendship with the sincere; and friendship with the man of much observation - these are advantageous."
        },
        {
          "ref": "16:28",
          "zh": "友便辟，友善柔，友便佞，損矣。」",
          "en": "Friendship with the man of specious airs; friendship with the insinuatingly soft; and friendship with the glib-tongued - these are injurious.\""
        },
        {
          "ref": "16:29",
          "zh": "孔子曰：「益者三樂，損者三樂。",
          "en": "Confucius said, \"There are three things men find enjoyment in which are advantageous, and three things they find enjoyment in which are injurious."
        },
        {
          "ref": "16:30",
          "zh": "樂節禮樂，樂道人之善，樂多賢友，益矣。",
          "en": "To find enjoyment in the discriminating study of ceremonies and music; to find enjoyment in speaking of the goodness of others; to find enjoyment in having many worthy friends - these are advantageous."
        },
        {
          "ref": "16:31",
          "zh": "樂驕樂，樂佚遊，樂宴樂，損矣。」",
          "en": "To find enjoyment in extravagant pleasures; to find enjoyment in idleness and sauntering; to find enjoyment in the pleasures of feasting - these are injurious.\""
        },
        {
          "ref": "16:32",
          "zh": "孔子曰：「侍於君子有三愆：言未及之而言謂之躁，言及之而不言謂之隱，未見顏色而言謂之瞽。」",
          "en": "Confucius said, \"There are three errors to which they who stand in the presence of a man of virtue and station are liable. They may speak when it does not come to them to speak - this is called rashness. They may not speak when it comes to them to speak - this is called concealment. They may speak without looking at the countenance of their superior - this is called blindness.\""
        },
        {
          "ref": "16:33",
          "zh": "孔子曰：「君子有三戒：少之時，血氣未定，戒之在色；及其壯也，血氣方剛，戒之在鬭；及其老也，血氣既衰，戒之在得。」",
          "en": "Confucius said, \"There are three things which the superior man guards against. In youth, when the physical powers are not yet settled, he guards against lust. When he is strong and the physical powers are full of vigor, he guards against quarrelsomeness. When he is old, and the animal powers are decayed, he guards against covetousness.\""
        },
        {
          "ref": "16:34",
          "zh": "孔子曰：「君子有三畏：畏天命，畏大人，畏聖人之言。",
          "en": "Confucius said, \"There are three things of which the superior man stands in awe. He stands in awe of the ordinances of Heaven. He stands in awe of great men. He stands in awe of the words of sages."
        },
        {
          "ref": "16:35",
          "zh": "小人不知天命而不畏也，狎大人，侮聖人之言。」",
          "en": "The mean man does not know the ordinances of Heaven, and consequently does not stand in awe of them. He is disrespectful to great men. He makes sport of the words of sages.\""
        },
        {
          "ref": "16:36",
          "zh": "孔子曰：「生而知之者，上也；學而知之者，次也；困而學之，又其次也；困而不學，民斯為下矣。」",
          "en": "Confucius said, \"Those who are born with the possession of knowledge are the highest class of men. Those who learn, and so, readily, get possession of knowledge, are the next. Those who are dull and stupid, and yet compass the learning, are another class next to these. As to those who are dull and stupid and yet do not learn - they are the lowest of the people.\""
        },
        {
          "ref": "16:37",
          "zh": "孔子曰：「君子有九思：視思明，聽思聰，色思溫，貌思恭，言思忠，事思敬，疑思問，忿思難，見得思義。」",
          "en": "Confucius said, \"The superior man has nine things which are subjects with him of thoughtful consideration. In regard to the use of his eyes, he is anxious to see clearly. In regard to the use of his ears, he is anxious to hear distinctly. In regard to his countenance, he is anxious that it should be benign. In regard to his demeanor, he is anxious that it should be respectful. In regard to his speech, he is anxious that it should be sincere. In regard to his doing of business, he is anxious that it should be reverently careful. In regard to what he doubts about, he is anxious to question others. When he is angry, he thinks of the difficulties (his anger may involve him in). When he sees gain to be got, he thinks of righteousness.\""
        },
        {
          "ref": "16:38",
          "zh": "孔子曰：「見善如不及，見不善如探湯。",
          "en": "Confucius said, \"Contemplating good, and pursuing it, as if they could not reach it; contemplating evil and shrinking from it, as they would from thrusting the hand into boiling water -"
        },
        {
          "ref": "16:39",
          "zh": "吾見其人矣，吾聞其語矣。",
          "en": "I have seen such men, as I have heard such words."
        },
        {
          "ref": "16:40",
          "zh": "隱居以求其志，行義以達其道。",
          "en": "Living in retirement to study their aims, and practicing righteousness to carry out their principles -"
        },
        {
          "ref": "16:41",
          "zh": "吾聞其語矣，未見其人也。」",
          "en": "I have heard these words, but I have not seen such men.\""
        },
        {
          "ref": "16:42",
          "zh": "齊景公有馬千駟，死之日，民無德而稱焉。",
          "en": "The Duke Jing of Qi had a thousand teams, each of four horses, but on the day of his death, the people did not praise him for a single virtue."
        },
        {
          "ref": "16:43",
          "zh": "伯夷叔齊餓于首陽之下，民到于今稱之。",
          "en": "Bo Yi and Shu Qi died of hunger at the foot of the Shou Yang mountain, and the people, down to the present time, praise them."
        },
        {
          "ref": "16:44",
          "zh": "其斯之謂與？",
          "en": "Is not that saying illustrated by this?"
        },
        {
          "ref": "16:45",
          "zh": "陳亢問於伯魚曰：「子亦有異聞乎？」",
          "en": "Chen Kang asked Bo Yu, saying, \"Have you heard any lessons from your father different from what we have all heard?\""
        },
        {
          "ref": "16:46",
          "zh": "對曰：「未也。",
          "en": "Bo Yu replied, \"No."
        },
        {
          "ref": "16:47",
          "zh": "嘗獨立，鯉趨而過庭。",
          "en": "He was standing alone once, when I passed below the hall with hasty steps,"
        },
        {
          "ref": "16:48",
          "zh": "曰：『學詩乎？』",
          "en": "and said to me, 'Have you learned the Odes?'"
        },
        {
          "ref": "16:49",
          "zh": "對曰：『未也。』",
          "en": "On my replying 'Not yet,'"
        },
        {
          "ref": "16:50",
          "zh": "『不學詩，無以言。』",
          "en": "he added, 'If you do not learn the Odes, you will not be fit to converse with.'"
        },
        {
          "ref": "16:51",
          "zh": "鯉退而學詩。",
          "en": "I retired and studied the Odes."
        },
        {
          "ref": "16:52",
          "zh": "他日又獨立，鯉趨而過庭。",
          "en": "Another day, he was in the same way standing alone, when I passed by below the hall with hasty steps,"
        },
        {
          "ref": "16:53",
          "zh": "曰：『學禮乎？』",
          "en": "and said to me, 'Have you learned the rules of Propriety?'"
        },
        {
          "ref": "16:54",
          "zh": "對曰：『未也。』",
          "en": "On my replying 'Not yet,'"
        },
        {
          "ref": "16:55",
          "zh": "『不學禮，無以立。』",
          "en": "he added, 'If you do not learn the rules of Propriety, your character cannot be established.'"
        },
        {
          "ref": "16:56",
          "zh": "鯉退而學禮。",
          "en": "I then retired, and learned the rules of Propriety."
        },
        {
          "ref": "16:57",
          "zh": "聞斯二者。」",
          "en": "I have heard only these two things from him.\""
        },
        {
          "ref": "16:58",
          "zh": "陳亢退而喜曰：「問一得三，聞詩，聞禮，又聞君子之遠其子也。」",
          "en": "Chen Kang retired, and, quite delighted, said, \"I asked one thing, and I have got three things. I have heard about the Odes. I have heard about the rules of Propriety. I have also heard that the superior man maintains a distant reserve towards his son.\""
        },
        {
          "ref": "16:59",
          "zh": "邦君之妻，君稱之曰夫人，夫人自稱曰小童；邦人稱之曰君夫人，稱諸異邦曰寡小君；異邦人稱之亦曰君夫人。",
          "en": "The wife of the prince of a state is called by him \"fu ren\". She calls herself \"xiao tong\". The people of the state call her \"jun fu ren\", and, to the people of other states, they call her \"gua xiao jun\". The people of other states also call her \"jun fu ren\"."
        }
      ]
    },
    {
      "number": "17",
      "title": "Yang Huo",
      "slug": "yang-huo",
      "passages": [
        {
          "ref": "17:1",
          "zh": "陽貨欲見孔子，孔子不見，歸孔子豚。",
          "en": "Yang Huo wished to see Confucius, but Confucius would not go to see him. On this, he sent a present of a pig to Confucius,"
        },
        {
          "ref": "17:2",
          "zh": "孔子時其亡也，而往拜之，遇諸塗。",
          "en": "who, having chosen a time when Huo was not at home, went to pay his respects for the gift. He met him, however, on the way."
        },
        {
          "ref": "17:3",
          "zh": "謂孔子曰：「來！予與爾言。」",
          "en": "Huo said to Confucius, \"Come, let me speak with you.\""
        },
        {
          "ref": "17:4",
          "zh": "曰：「懷其寶而迷其邦，可謂仁乎？」曰：「不可。」",
          "en": "He then asked, \"Can he be called benevolent who keeps his jewel in his bosom, and leaves his country to confusion?\" Confucius replied, \"No.\""
        },
        {
          "ref": "17:5",
          "zh": "「好從事而亟失時，可謂知乎？」曰：「不可。」",
          "en": "\"Can he be called wise, who is anxious to be engaged in public employment, and yet is constantly losing the opportunity of being so?\" Confucius again said, \"No.\""
        },
        {
          "ref": "17:6",
          "zh": "「日月逝矣，歲不我與。」",
          "en": "\"The days and months are passing away; the years do not wait for us.\""
        },
        {
          "ref": "17:7",
          "zh": "孔子曰：「諾。吾將仕矣。」",
          "en": "Confucius said, \"Right; I will go into office.\""
        },
        {
          "ref": "17:8",
          "zh": "子曰：「性相近也，習相遠也。」",
          "en": "The Master said, \"By nature, men are nearly alike; by practice, they get to be wide apart.\""
        },
        {
          "ref": "17:9",
          "zh": "子曰：「唯上知與下愚不移。」",
          "en": "The Master said, \"There are only the wise of the highest class, and the stupid of the lowest class, who cannot be changed.\""
        },
        {
          "ref": "17:10",
          "zh": "子之武城，聞弦歌之聲。",
          "en": "The Master, having come to Wu Cheng, heard there the sound of stringed instruments and singing."
        },
        {
          "ref": "17:11",
          "zh": "夫子莞爾而笑，曰：「割雞焉用牛刀？」",
          "en": "Well pleased and smiling, he said, \"Why use an ox knife to kill a fowl?\""
        },
        {
          "ref": "17:12",
          "zh": "子游對曰：「昔者偃也聞諸夫子曰：『君子學道則愛人，小人學道則易使也。』」",
          "en": "Zi You replied, \"Formerly, Master, I heard you say, 'When the man of high station is well instructed, he loves men; when the man of low station is well instructed, he is easily ruled.'\""
        },
        {
          "ref": "17:13",
          "zh": "子曰：「二三子！偃之言是也。前言戲之耳。」",
          "en": "The Master said, \"My disciples, Yan's words are right. What I said was only in sport.\""
        },
        {
          "ref": "17:14",
          "zh": "公山弗擾以費畔，召，子欲往。",
          "en": "Gong Shan Fo Rao, when he was holding Fei, and in an attitude of rebellion, invited the Master to visit him, who was rather inclined to go."
        },
        {
          "ref": "17:15",
          "zh": "子路不說，曰：「末之也已，何必公山氏之之也。」",
          "en": "Zi Lu was displeased, and said, \"Indeed, you cannot go! Why must you think of going to see Gong Shan?\""
        },
        {
          "ref": "17:16",
          "zh": "子曰：「夫召我者而豈徒哉？如有用我者，吾其為東周乎？」",
          "en": "The Master said, \"Can it be without some reason that he has invited me? If any one employ me, may I not make an eastern Zhou?\""
        },
        {
          "ref": "17:17",
          "zh": "子張問仁於孔子。",
          "en": "Zi Zhang asked Confucius about perfect virtue."
        },
        {
          "ref": "17:18",
          "zh": "孔子曰：「能行五者於天下，為仁矣。」",
          "en": "Confucius said, \"To be able to practice five things everywhere under heaven constitutes perfect virtue.\""
        },
        {
          "ref": "17:19",
          "zh": "請問之。",
          "en": "He begged to ask what they were,"
        },
        {
          "ref": "17:20",
          "zh": "曰：「恭、寬、信、敏、惠。",
          "en": "and was told, \"Gravity, generosity of soul, sincerity, earnestness, and kindness."
        },
        {
          "ref": "17:21",
          "zh": "恭則不侮，寬則得眾，信則人任焉，敏則有功，惠則足以使人。」",
          "en": "If you are grave, you will not be treated with disrespect. If you are generous, you will win all. If you are sincere, people will repose trust in you. If you are earnest, you will accomplish much. If you are kind, this will enable you to employ the services of others.\""
        },
        {
          "ref": "17:22",
          "zh": "佛肸召，子欲往。",
          "en": "Bi Xi inviting him to visit him, the Master was inclined to go."
        },
        {
          "ref": "17:23",
          "zh": "子路曰：「昔者由也聞諸夫子曰：『親於其身為不善者，君子不入也。』",
          "en": "Zi Lu said, \"Master, formerly I have heard you say, 'When a man in his own person is guilty of doing evil, a superior man will not associate with him.'"
        },
        {
          "ref": "17:24",
          "zh": "佛肸以中牟畔，子之往也，如之何！」",
          "en": "Bi Xi is in rebellion, holding possession of Zhong Mou; if you go to him, what shall be said?\""
        },
        {
          "ref": "17:25",
          "zh": "子曰：「然。有是言也。",
          "en": "The Master said, \"Yes, I did use these words."
        },
        {
          "ref": "17:26",
          "zh": "不曰堅乎，磨而不磷；不曰白乎，涅而不緇。",
          "en": "But is it not said, that, if a thing be really hard, it may be ground without being made thin? Is it not said, that, if a thing be really white, it may be steeped in a dark fluid without being made black?"
        },
        {
          "ref": "17:27",
          "zh": "吾豈匏瓜也哉？焉能繫而不食？」",
          "en": "Am I a bitter gourd? How can I be hung up out of the way of being eaten?\""
        },
        {
          "ref": "17:28",
          "zh": "子曰：「由也，女聞六言六蔽矣乎？」",
          "en": "The Master said, \"You, have you heard the six words to which are attached six becloudings?\""
        },
        {
          "ref": "17:29",
          "zh": "對曰：「未也。」",
          "en": "You replied, \"I have not.\""
        },
        {
          "ref": "17:30",
          "zh": "「居！吾語女。",
          "en": "\"Sit down, and I will tell them to you."
        },
        {
          "ref": "17:31",
          "zh": "好仁不好學，其蔽也愚；好知不好學，其蔽也蕩；好信不好學，其蔽也賊；好直不好學，其蔽也絞；好勇不好學，其蔽也亂；好剛不好學，其蔽也狂。」",
          "en": "There is the love of being benevolent without the love of learning - the beclouding here leads to a foolish simplicity. There is the love of knowing without the love of learning - the beclouding here leads to dissipation of mind. There is the love of being sincere without the love of learning - the beclouding here leads to an injurious disregard of consequences. There is the love of straightforwardness without the love of learning - the beclouding here leads to rudeness. There is the love of boldness without the love of learning - the beclouding here leads to insubordination. There is the love of firmness without the love of learning - the beclouding here leads to extravagant conduct.\""
        },
        {
          "ref": "17:32",
          "zh": "子曰：「小子！何莫學夫詩？",
          "en": "The Master said, \"My children, why do you not study the Book of Poetry?"
        },
        {
          "ref": "17:33",
          "zh": "詩，可以興，可以觀，可以群，可以怨。",
          "en": "The Odes serve to stimulate the mind. They may be used for purposes of self-contemplation. They teach the art of sociability. They show how to regulate feelings of resentment."
        },
        {
          "ref": "17:34",
          "zh": "邇之事父，遠之事君。",
          "en": "From them you learn the more immediate duty of serving one's father, and the remoter one of serving one's prince."
        },
        {
          "ref": "17:35",
          "zh": "多識於鳥獸草木之名。」",
          "en": "From them we become largely acquainted with the names of birds, beasts, and plants.\""
        },
        {
          "ref": "17:36",
          "zh": "子謂伯魚曰：「女為《周南》、《召南》矣乎？",
          "en": "The Master said to Bo Yu, \"Do you give yourself to the Zhou Nan and the Shao Nan."
        },
        {
          "ref": "17:37",
          "zh": "人而不為《周南》、《召南》，其猶正牆面而立也與？」",
          "en": "The man who has not studied the Zhou Nan and the Shao Nan is like one who stands with his face right against a wall. Is he not so?\""
        },
        {
          "ref": "17:38",
          "zh": "子曰：「禮云禮云，玉帛云乎哉？樂云樂云，鐘鼓云乎哉？」",
          "en": "The Master said, \"'It is according to the rules of propriety,' they say. 'It is according to the rules of propriety,' they say. Are gems and silk all that is meant by propriety? 'It is music,' they say. 'It is music,' they say. Are bells and drums all that is meant by music?\""
        },
        {
          "ref": "17:39",
          "zh": "子曰：「色厲而內荏，譬諸小人，其猶穿窬之盜也與？」",
          "en": "The Master said, \"He who puts on an appearance of stern firmness, while inwardly he is weak, is like one of the small, mean people - yea, is he not like the thief who breaks through, or climbs over, a wall?\""
        },
        {
          "ref": "17:40",
          "zh": "子曰：「鄉原，德之賊也。」",
          "en": "The Master said, \"Your good, careful people of the villages are the thieves of virtue.\""
        },
        {
          "ref": "17:41",
          "zh": "子曰：「道聽而塗說，德之棄也。」",
          "en": "The Master said, \"To tell, as we go along, what we have heard on the way, is to cast away our virtue.\""
        },
        {
          "ref": "17:42",
          "zh": "子曰：「鄙夫！可與事君也與哉？",
          "en": "The Master said, \"There are those mean creatures! How impossible it is along with them to serve one's prince!"
        },
        {
          "ref": "17:43",
          "zh": "其未得之也，患得之；既得之，患失之。",
          "en": "While they have not got their aims, their anxiety is how to get them. When they have got them, their anxiety is lest they should lose them."
        },
        {
          "ref": "17:44",
          "zh": "苟患失之，無所不至矣。」",
          "en": "When they are anxious lest such things should be lost, there is nothing to which they will not proceed.\""
        },
        {
          "ref": "17:45",
          "zh": "子曰：「古者民有三疾，今也或是之亡也。",
          "en": "The Master said, \"Anciently, men had three failings, which now perhaps are not to be found."
        },
        {
          "ref": "17:46",
          "zh": "古之狂也肆，今之狂也蕩；古之矜也廉，今之矜也忿戾；古之愚也直，今之愚也詐而已矣。」",
          "en": "The high-mindedness of antiquity showed itself in a disregard of small things; the high-mindedness of the present day shows itself in wild license. The stern dignity of antiquity showed itself in grave reserve; the stern dignity of the present day shows itself in quarrelsome perverseness. The stupidity of antiquity showed itself in straightforwardness; the stupidity of the present day shows itself in sheer deceit.\""
        },
        {
          "ref": "17:47",
          "zh": "子曰：「巧言令色，鮮矣仁。」",
          "en": "The Master said, \"Fine words and an insinuating appearance are seldom associated with virtue.\""
        },
        {
          "ref": "17:48",
          "zh": "子曰：「惡紫之奪朱也，惡鄭聲之亂雅樂也，惡利口之覆邦家者。」",
          "en": "The Master said, \"I hate the manner in which purple takes away the luster of vermilion. I hate the way in which the songs of Zheng confound the music of the Ya. I hate those who with their sharp mouths overthrow kingdoms and families.\""
        },
        {
          "ref": "17:49",
          "zh": "子曰：「予欲無言。」",
          "en": "The Master said, \"I would prefer not speaking.\""
        },
        {
          "ref": "17:50",
          "zh": "子貢曰：「子如不言，則小子何述焉？」",
          "en": "Zi Gong said, \"If you, Master, do not speak, what shall we, your disciples, have to record?\""
        },
        {
          "ref": "17:51",
          "zh": "子曰：「天何言哉？四時行焉，百物生焉，天何言哉？」",
          "en": "The Master said, \"Does Heaven speak? The four seasons pursue their courses, and all things are continually being produced, but does Heaven say anything?\""
        },
        {
          "ref": "17:52",
          "zh": "孺悲欲見孔子，孔子辭以疾。",
          "en": "Ru Bei wished to see Confucius, but Confucius declined, on the ground of being sick, to see him."
        },
        {
          "ref": "17:53",
          "zh": "將命者出戶，取瑟而歌。使之聞之。",
          "en": "When the bearer of this message went out at the door, (the Master) took his lute and sang to it, in order that Bei might hear him."
        },
        {
          "ref": "17:54",
          "zh": "宰我問：「三年之喪，期已久矣。",
          "en": "Zai Wo asked about the three years' mourning for parents, saying that one year was long enough."
        },
        {
          "ref": "17:55",
          "zh": "君子三年不為禮，禮必壞；三年不為樂，樂必崩。",
          "en": "\"If the superior man abstains for three years from the observances of propriety, those observances will be quite lost. If for three years he abstains from music, music will be ruined."
        },
        {
          "ref": "17:56",
          "zh": "舊穀既沒，新穀既升，鑽燧改火，期可已矣。」",
          "en": "Within a year the old grain is exhausted, and the new grain has sprung up, and, in procuring fire by friction, we go through all the changes of wood for that purpose. After a complete year, the mourning may stop.\""
        },
        {
          "ref": "17:57",
          "zh": "子曰：「食夫稻，衣夫錦，於女安乎？」",
          "en": "The Master said, \"If you were, after a year, to eat good rice, and wear embroidered clothes, would you feel at ease?\""
        },
        {
          "ref": "17:58",
          "zh": "曰：「安。」",
          "en": "\"I should,\" replied Wo."
        },
        {
          "ref": "17:59",
          "zh": "「女安則為之！",
          "en": "The Master said, \"If you can feel at ease, do it."
        },
        {
          "ref": "17:60",
          "zh": "夫君子之居喪，食旨不甘，聞樂不樂，居處不安，故不為也。",
          "en": "But a superior man, during the whole period of mourning, does not enjoy pleasant food which he may eat, nor derive pleasure from music which he may hear. He also does not feel at ease, if he is comfortably lodged. Therefore he does not do what you propose."
        },
        {
          "ref": "17:61",
          "zh": "今女安，則為之！」",
          "en": "But now you feel at ease and may do it.\""
        },
        {
          "ref": "17:62",
          "zh": "宰我出。",
          "en": "Zai Wo then went out,"
        },
        {
          "ref": "17:63",
          "zh": "子曰：「予之不仁也！",
          "en": "and the Master said, \"This shows Yu's want of virtue."
        },
        {
          "ref": "17:64",
          "zh": "子生三年，然後免於父母之懷。",
          "en": "It is not till a child is three years old that it is allowed to leave the arms of its parents."
        },
        {
          "ref": "17:65",
          "zh": "夫三年之喪，天下之通喪也。",
          "en": "And the three years' mourning is universally observed throughout the empire."
        },
        {
          "ref": "17:66",
          "zh": "予也，有三年之愛於其父母乎？」",
          "en": "Did Yu enjoy the three years' love of his parents?\""
        },
        {
          "ref": "17:67",
          "zh": "子曰：「飽食終日，無所用心，難矣哉！",
          "en": "The Master said, \"Hard is it to deal with who will stuff himself with food the whole day, without applying his mind to anything good!"
        },
        {
          "ref": "17:68",
          "zh": "不有博弈者乎，為之猶賢乎已。」",
          "en": "Are there not gamesters and chess players? To be one of these would still be better than doing nothing at all.\""
        },
        {
          "ref": "17:69",
          "zh": "子路曰：「君子尚勇乎？」",
          "en": "Zi Lu said, \"Does the superior man esteem valor?\""
        },
        {
          "ref": "17:70",
          "zh": "子曰：「君子義以為上。",
          "en": "The Master said, \"The superior man holds righteousness to be of highest importance."
        },
        {
          "ref": "17:71",
          "zh": "君子有勇而無義為亂，小人有勇而無義為盜。」",
          "en": "A man in a superior situation, having valor without righteousness, will be guilty of insubordination; one of the lower people having valor without righteousness, will commit robbery.\""
        },
        {
          "ref": "17:72",
          "zh": "子貢曰：「君子亦有惡乎？」",
          "en": "Zi Gong said, \"Has the superior man his hatreds also?\""
        },
        {
          "ref": "17:73",
          "zh": "子曰：「有惡：惡稱人之惡者，惡居下流而訕上者，惡勇而無禮者，惡果敢而窒者。」",
          "en": "The Master said, \"He has his hatreds. He hates those who proclaim the evil of others. He hates the man who, being in a low station, slanders his superiors. He hates those who have valor merely, and are unobservant of propriety. He hates those who are forward and determined, and, at the same time, of contracted understanding.\""
        },
        {
          "ref": "17:74",
          "zh": "曰：「賜也亦有惡乎？」",
          "en": "The Master then inquired, \"Ci, have you also your hatreds?\""
        },
        {
          "ref": "17:75",
          "zh": "「惡徼以為知者，惡不孫以為勇者，惡訐以為直者。」",
          "en": "Zi Gong replied, \"I hate those who pry out matters, and ascribe the knowledge to their wisdom. I hate those who are only not modest, and think that they are valorous. I hate those who make known secrets, and think that they are straightforward.\""
        },
        {
          "ref": "17:76",
          "zh": "子曰：「唯女子與小人為難養也，近之則不孫，遠之則怨。」",
          "en": "The Master said, \"Of all people, girls and servants are the most difficult to behave to. If you are familiar with them, they lose their humility. If you maintain a reserve towards them, they are discontented.\""
        },
        {
          "ref": "17:77",
          "zh": "子曰：「年四十而見惡焉，其終也已。」",
          "en": "The Master said, \"When a man at forty is the object of dislike, he will always continue what he is.\""
        }
      ]
    },
    {
      "number": "18",
      "title": "Wei Zi",
      "slug": "wei-zi",
      "passages": [
        {
          "ref": "18:1",
          "zh": "微子去之，箕子為之奴，比干諫而死。",
          "en": "The Viscount of Wei withdrew from the court. The Viscount of Ji became a slave to Zhou. Bi Gan remonstrated with him and died."
        },
        {
          "ref": "18:2",
          "zh": "孔子曰：「殷有三仁焉。」",
          "en": "Confucius said, \"The Yin dynasty possessed these three men of virtue.\""
        },
        {
          "ref": "18:3",
          "zh": "柳下惠為士師，三黜。",
          "en": "Hui of Liu Xia, being chief criminal judge, was thrice dismissed from his office."
        },
        {
          "ref": "18:4",
          "zh": "人曰：「子未可以去乎？」",
          "en": "Some one said to him, \"Is it not yet time for you, sir, to leave this?\""
        },
        {
          "ref": "18:5",
          "zh": "曰：「直道而事人，焉往而不三黜？",
          "en": "He replied, \"Serving men in an upright way, where shall I go to, and not experience such a thrice-repeated dismissal?"
        },
        {
          "ref": "18:6",
          "zh": "枉道而事人，何必去父母之邦。」",
          "en": "If I choose to serve men in a crooked way, what necessity is there for me to leave the country of my parents?\""
        },
        {
          "ref": "18:7",
          "zh": "齊景公待孔子，曰：「若季氏則吾不能，以季、孟之閒待之。」",
          "en": "The duke Jing of Qi, with reference to the manner in which he should treat Confucius, said, \"I cannot treat him as I would the chief of the Ji family. I will treat him in a manner between that accorded to the chief of the Ji, and that given to the chief of the Meng family.\""
        },
        {
          "ref": "18:8",
          "zh": "曰：「吾老矣，不能用也。」",
          "en": "He also said, \"I am old; I cannot use his doctrines.\""
        },
        {
          "ref": "18:9",
          "zh": "孔子行。",
          "en": "Confucius took his departure."
        },
        {
          "ref": "18:10",
          "zh": "齊人歸女樂，季桓子受之。",
          "en": "The people of Qi sent to Lu a present of female musicians, which Ji Huan received,"
        },
        {
          "ref": "18:11",
          "zh": "三日不朝，孔子行。",
          "en": "and for three days no court was held. Confucius took his departure."
        },
        {
          "ref": "18:12",
          "zh": "楚狂接輿歌而過孔子曰：「鳳兮！鳳兮！何德之衰？",
          "en": "The madman of Chu, Jie Yu, passed by Confucius, singing and saying, \"O Feng! O Feng! How is your virtue degenerated!"
        },
        {
          "ref": "18:13",
          "zh": "往者不可諫，來者猶可追。",
          "en": "As to the past, reproof is useless; but the future may still be provided against."
        },
        {
          "ref": "18:14",
          "zh": "已而，已而！今之從政者殆而！」",
          "en": "Give up your vain pursuit. Give up your vain pursuit. Peril awaits those who now engage in affairs of government.\""
        },
        {
          "ref": "18:15",
          "zh": "孔子下，欲與之言。",
          "en": "Confucius alighted and wished to converse with him,"
        },
        {
          "ref": "18:16",
          "zh": "趨而辟之，不得與之言。",
          "en": "but Jie Yu hastened away, so that he could not talk with him."
        },
        {
          "ref": "18:17",
          "zh": "長沮、桀溺耦而耕，孔子過之，使子路問津焉。",
          "en": "Chang Zu and Jie Ni were at work in the field together, when Confucius passed by them, and sent Zi Lu to inquire for the ford."
        },
        {
          "ref": "18:18",
          "zh": "長沮曰：「夫執輿者為誰？」",
          "en": "Chang Zu said, \"Who is he that holds the reins in the carriage there?\""
        },
        {
          "ref": "18:19",
          "zh": "子路曰：「為孔丘。」",
          "en": "Zi Lu told him, \"It is Kong Qiu.\""
        },
        {
          "ref": "18:20",
          "zh": "曰：「是魯孔丘與？」",
          "en": "\"Is it not Kong Qiu of Lu?\" asked he."
        },
        {
          "ref": "18:21",
          "zh": "曰：「是也。」",
          "en": "\"Yes,\" was the reply,"
        },
        {
          "ref": "18:22",
          "zh": "曰：「是知津矣。」",
          "en": "to which the other rejoined, \"He knows the ford.\""
        },
        {
          "ref": "18:23",
          "zh": "問於桀溺，桀溺曰：「子為誰？」",
          "en": "Zi Lu then inquired of Jie Ni, who said to him, \"Who are you, sir?\""
        },
        {
          "ref": "18:24",
          "zh": "曰：「為仲由。」",
          "en": "He answered, \"I am Zhong You.\""
        },
        {
          "ref": "18:25",
          "zh": "曰：「是魯孔丘之徒與？」",
          "en": "\"Are you not the disciple of Kong Qiu of Lu?\" asked the other."
        },
        {
          "ref": "18:26",
          "zh": "對曰：「然。」",
          "en": "\"I am,\" replied he,"
        },
        {
          "ref": "18:27",
          "zh": "曰：「滔滔者天下皆是也，而誰以易之？",
          "en": "and then Jie Ni said to him, \"Disorder, like a swelling flood, spreads over the whole empire, and who is he that will change its state for you?"
        },
        {
          "ref": "18:28",
          "zh": "且而與其從辟人之士也，豈若從辟世之士哉？」",
          "en": "Rather than follow one who merely withdraws from this one and that one, had you not better follow those who have withdrawn from the world altogether?\""
        },
        {
          "ref": "18:29",
          "zh": "耰而不輟。",
          "en": "With this he fell to covering up the seed, and proceeded with his work, without stopping."
        },
        {
          "ref": "18:30",
          "zh": "子路行以告。",
          "en": "Zi Lu went and reported their remarks,"
        },
        {
          "ref": "18:31",
          "zh": "夫子憮然曰：「鳥獸不可與同群，吾非斯人之徒與而誰與？",
          "en": "when the Master observed with a sigh, \"It is impossible to associate with birds and beasts, as if they were the same with us. If I associate not with these people - with mankind - with whom shall I associate?"
        },
        {
          "ref": "18:32",
          "zh": "天下有道，丘不與易也。」",
          "en": "If right principles prevailed through the empire, there would be no use for me to change its state.\""
        },
        {
          "ref": "18:33",
          "zh": "子路從而後，遇丈人，以杖荷蓧。",
          "en": "Zi Lu, following the Master, happened to fall behind, when he met an old man, carrying across his shoulder on a staff a basket for weeds."
        },
        {
          "ref": "18:34",
          "zh": "子路問曰：「子見夫子乎？」",
          "en": "Zi Lu said to him, \"Have you seen my master, sir?\""
        },
        {
          "ref": "18:35",
          "zh": "丈人曰：「四體不勤，五穀不分。孰為夫子？」",
          "en": "The old man replied, \"Your four limbs are unaccustomed to toil; you cannot distinguish the five kinds of grain - who is your master?\""
        },
        {
          "ref": "18:36",
          "zh": "植其杖而芸。",
          "en": "With this, he planted his staff in the ground, and proceeded to weed."
        },
        {
          "ref": "18:37",
          "zh": "子路拱而立。",
          "en": "Zi Lu joined his hands across his breast, and stood before him."
        },
        {
          "ref": "18:38",
          "zh": "止子路宿，殺雞為黍而食之，見其二子焉。",
          "en": "The old man kept Zi Lu to pass the night in his house, killed a fowl, prepared millet, and feasted him. He also introduced to him his two sons."
        },
        {
          "ref": "18:39",
          "zh": "明日，子路行以告。",
          "en": "Next day, Zi Lu went on his way, and reported his adventure."
        },
        {
          "ref": "18:40",
          "zh": "子曰：「隱者也。」",
          "en": "The Master said, \"He is a recluse,\""
        },
        {
          "ref": "18:41",
          "zh": "使子路反見之。",
          "en": "and sent Zi Lu back to see him again,"
        },
        {
          "ref": "18:42",
          "zh": "至則行矣。",
          "en": "but when he got to the place, the old man was gone."
        },
        {
          "ref": "18:43",
          "zh": "子路曰：「不仕無義。",
          "en": "Zi Lu then said to the family, \"Not to take office is not righteous."
        },
        {
          "ref": "18:44",
          "zh": "長幼之節，不可廢也；君臣之義，如之何其廢之？",
          "en": "If the relations between old and young may not be neglected, how is it that he sets aside the duties that should be observed between sovereign and minister?"
        },
        {
          "ref": "18:45",
          "zh": "欲潔其身，而亂大倫。",
          "en": "Wishing to maintain his personal purity, he allows that great relation to come to confusion."
        },
        {
          "ref": "18:46",
          "zh": "君子之仕也，行其義也。",
          "en": "A superior man takes office, and performs the righteous duties belonging to it."
        },
        {
          "ref": "18:47",
          "zh": "道之不行，已知之矣。」",
          "en": "As to the failure of right principles to make progress, he is aware of that.\""
        },
        {
          "ref": "18:48",
          "zh": "逸民：伯夷、叔齊、虞仲、夷逸、朱張、柳下惠、少連。",
          "en": "The men who have retired to privacy from the world have been Bo Yi, Shu Qi, Yu Zhong, Yi Yi, Zhu Zhang, Hui of Liu Xia, and Shao Lian."
        },
        {
          "ref": "18:49",
          "zh": "子曰：「不降其志，不辱其身，伯夷、叔齊與！」",
          "en": "The Master said, \"Refusing to surrender their wills, or to submit to any taint in their persons - such, I think, were Bo Yi and Shu Qi.\""
        },
        {
          "ref": "18:50",
          "zh": "謂：「柳下惠、少連，降志辱身矣。",
          "en": "\"It may be said of Hui of Liu Xia, and of Shao Lian, that they surrendered their wills, and submitted to taint in their persons,"
        },
        {
          "ref": "18:51",
          "zh": "言中倫，行中慮，其斯而已矣。」",
          "en": "but their words corresponded with reason, and their actions were such as men are anxious to see. This is all that is to be remarked in them.\""
        },
        {
          "ref": "18:52",
          "zh": "謂：「虞仲、夷逸，隱居放言。",
          "en": "\"It may be said of Yu Zhong and Yi Yi, that, while they hid themselves in their seclusion, they gave a license to their words;"
        },
        {
          "ref": "18:53",
          "zh": "身中清，廢中權。」",
          "en": "but in their persons, they succeeded in preserving their purity, and, in their retirement, they acted according to the exigency of the times.\""
        },
        {
          "ref": "18:54",
          "zh": "「我則異於是，無可無不可。」",
          "en": "\"I am different from all these. I have no course for which I am predetermined, and no course against which I am predetermined.\""
        },
        {
          "ref": "18:55",
          "zh": "大師摯適齊，亞飯干適楚，三飯繚適蔡，四飯缺適秦。",
          "en": "The grand music master, Zhi, went to Qi. Gan, the master of the band at the second meal, went to Chu. Liao, the band master at the third meal, went to Cai. Que, the band master at the fourth meal, went to Qin."
        },
        {
          "ref": "18:56",
          "zh": "鼓方叔入於河，播鼗武入於漢，少師陽、擊磬襄，入於海。",
          "en": "Fang Shu, the drum master, withdrew to the north of the river. Wu, the master of the hand drum, withdrew to the Han. Yang, the assistant music master, and Xiang, master of the musical stone, withdrew to an island in the sea."
        },
        {
          "ref": "18:57",
          "zh": "周公謂魯公曰：「君子不施其親，不使大臣怨乎不以。",
          "en": "The duke of Zhou addressed his son, the duke of Lu, saying, \"The virtuous prince does not neglect his relations. He does not cause the great ministers to repine at his not employing them."
        },
        {
          "ref": "18:58",
          "zh": "故舊無大故，則不棄也。",
          "en": "Without some great cause, he does not dismiss from their offices the members of old families."
        },
        {
          "ref": "18:59",
          "zh": "無求備於一人。」",
          "en": "He does not seek in one man talents for every employment.\""
        },
        {
          "ref": "18:60",
          "zh": "周有八士：伯達、伯適、仲突、仲忽、叔夜、叔夏、季隨、季騧。",
          "en": "To Zhou belonged the eight officers, Bo Da, Bo Kuo, Zhong Tu, Zhong Hu, Shu Ye, Shu Xia, Ji Sui, and Ji Gua."
        }
      ]
    },
    {
      "number": "19",
      "title": "Zi Zhang",
      "slug": "zi-zhang",
      "passages": [
        {
          "ref": "19:1",
          "zh": "子張曰：「士見危致命，見得思義，祭思敬，喪思哀，其可已矣。」",
          "en": "Zi Zhang said, \"The scholar, trained for public duty, seeing threatening danger, is prepared to sacrifice his life. When the opportunity of gain is presented to him, he thinks of righteousness. In sacrificing, his thoughts are reverential. In mourning, his thoughts are about the grief which he should feel. Such a man commands our approbation indeed.\""
        },
        {
          "ref": "19:2",
          "zh": "子張曰：「執德不弘，信道不篤，焉能為有？焉能為亡？」",
          "en": "Zi Zhang said, \"When a man holds fast to virtue, but without seeking to enlarge it, and believes in right principles, but without firm sincerity, what account can be made of his existence or non-existence?\""
        },
        {
          "ref": "19:3",
          "zh": "子夏之門人問交於子張。",
          "en": "The disciples of Zi Xia asked Zi Zhang about the principles that should characterize mutual intercourse."
        },
        {
          "ref": "19:4",
          "zh": "子張曰：「子夏云何？」",
          "en": "Zi Zhang asked, \"What does Zi Xia say on the subject?\""
        },
        {
          "ref": "19:5",
          "zh": "對曰：「子夏曰：『可者與之，其不可者拒之。』」",
          "en": "They replied, \"Zi Xia says: 'Associate with those who can advantage you. Put away from you those who cannot do so.'\""
        },
        {
          "ref": "19:6",
          "zh": "子張曰：「異乎吾所聞：君子尊賢而容眾，嘉善而矜不能。",
          "en": "Zi Zhang observed, \"This is different from what I have learned. The superior man honors the talented and virtuous, and bears with all. He praises the good, and pities the incompetent."
        },
        {
          "ref": "19:7",
          "zh": "我之大賢與，於人何所不容？",
          "en": "Am I possessed of great talents and virtue? - who is there among men whom I will not bear with?"
        },
        {
          "ref": "19:8",
          "zh": "我之不賢與，人將拒我，如之何其拒人也？」",
          "en": "Am I devoid of talents and virtue? - men will put me away from them. What have we to do with the putting away of others?\""
        },
        {
          "ref": "19:9",
          "zh": "子夏曰：「雖小道，必有可觀者焉；致遠恐泥，是以君子不為也。」",
          "en": "Zi Xia said, \"Even in inferior studies and employments there is something worth being looked at; but if it be attempted to carry them out to what is remote, there is a danger of their proving inapplicable. Therefore, the superior man does not practice them.\""
        },
        {
          "ref": "19:10",
          "zh": "子夏曰：「日知其所亡，月無忘其所能，可謂好學也已矣。」",
          "en": "Zi Xia said, \"He, who from day to day recognizes what he has not yet, and from month to month does not forget what he has attained to, may be said indeed to love to learn.\""
        },
        {
          "ref": "19:11",
          "zh": "子夏曰：「博學而篤志，切問而近思，仁在其中矣。」",
          "en": "Zi Xia said, \"There are learning extensively, and having a firm and sincere aim; inquiring with earnestness, and reflecting with self-application - virtue is in such a course.\""
        },
        {
          "ref": "19:12",
          "zh": "子夏曰：「百工居肆以成其事，君子學以致其道。」",
          "en": "Zi Xia said, \"Mechanics have their shops to dwell in, in order to accomplish their works. The superior man learns, in order to reach to the utmost of his principles.\""
        },
        {
          "ref": "19:13",
          "zh": "子夏曰：「小人之過也必文。」",
          "en": "Zi Xia said, \"The mean man is sure to gloss his faults.\""
        },
        {
          "ref": "19:14",
          "zh": "子夏曰：「君子有三變：望之儼然，即之也溫，聽其言也厲。」",
          "en": "Zi Xia said, \"The superior man undergoes three changes. Looked at from a distance, he appears stern; when approached, he is mild; when he is heard to speak, his language is firm and decided.\""
        },
        {
          "ref": "19:15",
          "zh": "子夏曰：「君子信而後勞其民，未信則以為厲己也；信而後諫，未信則以為謗己也。」",
          "en": "Zi Xia said, \"The superior man, having obtained their confidence, may then impose labors on his people. If he have not gained their confidence, they will think that he is oppressing them. Having obtained the confidence of his prince, one may then remonstrate with him. If he have not gained his confidence, the prince will think that he is vilifying him.\""
        },
        {
          "ref": "19:16",
          "zh": "子夏曰：「大德不踰閑，小德出入可也。」",
          "en": "Zi Xia said, \"When a person does not transgress the boundary line in the great virtues, he may pass and repass it in the small virtues.\""
        },
        {
          "ref": "19:17",
          "zh": "子游曰：「子夏之門人小子，當洒掃、應對、進退，則可矣。",
          "en": "Zi You said, \"The disciples and followers of Zi Xia, in sprinkling and sweeping the ground, in answering and replying, in advancing and receding, are sufficiently accomplished."
        },
        {
          "ref": "19:18",
          "zh": "抑末也，本之則無。如之何？」",
          "en": "But these are only the branches of learning, and they are left ignorant of what is essential. How can they be acknowledged as sufficiently taught?\""
        },
        {
          "ref": "19:19",
          "zh": "子夏聞之曰：「噫！言游過矣！",
          "en": "Zi Xia heard of the remark and said, \"Alas! Yan You is wrong."
        },
        {
          "ref": "19:20",
          "zh": "君子之道，孰先傳焉？孰後倦焉？",
          "en": "According to the way of the superior man in teaching, what departments are there which he considers of prime importance, and delivers? what are there which he considers of secondary importance, and allows himself to be idle about?"
        },
        {
          "ref": "19:21",
          "zh": "譬諸草木，區以別矣。",
          "en": "But as in the case of plants, which are assorted according to their classes, so he deals with his disciples."
        },
        {
          "ref": "19:22",
          "zh": "君子之道，焉可誣也？",
          "en": "How can the way of a superior man be such as to make fools of any of them?"
        },
        {
          "ref": "19:23",
          "zh": "有始有卒者，其惟聖人乎！」",
          "en": "Is it not the sage alone, who can unite in one the beginning and the consummation of learning?\""
        },
        {
          "ref": "19:24",
          "zh": "子夏曰：「仕而優則學，學而優則仕。」",
          "en": "Zi Xia said, \"The officer, having discharged all his duties, should devote his leisure to learning. The student, having completed his learning, should apply himself to be an officer.\""
        },
        {
          "ref": "19:25",
          "zh": "子游曰：「喪致乎哀而止。」",
          "en": "Zi You said, \"Mourning, having been carried to the utmost degree of grief, should stop with that.\""
        },
        {
          "ref": "19:26",
          "zh": "子游曰：「吾友張也，為難能也。然而未仁。」",
          "en": "Zi You said, \"My friend Zhang can do things which are hard to be done, but yet he is not perfectly virtuous.\""
        },
        {
          "ref": "19:27",
          "zh": "曾子曰：「堂堂乎張也，難與並為仁矣。」",
          "en": "The philosopher Zeng said, \"How imposing is the manner of Zhang! It is difficult along with him to practice virtue.\""
        },
        {
          "ref": "19:28",
          "zh": "曾子曰：「吾聞諸夫子：人未有自致者也，必也親喪乎！」",
          "en": "The philosopher Zeng said, \"I heard this from our Master: 'Men may not have shown what is in them to the full extent, and yet they will be found to do so, on the occasion of mourning for their parents.'\""
        },
        {
          "ref": "19:29",
          "zh": "曾子曰：「吾聞諸夫子：孟莊子之孝也，其他可能也；其不改父之臣，與父之政，是難能也。」",
          "en": "The philosopher Zeng said, \"I have heard this from our Master: 'The filial piety of Meng Zhuang, in other matters, was what other men are competent to, but, as seen in his not changing the ministers of his father, nor his father's mode of government, it is difficult to be attained to.'\""
        },
        {
          "ref": "19:30",
          "zh": "孟氏使陽膚為士師，問於曾子。",
          "en": "The chief of the Meng family having appointed Yang Fu to be chief criminal judge, the latter consulted the philosopher Zeng."
        },
        {
          "ref": "19:31",
          "zh": "曾子曰：「上失其道，民散久矣。",
          "en": "Zeng said, \"The rulers have failed in their duties, and the people consequently have been disorganized, for a long time."
        },
        {
          "ref": "19:32",
          "zh": "如得其情，則哀矜而勿喜。」",
          "en": "When you have found out the truth of any accusation, be grieved for and pity them, and do not feel joy at your own ability.\""
        },
        {
          "ref": "19:33",
          "zh": "子貢曰：「紂之不善，不如是之甚也。",
          "en": "Zi Gong said, \"Zhou's wickedness was not so great as that name implies."
        },
        {
          "ref": "19:34",
          "zh": "是以君子惡居下流，天下之惡皆歸焉。」",
          "en": "Therefore, the superior man hates to dwell in a low-lying situation, where all the evil of the world will flow in upon him.\""
        },
        {
          "ref": "19:35",
          "zh": "子貢曰：「君子之過也，如日月之食焉：過也，人皆見之；更也，人皆仰之。」",
          "en": "Zi Gong said, \"The faults of the superior man are like the eclipses of the sun and moon. He has his faults, and all men see them; he changes again, and all men look up to him.\""
        },
        {
          "ref": "19:36",
          "zh": "衛公孫朝問於子貢曰：「仲尼焉學？」",
          "en": "Gong Sun Zhao of Wei asked Zi Gong, saying. \"From whom did Zhong Ni get his learning?\""
        },
        {
          "ref": "19:37",
          "zh": "子貢曰：「文武之道，未墜於地，在人。",
          "en": "Zi Gong replied, \"The doctrines of Wen and Wu have not yet fallen to the ground. They are to be found among men."
        },
        {
          "ref": "19:38",
          "zh": "賢者識其大者，不賢者識其小者，莫不有文武之道焉。",
          "en": "Men of talents and virtue remember the greater principles of them, and others, not possessing such talents and virtue, remember the smaller. Thus, all possess the doctrines of Wen and Wu."
        },
        {
          "ref": "19:39",
          "zh": "夫子焉不學？而亦何常師之有？」",
          "en": "Where could our Master go that he should not have an opportunity of learning them? And yet what necessity was there for his having a regular master?\""
        },
        {
          "ref": "19:40",
          "zh": "叔孫武叔語大夫於朝，曰：「子貢賢於仲尼。」",
          "en": "Shu Sun Wu Shu observed to the great officers in the court, saying, \"Zi Gong is superior to Zhong Ni.\""
        },
        {
          "ref": "19:41",
          "zh": "子服景伯以告子貢。",
          "en": "Zi Fu Jing Bo reported the observation to Zi Gong,"
        },
        {
          "ref": "19:42",
          "zh": "子貢曰：「譬之宮牆，賜之牆也及肩，窺見室家之好。",
          "en": "who said, \"Let me use the comparison of a house and its encompassing wall. My wall only reaches to the shoulders. One may peep over it, and see whatever is valuable in the apartments."
        },
        {
          "ref": "19:43",
          "zh": "夫子之牆數仞，不得其門而入，不見宗廟之美，百官之富。",
          "en": "The wall of my Master is several fathoms high. If one do not find the door and enter by it, he cannot see the ancestral temple with its beauties, nor all the officers in their rich array."
        },
        {
          "ref": "19:44",
          "zh": "得其門者或寡矣。",
          "en": "But I may assume that they are few who find the door."
        },
        {
          "ref": "19:45",
          "zh": "夫子之云，不亦宜乎！」",
          "en": "Was not the observation of the chief only what might have been expected?\""
        },
        {
          "ref": "19:46",
          "zh": "叔孫武叔毀仲尼。",
          "en": "Shu Sun Wu Shu having spoken revilingly of Zhong Ni,"
        },
        {
          "ref": "19:47",
          "zh": "子貢曰：「無以為也，仲尼不可毀也。",
          "en": "Zi Gong said, \"It is of no use doing so. Zhong Ni cannot be reviled."
        },
        {
          "ref": "19:48",
          "zh": "他人之賢者，丘陵也，猶可踰也；仲尼，日月也，無得而踰焉。",
          "en": "The talents and virtue of other men are hillocks and mounds which may be stepped over. Zhong Ni is the sun or moon, which it is not possible to step over."
        },
        {
          "ref": "19:49",
          "zh": "人雖欲自絕，其何傷於日月乎？多見其不知量也！」",
          "en": "Although a man may wish to cut himself off from the sage, what harm can he do to the sun or moon? He only shows that he does not know his own capacity.\""
        },
        {
          "ref": "19:50",
          "zh": "陳子禽謂子貢曰：「子為恭也，仲尼豈賢於子乎？」",
          "en": "Chen Zi Qin, addressing Zi Gong, said, \"You are too modest. How can Zhong Ni be said to be superior to you?\""
        },
        {
          "ref": "19:51",
          "zh": "子貢曰：「君子一言以為知，一言以為不知，言不可不慎也。",
          "en": "Zi Gong said to him, \"For one word a man is often deemed to be wise, and for one word he is often deemed to be foolish. We ought to be careful indeed in what we say."
        },
        {
          "ref": "19:52",
          "zh": "夫子之不可及也，猶天之不可階而升也。",
          "en": "Our Master cannot be attained to, just in the same way as the heavens cannot be gone up by the steps of a stair."
        },
        {
          "ref": "19:53",
          "zh": "夫子之得邦家者，所謂立之斯立，道之斯行，綏之斯來，動之斯和。",
          "en": "Were our Master in the position of the ruler of a state or the chief of a family, we should find verified the description which has been given of a sage's rule: he would plant the people, and forthwith they would be established; he would lead them on, and forthwith they would follow him; he would make them happy, and forthwith multitudes would resort to his dominions; he would stimulate them, and forthwith they would be harmonious."
        },
        {
          "ref": "19:54",
          "zh": "其生也榮，其死也哀，如之何其可及也。」",
          "en": "While he lived, he would be glorious. When he died, he would be bitterly lamented. How is it possible for him to be attained to?\""
        }
      ]
    },
    {
      "number": "20",
      "title": "Yao Yue",
      "slug": "yao-yue",
      "passages": [
        {
          "ref": "20:1",
          "zh": "堯曰：「咨！爾舜！天之曆數在爾躬。",
          "en": "Yao said, \"Oh! you, Shun, the Heaven-determined order of succession now rests in your person."
        },
        {
          "ref": "20:2",
          "zh": "允執其中。",
          "en": "Sincerely hold fast the due Mean."
        },
        {
          "ref": "20:3",
          "zh": "四海困窮，天祿永終。」",
          "en": "If there shall be distress and want within the four seas, the Heavenly revenue will come to a perpetual end.\""
        },
        {
          "ref": "20:4",
          "zh": "舜亦以命禹。",
          "en": "Shun also used the same language in giving charge to You."
        },
        {
          "ref": "20:5",
          "zh": "曰：「予小子履，敢用玄牡，敢昭告于皇皇后帝：有罪不敢赦。",
          "en": "Tang said, \"I, the child Lu, presume to use a dark-colored victim, and presume to announce to Thee, O most great and sovereign God, that the sinner I dare not pardon,"
        },
        {
          "ref": "20:6",
          "zh": "帝臣不蔽，簡在帝心。",
          "en": "and thy ministers, O God, I do not keep in obscurity. The examination of them is by thy mind, O God."
        },
        {
          "ref": "20:7",
          "zh": "朕躬有罪，無以萬方；萬方有罪，罪在朕躬。」",
          "en": "If, in my person, I commit offenses, they are not to be attributed to you, the people of the myriad regions. If you in the myriad regions commit offenses, these offenses must rest on my person.\""
        },
        {
          "ref": "20:8",
          "zh": "周有大賚，善人是富。",
          "en": "Zhou conferred great gifts, and the good were enriched."
        },
        {
          "ref": "20:9",
          "zh": "「雖有周親，不如仁人。",
          "en": "\"Although he has his near relatives, they are not equal to my virtuous men."
        },
        {
          "ref": "20:10",
          "zh": "百姓有過，在予一人。」",
          "en": "The people are throwing blame upon me, the One man.\""
        },
        {
          "ref": "20:11",
          "zh": "謹權量，審法度，修廢官，四方之政行焉。",
          "en": "He carefully attended to the weights and measures, examined the body of the laws, restored the discarded officers, and the good government of the kingdom took its course."
        },
        {
          "ref": "20:12",
          "zh": "興滅國，繼絕世，舉逸民，天下之民歸心焉。",
          "en": "He revived states that had been extinguished, restored families whose line of succession had been broken, and called to office those who had retired into obscurity, so that throughout the kingdom the hearts of the people turned towards him."
        },
        {
          "ref": "20:13",
          "zh": "所重：民、食、喪、祭。",
          "en": "What he attached chief importance to were the food of the people, the duties of mourning, and sacrifices."
        },
        {
          "ref": "20:14",
          "zh": "寬則得眾，信則民任焉，敏則有功，公則說。",
          "en": "By his generosity, he won all. By his sincerity, he made the people repose trust in him. By his earnest activity, his achievements were great. By his justice, all were delighted."
        },
        {
          "ref": "20:15",
          "zh": "子張問於孔子曰：「何如斯可以從政矣？」",
          "en": "Zi Zhang asked Confucius, saying, \"In what way should a person in authority act in order that he may conduct government properly?\""
        },
        {
          "ref": "20:16",
          "zh": "子曰：「尊五美，屏四惡，斯可以從政矣。」",
          "en": "The Master replied, \"Let him honor the five excellent, and banish away the four bad, things; then may he conduct government properly.\""
        },
        {
          "ref": "20:17",
          "zh": "子張曰：「何謂五美？」",
          "en": "Zi Zhang said, \"What are meant by the five excellent things?\""
        },
        {
          "ref": "20:18",
          "zh": "子曰：「君子惠而不費，勞而不怨，欲而不貪，泰而不驕，威而不猛。」",
          "en": "The Master said, \"When the person in authority is beneficent without great expenditure; when he lays tasks on the people without their repining; when he pursues what he desires without being covetous; when he maintains a dignified ease without being proud; when he is majestic without being fierce.\""
        },
        {
          "ref": "20:19",
          "zh": "子張曰：「何謂惠而不費？」",
          "en": "Zi Zhang said, \"What is meant by being beneficent without great expenditure?\""
        },
        {
          "ref": "20:20",
          "zh": "子曰：「因民之所利而利之，斯不亦惠而不費乎？",
          "en": "The Master replied, \"When the person in authority makes more beneficial to the people the things from which they naturally derive benefit - is not this being beneficent without great expenditure?"
        },
        {
          "ref": "20:21",
          "zh": "擇可勞而勞之，又誰怨？",
          "en": "When he chooses the labors which are proper, and makes them labor on them, who will repine?"
        },
        {
          "ref": "20:22",
          "zh": "欲仁而得仁，又焉貪？",
          "en": "When his desires are set on benevolent government, and he secures it, who will accuse him of covetousness?"
        },
        {
          "ref": "20:23",
          "zh": "君子無眾寡，無小大，無敢慢，斯不亦泰而不驕乎？",
          "en": "Whether he has to do with many people or few, or with things great or small, he does not dare to indicate any disrespect - is not this to maintain a dignified ease without any pride?"
        },
        {
          "ref": "20:24",
          "zh": "君子正其衣冠，尊其瞻視，儼然人望而畏之，斯不亦威而不猛乎？」",
          "en": "He adjusts his clothes and cap, and throws a dignity into his looks, so that, thus dignified, he is looked at with awe - is not this to be majestic without being fierce?\""
        },
        {
          "ref": "20:25",
          "zh": "子張曰：「何謂四惡？」",
          "en": "Zi Zhang then asked, \"What are meant by the four bad things?\""
        },
        {
          "ref": "20:26",
          "zh": "子曰：「不教而殺謂之虐；不戒視成謂之暴；慢令致期謂之賊；猶之與人也，出納之吝，謂之有司。」",
          "en": "The Master said, \"To put the people to death without having instructed them - this is called cruelty. To require from them, suddenly, the full tale of work, without having given them warning - this is called oppression. To issue orders as if without urgency, at first, and, when the time comes, to insist on them with severity - this is called injury. And, generally, in the giving pay or rewards to men, to do it in a stingy way - this is called acting the part of a mere official.\""
        },
        {
          "ref": "20:27",
          "zh": "子曰：「不知命，無以為君子也。",
          "en": "The Master said, \"Without recognizing the ordinances of Heaven, it is impossible to be a superior man."
        },
        {
          "ref": "20:28",
          "zh": "不知禮，無以立也。",
          "en": "Without an acquaintance with the rules of Propriety, it is impossible for the character to be established."
        },
        {
          "ref": "20:29",
          "zh": "不知言，無以知人也。」",
          "en": "Without knowing the force of words, it is impossible to know men.\""
        }
      ]
    }
  ]
}