{
  "id": "shangshu",
  "title": "尚書",
  "titleEn": "Book of Documents",
  "source": "Chinese Text Project (ctext.org) - James Legge translation",
  "chapters": [
    {
      "number": "14",
      "title": "Tai Jia I",
      "slug": "tai-jia-i",
      "passages": [
        {
          "ref": "14:1",
          "zh": "惟嗣王不惠于阿衡，伊尹作書曰：",
          "en": "The king, on succeeding to the throne, did not follow (the advice of) A-heng. (A-heng or) Yi Yin then made the following writing:"
        },
        {
          "ref": "14:2",
          "zh": "「先王顧諟天之明命，以承上下神祇。",
          "en": "'The former king kept his eye continually on the bright requirements of Heaven, and so he maintained the worship of the spirits of heaven and earth, of those presiding over the land and the grain, and of those of the ancestral temple - all with a sincere reverence."
        },
        {
          "ref": "14:3",
          "zh": "社稷宗廟，罔不祗肅。",
          "en": "Heaven took notice of his virtue, and caused its great appointment to light on him, that he should soothe and tranquillize the myriad regions."
        },
        {
          "ref": "14:4",
          "zh": "天監厥德，用集大命，撫綏萬方。",
          "en": "I, Yin, then gave my assistance to my sovereign in the settlement of the people; and thus it is that you, O heir-king, have received the great inheritance."
        },
        {
          "ref": "14:5",
          "zh": "惟尹躬克左右厥辟，宅師，肆嗣王丕承基緒。",
          "en": "I have seen it myself in Xia with its western capital, that when its rulers went through a prosperous course to the end, their ministers also did the same."
        },
        {
          "ref": "14:6",
          "zh": "惟尹躬先見于西邑夏，自周有終。",
          "en": "And afterwards, when their successors could not attain to such a consummation, neither did their ministers."
        },
        {
          "ref": "14:7",
          "zh": "相亦惟終；其後嗣王罔克有終，相亦罔終，嗣王戒哉！",
          "en": "Take warning, O heir-king."
        },
        {
          "ref": "14:8",
          "zh": "祗爾厥辟，辟不辟，忝厥祖。」",
          "en": "Reverently use your sovereignty. If you do not play the sovereign, as the name requires, you will disgrace your grandfather.'"
        },
        {
          "ref": "14:9",
          "zh": "王惟庸罔念聞。",
          "en": "The king would not think (of these words), nor listen to them."
        },
        {
          "ref": "14:10",
          "zh": "伊尹乃言曰：「先王昧爽丕顯，坐以待旦。",
          "en": "On this Yi Yin said, 'The former king, before it was light, sought to have large and clear views, and then sat waiting for the dawn (to carry them into practice)."
        },
        {
          "ref": "14:11",
          "zh": "旁求俊彥，啟迪後人，無越厥命以自覆。",
          "en": "He (also) sought on every side for men of ability and virtue, to instruct and guide his posterity. Do not frustrate his charge (to me), and bring on yourself your own overthrow."
        },
        {
          "ref": "14:12",
          "zh": "慎乃儉德，惟懷永圖。",
          "en": "Be careful to strive after the virtue of self-restraint, and cherish far-reaching plans."
        },
        {
          "ref": "14:13",
          "zh": "若虞機張，往省括于度則釋。",
          "en": "Be like the forester, who, when he has adjusted the spring, goes to examine the end of the arrow, whether it be placed according to rule, and then lets it go."
        },
        {
          "ref": "14:14",
          "zh": "欽厥止，率乃祖攸行，惟朕以懌，萬世有辭。」",
          "en": "Reverently determine your aim, and follow the ways of your grandfather. Thus I shall be delighted, and be able to show to all ages that I have discharged my trust.'"
        },
        {
          "ref": "14:15",
          "zh": "王未克變。",
          "en": "The king was not yet able to change (his course)."
        },
        {
          "ref": "14:16",
          "zh": "伊尹曰：「茲乃不義，習與性成。",
          "en": "Yin said (to himself), 'This is (real) unrighteousness, and is becoming by practice (a second) nature."
        },
        {
          "ref": "14:17",
          "zh": "予弗狎于弗順，營于桐宮，密邇先王其訓，無俾世迷。",
          "en": "I cannot bear to be near (so) disobedient (a person). I will build (a place) in the palace at Tong, where he can be in silence near (the grave of) the former king. This will be a lesson which will keep him from going astray all his life.'"
        },
        {
          "ref": "14:18",
          "zh": "王徂桐宮居憂，克終允德。」",
          "en": "The king went (accordingly) to the palace at Tong, and dwelt during the period of mourning. In the end he became sincerely virtuous."
        }
      ]
    },
    {
      "number": "15",
      "title": "Tai Jia Ii",
      "slug": "tai-jia-ii",
      "passages": [
        {
          "ref": "15:1",
          "zh": "惟三祀十有二月朔，伊尹以冕服奉嗣王歸于亳，作書曰：",
          "en": "On the first day of the twelfth month of his third year, Yi Yin escorted the young king in the royal cap and robes back to Bo. (At the same time) he made the following writing:"
        },
        {
          "ref": "15:2",
          "zh": "「民非后，罔克胥匡以生；后非民，罔以辟四方。",
          "en": "'Without the sovereign, the people cannot have that guidance which is necessary to (the comfort of) their lives; without the people, the sovereign would have no sway over the four quarters (of the kingdom)."
        },
        {
          "ref": "15:3",
          "zh": "皇天眷佑有商，俾嗣王克終厥德，實萬世無疆之休。」",
          "en": "Great Heaven has graciously favoured the House of Shang, and granted to you, O young king, at last to become virtuous. This is indeed a blessing that will extend without limit to ten thousand generations.'"
        },
        {
          "ref": "15:4",
          "zh": "王拜手稽首曰：「予小子不明于德，自厎不類。",
          "en": "The king did obeisance with his face to his hands and his head to the ground, saying, 'I, the little child, was without understanding of what was virtuous, and was making myself one of the unworthy."
        },
        {
          "ref": "15:5",
          "zh": "欲敗度，縱敗禮，以速戾于厥躬。",
          "en": "By my desires I was setting at nought all rules of conduct, and violating by my self-indulgence all rules of propriety, and the result must have been speedy ruin to my person."
        },
        {
          "ref": "15:6",
          "zh": "天作孽，猶可違；自作孽，不可逭。",
          "en": "Calamities sent by Heaven may be avoided, but from calamities brought on by one's self there is no escape."
        },
        {
          "ref": "15:7",
          "zh": "既往背師保之訓，弗克于厥初，尚賴匡救之德，圖惟厥終。」",
          "en": "Heretofore I turned my back on the instructions of you, my tutor and guardian; my beginning has been marked by incompetency. Let me still rely on your correcting and preserving virtue, keeping this in view that my end may be good!'"
        },
        {
          "ref": "15:8",
          "zh": "伊尹拜手稽首曰：「修厥身，允德協于下，惟明后。",
          "en": "Yi Yin did obeisance with his face to his hands and his head on the ground, and said, 'To cultivate his person, and by being sincerely virtuous, bring (all) below to harmonious concord with him; this is the work of the intelligent sovereign."
        },
        {
          "ref": "15:9",
          "zh": "先王子惠困窮，民服厥命，罔有不悅。",
          "en": "The former king was kind to the distressed and suffering, as if they were his children, and the people submitted to his commands - all with sincere delight."
        },
        {
          "ref": "15:10",
          "zh": "並其有邦厥鄰，乃曰：『徯我后，后來無罰。』",
          "en": "Even in the states of the neighbouring princes, (the people) said, \"We are waiting for our sovereign; when our sovereign comes, we shall not suffer the punishments (that we now do).\""
        },
        {
          "ref": "15:11",
          "zh": "王懋乃德，視乃厥祖，無時豫怠。",
          "en": "O king, zealously cultivate your virtue. Regard (the example of) your meritorious grandfather. At no time allow yourself in pleasure and idleness."
        },
        {
          "ref": "15:12",
          "zh": "奉先思孝，接下思恭。",
          "en": "In worshipping your ancestors, think how you can prove your filial piety; in receiving your ministers, think how you can show yourself respectful."
        },
        {
          "ref": "15:13",
          "zh": "視遠惟明；聽德惟聰。",
          "en": "In looking to what is distant, try to get clear views; have your ears ever open to lessons of virtue."
        },
        {
          "ref": "15:14",
          "zh": "朕承王之休無斁。」",
          "en": "Then shall I acknowledge (and respond to) the excellence of your majesty with an untiring (devotion to your service).'"
        }
      ]
    },
    {
      "number": "16",
      "title": "Tai Jia Iii",
      "slug": "tai-jia-iii",
      "passages": [
        {
          "ref": "16:1",
          "zh": "伊尹申誥于王曰：「嗚呼！惟天無親，克敬惟親。",
          "en": "Yi Yin again made an announcement to the king, saying, 'Oh! Heaven has no (partial) affection - only to those who are reverent does it show affection."
        },
        {
          "ref": "16:2",
          "zh": "民罔常懷，懷于有仁。",
          "en": "The people are not constant to those whom they cherish; they cherish (only) him who is benevolent."
        },
        {
          "ref": "16:3",
          "zh": "鬼神無常享，享于克誠。",
          "en": "The spirits do not always accept the sacrifices that are offered to them; they accept only the sacrifices of the sincere."
        },
        {
          "ref": "16:4",
          "zh": "天位艱哉！德惟治，否德亂。",
          "en": "A place of difficulty is the Heaven-(conferred) seat. When there are (those) virtues, good government is realized; when they are not, disorder comes."
        },
        {
          "ref": "16:5",
          "zh": "與治同道，罔不興；與亂同事，罔不亡。",
          "en": "To maintain the same principles as those who secured good government will surely lead to prosperity; to pursue the courses of disorder will surely lead to ruin."
        },
        {
          "ref": "16:6",
          "zh": "終始慎厥與，惟明明后。",
          "en": "He who at last, as at first, is careful as to whom and what he follows is a truly intelligent sovereign."
        },
        {
          "ref": "16:7",
          "zh": "先王惟時懋敬厥德，克配上帝。",
          "en": "The former king was always zealous in the reverent cultivation of his virtue, so that he was the fellow of God."
        },
        {
          "ref": "16:8",
          "zh": "今王嗣有令緒，尚監茲哉。",
          "en": "Now, O king, you have entered on the inheritance of his excellent line; fix your inspection on him."
        },
        {
          "ref": "16:9",
          "zh": "若升高，必自下，若陟遐，必自邇。",
          "en": "(Your course must be) as when in ascending high you begin from where it is low, and when in travelling far you begin from where it is near."
        },
        {
          "ref": "16:10",
          "zh": "無輕民事，惟難；無安厥位，惟危。",
          "en": "Do not slight the occupations of the people - think of their difficulties. Do not yield to a feeling of repose on your throne - think of its perils."
        },
        {
          "ref": "16:11",
          "zh": "慎終于始。",
          "en": "Be careful for the end at the beginning."
        },
        {
          "ref": "16:12",
          "zh": "有言逆于汝心，必求諸道；有言遜于汝志，必求諸非道。",
          "en": "When you hear words that are distasteful to your mind, you must enquire whether they be not right; when you hear words that accord with your own views, you must enquire whether they be not contrary to what is right."
        },
        {
          "ref": "16:13",
          "zh": "嗚呼！弗慮胡獲？弗為胡成？",
          "en": "Oh! what attainment can be made without anxious thought? what achievement can be made without earnest effort?"
        },
        {
          "ref": "16:14",
          "zh": "一人元良，萬邦以貞。",
          "en": "Let the One man be greatly good, and the myriad regions will be rectified by him."
        },
        {
          "ref": "16:15",
          "zh": "君罔以辯言亂舊政，臣罔以寵利居成功，邦其永孚于休。」",
          "en": "When the sovereign does not with disputatious words throw the old rules of government into confusion, and the minister does not, for favour and gain, continue in an office whose work is done, then the country will lastingly and surely enjoy happiness.'"
        }
      ]
    },
    {
      "number": "18",
      "title": "Pan Geng I",
      "slug": "pan-geng-i",
      "passages": [
        {
          "ref": "18:1",
          "zh": "盤庚遷于殷，民不適有居，率籲眾慼出，矢言曰：",
          "en": "Pan-geng wished to remove (the capital) to Yin, but the people would not go to dwell there. He therefore appealed to all the discontented, and made the following protestations:"
        },
        {
          "ref": "18:2",
          "zh": "「我王來，既爰宅于茲，重我民，無盡劉。",
          "en": "'Our king came, and fixed on this. He did so from a deep concern for our people, and not because he would have them all die, where they cannot (now) help one another to preserve their lives."
        },
        {
          "ref": "18:3",
          "zh": "不能胥匡以生，卜稽，曰其如台？",
          "en": "I have consulted the tortoise-shell, and obtained the reply: \"This is no place for us.\""
        },
        {
          "ref": "18:4",
          "zh": "先王有服，恪謹天命，茲猶不常寧；不常厥邑，于今五邦。",
          "en": "When the former kings had any (important) business, they gave reverent heed to the commands of Heaven. In a case like this especially they did not indulge (the wish for) constant repose - they did not abide ever in the same city. Up to this time (the capital has been) in five regions."
        },
        {
          "ref": "18:5",
          "zh": "今不承于古，罔知天之斷命，矧曰其克從先王之烈？",
          "en": "If we do not follow (the example) of these old times, we shall be refusing to acknowledge that Heaven is making an end of our dynasty (here); how little can it be said of us that we are following the meritorious course of the former kings!"
        },
        {
          "ref": "18:6",
          "zh": "若顛木之有由蘗，天其永我命于茲新邑，紹復先王之大業，厎綏四方。」",
          "en": "As from the stump of a felled tree there are sprouts and shoots, Heaven will perpetuate its decree in our favour in this new city; the great inheritance of the former kings will be continued and renewed, and tranquillity will be secured to the four quarters (of the kingdom).'"
        },
        {
          "ref": "18:7",
          "zh": "盤庚斆于民，由乃在位以常舊服，正法度。",
          "en": "Pan-geng, in making the people aware of his views, began with those who were in (high) places, and took the constantly-recurring circumstances of former times to lay down the right law and measure (for the present emergency)."
        },
        {
          "ref": "18:8",
          "zh": "曰：「無或敢伏小人之攸箴！」",
          "en": "Saying, 'Let none of you dare to suppress the remonstrances of the poor people.'"
        },
        {
          "ref": "18:9",
          "zh": "王命眾，悉至于庭。",
          "en": "The king commanded all to come to him in the courtyard (of his palace)."
        },
        {
          "ref": "18:10",
          "zh": "王若曰：「格汝眾，予告汝訓：汝猷黜乃心，無傲從康。",
          "en": "The king spoke to this effect: 'Come, all of you; I will announce to you my instructions. Take counsel how to put away your (selfish) thoughts. Do not with haughty (disregard of me) follow after your own ease."
        },
        {
          "ref": "18:11",
          "zh": "古我先王，亦惟圖任舊人共政。",
          "en": "Of old, our former kings planned like me how to employ the men of old families to share in (the labours of) government."
        },
        {
          "ref": "18:12",
          "zh": "王播告之，修不匿厥指。王用丕欽；罔有逸言，民用丕變。",
          "en": "When they wished to proclaim and announce what was to be attended to, these did not conceal the royal views; and on this account the kings greatly respected them. They did not exceed the truth (in their communications with the people), and on this account the people became greatly changed (in their views)."
        },
        {
          "ref": "18:13",
          "zh": "今汝聒聒，起信險膚，予弗知乃所訟。",
          "en": "Now, (however), you keep clamouring, and get the confidence (of the people) by alarming and shallow speeches; I do not know what you are wrangling about."
        },
        {
          "ref": "18:14",
          "zh": "非予自荒茲德，惟汝含德，不惕予一人。",
          "en": "(In this movement) I am not myself abandoning my proper virtue, but you conceal the goodness of my intentions, and do not stand in awe of me, the One man."
        },
        {
          "ref": "18:15",
          "zh": "予若觀火，予亦拙謀作乃逸。」",
          "en": "I see you as clearly as one sees a fire; but I, likewise, by my undecided plans, have produced your error."
        },
        {
          "ref": "18:16",
          "zh": "若網在綱，有條而不紊；若農服田，力穡乃亦有秋。",
          "en": "When the net has its line, there is order and not confusion; and when the husbandman labours upon his fields, and reaps with all his might, there is the (abundant) harvest."
        },
        {
          "ref": "18:17",
          "zh": "汝克黜乃心，施實德于民，至于婚友，丕乃敢大言汝有積德。",
          "en": "If you can put away your (selfish) thoughts, and bestow real good upon the people, reaching (also) to your own relatives and friends, you may boldly venture to make your words great, and say that you have accumulated merit."
        },
        {
          "ref": "18:18",
          "zh": "乃不畏戎毒于遠邇，惰農自安，不昏作勞，不服田畝，越其罔有黍稷。",
          "en": "But you do not fear the great evils which (through our not removing) are extending far and near; (you are like) idle husbandmen, who yield themselves to ease, and are not strong to toil and labour on their acres, so that they cannot get their crop of millets."
        },
        {
          "ref": "18:19",
          "zh": "汝不和吉言于百姓，惟汝自生毒，乃敗禍姦宄，以自災于厥身。",
          "en": "You do not speak in a spirit of harmony and goodness to the people, and are only giving birth to bitter evils for yourselves. You play the part of destroyers and authors of calamity, of villains and traitors, to bring down misery on your own persons."
        },
        {
          "ref": "18:20",
          "zh": "乃既先惡于民，乃奉其恫，汝悔身何及！",
          "en": "You set the example of evil, and must feel its smart; what will it avail you (then) to repent?"
        },
        {
          "ref": "18:21",
          "zh": "相時憸民，猶胥顧于箴言，其發有逸口，矧予制乃短長之命！",
          "en": "Look at the poor people - they are still able to look to one another and give expression to their remonstrances, but when they begin to speak, you are ready with your extravagant talk; how much more ought you to have me before your eyes, with whom it is to make your lives long or short!"
        },
        {
          "ref": "18:22",
          "zh": "汝曷弗告朕，而胥動以浮言，恐沈于眾？",
          "en": "Why do you not report (their words) to me, but go about to excite one another by empty speeches, frightening and involving the multitudes in misery?"
        },
        {
          "ref": "18:23",
          "zh": "若火之燎于原，不可嚮邇，其猶可撲滅。則惟汝眾自作弗靖，非予有咎。",
          "en": "When a fire is blazing in the flames so that it cannot be approached, can it still be beaten out? So, it will not be I who will be to blame, that you all cause dispeace in this way, (and must suffer the consequences)."
        },
        {
          "ref": "18:24",
          "zh": "遲任有言曰：『人惟求舊，器非求舊，惟新。』",
          "en": "Chi Ren has said, 'In men we seek those of old families; in vessels, we do not seek old ones, but new.'"
        },
        {
          "ref": "18:25",
          "zh": "古我先王暨乃祖乃父胥及逸勤，予敢動用非罰？",
          "en": "Of old, the kings, my predecessors, and your forefathers and fathers shared together the ease and labours (of the government); how should I dare to lay undeserved afflictions on you?"
        },
        {
          "ref": "18:26",
          "zh": "世選爾勞，予不掩爾善。",
          "en": "For generations the toils of your (fathers) have been approved, and I will not conceal your goodness."
        },
        {
          "ref": "18:27",
          "zh": "茲予大享于先王，爾祖其從與享之。",
          "en": "Now when I offer the great sacrifices to my predecessors, your forefathers are present to share in them."
        },
        {
          "ref": "18:28",
          "zh": "作福作災，予亦不敢動用非德。",
          "en": "(They all observe) the happiness I confer and the sufferings I inflict, and I cannot dare to reward virtue that does not exist."
        },
        {
          "ref": "18:29",
          "zh": "「予告汝于難，若射之有志。",
          "en": "I have announced to you the difficulties (of the intended movement), being bent on it, like an archer (whose only thought is to hit)."
        },
        {
          "ref": "18:30",
          "zh": "汝無侮老成人，無弱孤有幼。",
          "en": "Do not you despise the old and experienced, and do not make little of the helpless and young."
        },
        {
          "ref": "18:31",
          "zh": "各長于厥居。",
          "en": "Seek every one long continuance in this (new city), which is to be your abode."
        },
        {
          "ref": "18:32",
          "zh": "勉出乃力，聽予一人之作猷。",
          "en": "Exert yourselves and put out your strength (in furthering the removal), and listen to the plans of me, the One man."
        },
        {
          "ref": "18:33",
          "zh": "無有遠邇，用罪伐厥死，用德彰厥善。",
          "en": "I will make no distinction between men as being more distantly or more nearly related to me; the criminal (in this matter) shall die the death, and the good-doer shall have his virtue distinguished."
        },
        {
          "ref": "18:34",
          "zh": "邦之臧，惟汝眾；邦之不臧，惟予一人有佚罰。",
          "en": "The prosperity of the country (ought to) come from you all. If it fail of prosperity, that must arise from me, the One man, erring in the application of punishment."
        },
        {
          "ref": "18:35",
          "zh": "凡爾眾，其惟致告：自今至于後日，各恭爾事，齊乃位，度乃口。罰及爾身，弗可悔。」",
          "en": "Be sure, all of you, to make known this announcement. From this time forward, attend respectfully to your business; have (the duties of) your offices regularly adjusted; bring your tongues under the rule of law: lest punishment come upon you, when repentance will be of no avail.'"
        }
      ]
    },
    {
      "number": "19",
      "title": "Pan Geng Ii",
      "slug": "pan-geng-ii",
      "passages": [
        {
          "ref": "19:1",
          "zh": "盤庚作，惟涉河以民遷。",
          "en": "Pan-geng arose, and (was about to) cross the He with the people, moving (to the new capital)."
        },
        {
          "ref": "19:2",
          "zh": "乃話民之弗率，誕告用亶。",
          "en": "Accordingly, he addressed himself to those of them who were (still) dissatisfied, and made a full announcement to their multitudes, to induce a sincere acquiescence (in the measure)."
        },
        {
          "ref": "19:3",
          "zh": "其有眾咸造，勿褻在王庭，盤庚乃登進厥民。",
          "en": "They all attended, and (being charged) to take no liberties in the royal courtyard, he called them near."
        },
        {
          "ref": "19:4",
          "zh": "曰：「明聽朕言，無荒失朕命！",
          "en": "And said, 'Listen clearly to my words, and do not disregard my commands."
        },
        {
          "ref": "19:5",
          "zh": "嗚呼！古我前后，罔不惟民之承保。",
          "en": "Oh! of old time my royal predecessors cherished, every one and above every other thing, a respectful care of the people, who (again) upheld their sovereign with a mutual sympathy."
        },
        {
          "ref": "19:6",
          "zh": "后胥戚鮮，以不浮于天時。",
          "en": "Seldom was it that they were not superior to any (calamitous) time sent by Heaven."
        },
        {
          "ref": "19:7",
          "zh": "殷降大虐，先王不懷厥攸作，視民利用遷。",
          "en": "When great calamities came down on Yin, the former kings did not fondly remain in their place. What they did was with a view to the people's advantage, and therefore they moved (their capitals)."
        },
        {
          "ref": "19:8",
          "zh": "汝曷弗念我古后之聞？",
          "en": "Why do you not reflect that I, according to what I have heard of the ancient sovereigns, in my care of you and actings towards you, am only wishing to rejoice with you in a common repose?"
        },
        {
          "ref": "19:9",
          "zh": "承汝俾汝惟喜康共，非汝有咎比于罰。",
          "en": "It is not that any guilt attaches to you, so that (this movement) should be like a punishment."
        },
        {
          "ref": "19:10",
          "zh": "予若籲懷茲新邑，亦惟汝故，以丕從厥志。",
          "en": "If I call upon you to cherish this new city, it is simply on your account, and as an act of great accordance with your wishes."
        },
        {
          "ref": "19:11",
          "zh": "今予將試以汝遷，安定厥邦。",
          "en": "My present undertaking to remove with you, is to give repose and stability to the country."
        },
        {
          "ref": "19:12",
          "zh": "汝不憂朕心之攸困，乃咸大不宣乃心，欽念以忱動予一人。",
          "en": "You, (however), have no sympathy with the anxieties of my mind; but you all keep a great reserve in declaring your minds, (when you might) respectfully think by your sincerity to move me, the One man."
        },
        {
          "ref": "19:13",
          "zh": "爾惟自鞠自苦，若乘舟，汝弗濟，臭厥載。",
          "en": "You only exhaust and distress yourselves. The case is like that of sailing in a boat; if you do not cross the stream (at the proper time), you will destroy all the cargo."
        },
        {
          "ref": "19:14",
          "zh": "爾忱不屬，惟胥以沈。",
          "en": "Your sincerity does not respond to mine, and we are in danger of going together to destruction."
        },
        {
          "ref": "19:15",
          "zh": "不其或稽，自怒曷瘳？",
          "en": "You, notwithstanding, will not examine the matter; though you anger yourselves, what cure will that bring?"
        },
        {
          "ref": "19:16",
          "zh": "汝不謀長以思乃災，汝誕勸憂。",
          "en": "You do not consult for a distant day, nor think of the calamity that must befall you (from not removing). You greatly encourage one another in what must prove to your sorrow."
        },
        {
          "ref": "19:17",
          "zh": "今其有今罔後，汝何生在上？",
          "en": "Now you have the present, but you will not have the future; what prolongation of life can you look for from above?"
        },
        {
          "ref": "19:18",
          "zh": "今予命汝，一無起穢以自臭，恐人倚乃身，迂乃心。",
          "en": "Now I charge you to have but one mind. Do not let wicked thoughts arise to ruin yourselves. I am afraid that men bend your persons, and pervert your minds."
        },
        {
          "ref": "19:19",
          "zh": "予迓續乃命于天，予豈汝威，用奉畜汝眾。",
          "en": "My measures are forecast to prolong your (lease of) life from Heaven; do I force you by the terrors of my power? My object is to support and nourish you all."
        },
        {
          "ref": "19:20",
          "zh": "予念我先神后之勞爾先，予丕克羞爾，用懷爾，然。",
          "en": "I think of my ancestors, (who are now) the spiritual sovereigns; when they made your forefathers toil (on similar occasions it was only for their good), and I would be enabled in the same way greatly to nourish you and cherish you."
        },
        {
          "ref": "19:21",
          "zh": "失于政，陳于茲，高后丕乃崇降罪疾，曰『曷虐朕民？』",
          "en": "Were I to err in my government, and remain long here, my high sovereign, (the founder of our dynasty), would send down on me great punishment for my crime, and say, 'Why do you oppress my people?'"
        },
        {
          "ref": "19:22",
          "zh": "汝萬民乃不生生，暨予一人猷同心，先后丕降與汝罪疾，曰：『曷不暨朕幼孫有比？』",
          "en": "If you, the myriads of the people, do not attend to the perpetuation of your lives, and cherish one mind with me, the One man, in my plans, the former kings will send down on you great punishment for your crime, and say, 'Why do you not agree with our young grandson, but go on to forfeit your virtue?'"
        },
        {
          "ref": "19:23",
          "zh": "故有爽德，自上其罰汝，汝罔能迪。",
          "en": "When they punish you from above, you will have no way of escape."
        },
        {
          "ref": "19:24",
          "zh": "「古我先后既勞乃祖乃父，汝共作我畜民，汝有戕則在乃心！",
          "en": "Of old, my royal predecessors made your ancestors and fathers toil (only for their good). You are equally the people whom I (wish to) cherish. But your conduct is injurious; it is cherished in your hearts."
        },
        {
          "ref": "19:25",
          "zh": "我先后綏乃祖乃父，乃祖乃父乃斷棄汝，不救乃死。",
          "en": "Whereas my royal predecessors made your ancestors and fathers happy, they, your ancestors and fathers, will (now) cut you off and abandon you, and not save you from death."
        },
        {
          "ref": "19:26",
          "zh": "茲予有亂政同位，具乃貝玉。",
          "en": "Here are those ministers of my government, who share with me in the offices (of the kingdom); and yet they (only think of hoarding up) cowries and gems."
        },
        {
          "ref": "19:27",
          "zh": "乃祖乃父丕乃告我高后曰：『作丕刑于朕孫！』迪高后丕乃崇降弗祥。」",
          "en": "Their ancestors and fathers earnestly represent (their course) to my high sovereign, saying, 'Execute great punishments on our descendants.' So do they advise my high sovereign to send down great calamities (on those men).'"
        },
        {
          "ref": "19:28",
          "zh": "嗚呼！今予告汝：不易！",
          "en": "Oh! I have now told you my unchangeable purpose."
        },
        {
          "ref": "19:29",
          "zh": "永敬大恤，無胥絕遠！",
          "en": "Do you perpetually respect (my) great anxiety; let us not get alienated and removed from one another."
        },
        {
          "ref": "19:30",
          "zh": "汝分猷念以相從，各設中于乃心。",
          "en": "Share in my plans and thoughts, and think (only) of following me; let every one of you set up the true rule of conduct in his heart."
        },
        {
          "ref": "19:31",
          "zh": "乃有不吉不迪，顛越不恭，暫遇姦宄，我乃劓殄滅之，無遺育，無俾易種于茲新邑。",
          "en": "If there be bad and unprincipled men, precipitously or carelessly disrespectful (to my orders), and taking advantage of this brief season to play the part of villains or traitors, I will cut off their noses, or utterly exterminate them. I will leave none of their children. I will not let them perpetuate their seed in this new city."
        },
        {
          "ref": "19:32",
          "zh": "往哉！生生！今予將試以汝遷，永建乃家。」",
          "en": "Go! preserve and continue your lives. I will now transfer you (to the new capital), and (there) establish your families for ever.'"
        }
      ]
    },
    {
      "number": "20",
      "title": "Pan Geng Iii",
      "slug": "pan-geng-iii",
      "passages": [
        {
          "ref": "20:1",
          "zh": "盤庚既遷，奠厥攸居，乃正厥位，綏爰有眾。",
          "en": "Pan-geng having completed the removal, and settled the places of residence, proceeded to adjust the several positions (of all classes at an assembly); and then he soothed and comforted the multitudes."
        },
        {
          "ref": "20:2",
          "zh": "曰：「無戲怠，懋建大命！",
          "en": "Saying to them, 'Do not play nor be idle, but exert yourselves to build (here) a great destiny (for us)."
        },
        {
          "ref": "20:3",
          "zh": "今予其敷心腹腎腸，歷告爾百姓于朕志。",
          "en": "Now I have disclosed my heart and belly, my reins and bowels, and fully declared to you, my people, all my mind."
        },
        {
          "ref": "20:4",
          "zh": "罔罪爾眾，爾無共怒，協比讒言予一人。",
          "en": "I will not treat any of you as offenders; and do not you (any more) help one another to be angry, and form parties to defame me, the One man."
        },
        {
          "ref": "20:5",
          "zh": "古我先王將多于前功，適于山。",
          "en": "Of old, my royal predecessor, (Tang), that his merit might exceed that of those who were before him, proceeded to the hill-site."
        },
        {
          "ref": "20:6",
          "zh": "用降我凶，德嘉績于朕邦。",
          "en": "Thereby he removed our evils, and accomplished admirable good for our country."
        },
        {
          "ref": "20:7",
          "zh": "今我民用蕩析離居，罔有定極，爾謂朕曷震動萬民以遷？",
          "en": "Now you, my people, were by (your position) dissipated and separated, so that you had no abiding place. (And yet) you asked why I was troubling your myriads and requiring you to remove."
        },
        {
          "ref": "20:8",
          "zh": "肆上帝將復我高祖之德，亂越我家。",
          "en": "But God, being about to renew the virtuous service of my high ancestor, and secure the good order of our kingdom."
        },
        {
          "ref": "20:9",
          "zh": "朕及篤敬，恭承民命，用永地于新邑。",
          "en": "I, with the sincere and respectful (of my ministers), felt a reverent care for the lives of the people, and have made a lasting settlement in (this) new city."
        },
        {
          "ref": "20:10",
          "zh": "肆予沖人，非廢厥謀，弔由靈各；非敢違卜，用宏茲賁。",
          "en": "I, a youth, did not neglect your counsels; I (only) used the best of them. Nor did any of you presumptuously oppose the decision of the tortoise-shell; so we are here to enlarge our great inheritance.'"
        },
        {
          "ref": "20:11",
          "zh": "嗚呼！邦伯師長百執事之人，尚皆隱哉！",
          "en": "Oh! ye chiefs of regions, ye heads of departments, all ye, the hundreds of officers, would that ye had a sympathy (with my people)!"
        },
        {
          "ref": "20:12",
          "zh": "予其懋簡相爾念敬我眾。",
          "en": "I will exert myself in the choice and guiding of you; do ye think reverently of my multitudes."
        },
        {
          "ref": "20:13",
          "zh": "朕不肩好貨，敢恭生生。",
          "en": "I will not employ those who are fond of enriching themselves; but will use and revere those who are vigorously, yet reverently, labouring for the lives and increase of the people, nourishing them and planning for their enduring settlement."
        },
        {
          "ref": "20:14",
          "zh": "鞠人謀人之保居，敘欽。",
          "en": "I have now brought forward and announced to you my mind, whom I approve and whom I disallow; let none of you but reverence (my will)."
        },
        {
          "ref": "20:15",
          "zh": "今我既羞告爾于朕志若否，罔有弗欽！",
          "en": "Do not seek to accumulate wealth and precious things, but in fostering the life of the people, seek to find your merit."
        },
        {
          "ref": "20:16",
          "zh": "無總于貨寶，生生自庸。式敷民德，永肩一心。」",
          "en": "Reverently display your virtue in behalf of the people. For ever maintain this one purpose in your hearts.'"
        }
      ]
    },
    {
      "number": "49",
      "title": "Jun Chen",
      "slug": "jun-chen",
      "passages": [
        {
          "ref": "49:1",
          "zh": "王若曰：「君陳，惟爾令德孝恭。",
          "en": "The king spake to the following effect: 'Jun-chen, it is you who are possessed of excellent virtue, filial and respectful."
        },
        {
          "ref": "49:2",
          "zh": "惟孝友于兄弟，克施有政。",
          "en": "Being filial, and friendly with your brethren, you can display these qualities in the exercise of government."
        },
        {
          "ref": "49:3",
          "zh": "命汝尹茲東郊，敬哉！",
          "en": "I appoint you to rule this eastern border. Be reverent."
        },
        {
          "ref": "49:4",
          "zh": "昔周公師保萬民，民懷其德。",
          "en": "Formerly, the duke of Zhou acted as teacher and guardian of the myriads of the people, who cherish (the remembrance of) his virtue."
        },
        {
          "ref": "49:5",
          "zh": "往慎乃司，茲率厥常，懋昭周公之訓，惟民其乂。",
          "en": "Go and with sedulous care enter upon his charge; act in accordance with his regular ways, and exert yourself to illustrate his lessons; so shall the people be regulated."
        },
        {
          "ref": "49:6",
          "zh": "我聞曰：『至治馨香，感于神明。黍稷非馨，明德惟馨爾。』",
          "en": "I have heard that he said, 'Perfect government has a piercing fragrance, and influences the spiritual intelligences. It is not the millet which has the piercing fragrance; it is bright virtue.'"
        },
        {
          "ref": "49:7",
          "zh": "尚式時周公之猷訓，惟日孜孜，無敢逸豫。",
          "en": "Do you make this lesson of the duke of Zhou your rule, being diligent from day to day, and not presuming to indulge in luxurious ease."
        },
        {
          "ref": "49:8",
          "zh": "凡人未見聖，若不克見；既見聖，亦不克由聖，爾其戒哉！",
          "en": "Ordinary men, while they have not yet seen a sage, (are full of desire) as if they should never get a sight of him; and after they have seen him, they are still unable to follow him. Be cautioned by this!"
        },
        {
          "ref": "49:9",
          "zh": "爾惟風，下民惟草。",
          "en": "You are the wind; the inferior people are the grass."
        },
        {
          "ref": "49:10",
          "zh": "圖厥政，莫或不艱，有廢有興，出入自爾師虞，庶言同則繹。",
          "en": "In revolving the plans of your government, never hesitate to acknowledge the difficulty of the subject. Some things have to be abolished, and some new things to be enacted; going out and coming in, seek the judgment of your people about them, and, when there is a general agreement, exert your own powers of reflection."
        },
        {
          "ref": "49:11",
          "zh": "爾有嘉謀嘉猷，則入告爾后于內，爾乃順之于外，曰：『斯謀斯猷，惟我后之德。』",
          "en": "When you have any good plans or counsels, enter and lay them before your sovereign in the palace. Thereafter, when you are acting abroad in accordance with them, say, 'This plan or this view is all due to our sovereign.'"
        },
        {
          "ref": "49:12",
          "zh": "嗚呼！臣人咸若時，惟良顯哉！」",
          "en": "Oh! if all ministers were to act thus, how excellent would they be, and how distinguished!'"
        },
        {
          "ref": "49:13",
          "zh": "王曰：「君陳，爾惟弘周公丕訓，無依勢作威，無倚法以削，寬而有制，從容以和。",
          "en": "The king said, 'Jun-chen, do you give their full development to the great lessons of the duke of Zhou. Do not make use of your power to exercise oppression; do not make use of the laws to practise extortion. Be gentle, but with strictness of rule. Promote harmony by the display of an easy forbearance."
        },
        {
          "ref": "49:14",
          "zh": "殷民在辟，予曰辟，爾惟勿辟；予曰宥，爾惟勿宥，惟厥中。",
          "en": "When any of the people of Yin are amenable to punishment, if I say \"Punish,\" do not you therefore punish; and if I say \"Spare,\" do not you therefore spare. Seek the due middle course."
        },
        {
          "ref": "49:15",
          "zh": "有弗若于汝政，弗化于汝訓，辟以止辟，乃辟。",
          "en": "Those who are disobedient to your government, and uninfluenced by your instructions, you will punish, remembering that the end of punishment is to make an end of punishing."
        },
        {
          "ref": "49:16",
          "zh": "狃于奸宄，敗常亂俗，三細不宥。",
          "en": "Those who are inured to villainy and treachery, those who violate the regular duties of society, and those who introduce disorder into the public manners: those three classes you will not spare, though their particular offences be but small."
        },
        {
          "ref": "49:17",
          "zh": "爾無忿疾于頑，無求備于一夫。",
          "en": "Do not cherish anger against the obstinate, and dislike them. Seek not every quality in one individual."
        },
        {
          "ref": "49:18",
          "zh": "必有忍，其乃有濟；有容，德乃大。",
          "en": "You must have patience, and you will be successful; have forbearance, and your virtue will be great."
        },
        {
          "ref": "49:19",
          "zh": "簡厥修，亦簡其或不修。進厥良，以率其或不良。",
          "en": "Mark those who discharge their duties well, and also mark those who do not do so, (and distinguish them from one another.) Advance the good, to induce those who may not be so to follow (their example)."
        },
        {
          "ref": "49:20",
          "zh": "惟民生厚，因物有遷。違上所命，從厥攸好。",
          "en": "The people are born good, and are changed by (external) things, so that they resist what their superiors command, and follow what they (themselves) love."
        },
        {
          "ref": "49:21",
          "zh": "爾克敬典在德，時乃罔不變。",
          "en": "Do you but reverently observe the statutes, and they will be found in (the way of) virtue; they will thus all be changed, and truly advance to a great degree of excellence."
        },
        {
          "ref": "49:22",
          "zh": "允升于大猷，惟予一人膺受多福，其爾之休，終有辭於永世。」",
          "en": "Then shall I, the One man, receive much happiness, and your excellent services will be famous through long ages!'"
        }
      ]
    }
  ]
}
